; ModuleID = 'net/mac80211/mlme.bc'
source_filename = "net/mac80211/mlme.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kernel_param_ops = type { i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.kernel_param_ops*, i16, i16, %union.anon.52 }
%union.anon.52 = type { i8* }
%struct.kernel_symbol = type { i64, i8* }
%struct.lock_class_key = type {}
%struct.smp_ops = type { void ()*, void (i32)*, void (i32)*, void (i32)*, void (i32)*, i32 (i32, %struct.task_struct*)*, i32 ()*, void (i32)*, void ()*, void (%struct.cpumask*)*, void (i32)* }

!15 = !DIEnumerator(name: "IEEE80211_BAND_60GHZ", value: 2)
!16 = !DIEnumerator(name: "IEEE80211_NUM_BANDS", value: 3)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_dfs_state", file: !18, line: 3685, size: 32, elements: !19)
!18 = !DIFile(filename: "/home/vmalik/src/kernel/linux-3.10/include/uapi/linux/nl80211.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "NL80211_DFS_USABLE", value: 0)
!21 = !DIEnumerator(name: "NL80211_DFS_UNAVAILABLE", value: 1)
!22 = !DIEnumerator(name: "NL80211_DFS_AVAILABLE", value: 2)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_reg_initiator", file: !18, line: 2208, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NL80211_REGDOM_SET_BY_CORE", value: 0)
!26 = !DIEnumerator(name: "NL80211_REGDOM_SET_BY_USER", value: 1)
!27 = !DIEnumerator(name: "NL80211_REGDOM_SET_BY_DRIVER", value: 2)
!28 = !DIEnumerator(name: "NL80211_REGDOM_SET_BY_COUNTRY_IE", value: 3)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_user_reg_hint_type", file: !18, line: 2358, size: 32, elements: !30)
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "NL80211_USER_REG_HINT_USER", value: 0)
!32 = !DIEnumerator(name: "NL80211_USER_REG_HINT_CELL_BASE", value: 1)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "environment_cap", file: !34, line: 30, size: 32, elements: !35)
!34 = !DIFile(filename: "include/net/regulatory.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!35 = !{!36, !37, !38}
!36 = !DIEnumerator(name: "ENVIRON_ANY", value: 0)
!37 = !DIEnumerator(name: "ENVIRON_INDOOR", value: 1)
!38 = !DIEnumerator(name: "ENVIRON_OUTDOOR", value: 2)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !40, line: 27, size: 32, elements: !41)
!40 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!43 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!44 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !46, line: 53, size: 32, elements: !47)
!46 = !DIFile(filename: "include/linux/quota.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "USRQUOTA", value: 0)
!49 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!50 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !52, line: 6, size: 32, elements: !53)
!52 = !DIFile(filename: "include/linux/pid.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!55 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!56 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!57 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !59, line: 10, size: 32, elements: !60)
!59 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!62 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!63 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netdev_tx", file: !65, line: 110, size: 32, elements: !66)
!65 = !DIFile(filename: "include/linux/netdevice.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "__NETDEV_TX_MIN", value: -2147483648)
!68 = !DIEnumerator(name: "NETDEV_TX_OK", value: 0)
!69 = !DIEnumerator(name: "NETDEV_TX_BUSY", value: 16)
!70 = !DIEnumerator(name: "NETDEV_TX_LOCKED", value: 32)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !72, line: 55, size: 32, elements: !73)
!72 = !DIFile(filename: "include/linux/ethtool.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0)
!75 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1)
!76 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2)
!77 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !65, line: 385, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0)
!81 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1)
!82 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2)
!83 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !85, file: !65, line: 1260, size: 32, elements: !5440)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !65, line: 1040, size: 14848, elements: !86)
!86 = !{!87, !92, !100, !102, !104, !105, !106, !108, !109, !115, !116, !117, !118, !124, !125, !126, !127, !128, !130, !131, !157, !165, !656, !1064, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1163, !1164, !1165, !1298, !1299, !1300, !1301, !1302, !1305, !1308, !1311, !1312, !5268, !5269, !5270, !5297, !5298, !5299, !5306, !5307, !5340, !5341, !5342, !5343, !5344, !5345, !5346, !5347, !5361, !5364, !5365, !5366, !5367, !5368, !5369, !5370, !5371, !5372, !5373, !5378, !5379, !5380, !5381, !5397, !5400, !5403, !5404, !5406, !5410, !5411, !5412, !5413, !5419, !5420, !5423, !5425, !5426}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !65, line: 1047, baseType: !88, size: 128)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !90)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !{!91}
!91 = !DISubrange(count: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name_hlist", scope: !85, file: !65, line: 1050, baseType: !93, size: 128, offset: 128)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !94, line: 193, size: 128, elements: !95)
!94 = !DIFile(filename: "include/linux/types.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !94, line: 194, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !93, file: !94, line: 194, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !85, file: !65, line: 1053, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !85, file: !65, line: 1059, baseType: !103, size: 64, offset: 320)
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !85, file: !65, line: 1060, baseType: !103, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !85, file: !65, line: 1061, baseType: !103, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !85, file: !65, line: 1062, baseType: !107, size: 32, offset: 512)
!107 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !85, file: !65, line: 1069, baseType: !103, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !85, file: !65, line: 1071, baseType: !110, size: 128, offset: 640)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !94, line: 185, size: 128, elements: !111)
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !94, line: 186, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !94, line: 186, baseType: !113, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !85, file: !65, line: 1072, baseType: !110, size: 128, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !85, file: !65, line: 1073, baseType: !110, size: 128, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "upper_dev_list", scope: !85, file: !65, line: 1074, baseType: !110, size: 128, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !85, file: !65, line: 1078, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !120, line: 15, baseType: !121)
!120 = !DIFile(filename: "include/linux/netdev_features.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !122, line: 25, baseType: !123)
!122 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!123 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !85, file: !65, line: 1080, baseType: !119, size: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !85, file: !65, line: 1082, baseType: !119, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !85, file: !65, line: 1084, baseType: !119, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !85, file: !65, line: 1090, baseType: !119, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !85, file: !65, line: 1093, baseType: !129, size: 32, offset: 1472)
!129 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "iflink", scope: !85, file: !65, line: 1094, baseType: !129, size: 32, offset: 1504)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !85, file: !65, line: 1096, baseType: !132, size: 1472, offset: 1536)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !65, line: 163, size: 1472, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !132, file: !65, line: 164, baseType: !103, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !132, file: !65, line: 165, baseType: !103, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !132, file: !65, line: 166, baseType: !103, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !132, file: !65, line: 167, baseType: !103, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !132, file: !65, line: 168, baseType: !103, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !132, file: !65, line: 169, baseType: !103, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !132, file: !65, line: 170, baseType: !103, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !132, file: !65, line: 171, baseType: !103, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !132, file: !65, line: 172, baseType: !103, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !132, file: !65, line: 173, baseType: !103, size: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !132, file: !65, line: 174, baseType: !103, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !132, file: !65, line: 175, baseType: !103, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !132, file: !65, line: 176, baseType: !103, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !132, file: !65, line: 177, baseType: !103, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !132, file: !65, line: 178, baseType: !103, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !132, file: !65, line: 179, baseType: !103, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !132, file: !65, line: 180, baseType: !103, size: 64, offset: 1024)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !132, file: !65, line: 181, baseType: !103, size: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !132, file: !65, line: 182, baseType: !103, size: 64, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !132, file: !65, line: 183, baseType: !103, size: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !132, file: !65, line: 184, baseType: !103, size: 64, offset: 1280)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !132, file: !65, line: 185, baseType: !103, size: 64, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !132, file: !65, line: 186, baseType: !103, size: 64, offset: 1408)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !85, file: !65, line: 1097, baseType: !158, size: 64, offset: 3008)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !159, line: 23, baseType: !160)
!159 = !DIFile(filename: "include/asm-generic/atomic-long.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !94, line: 182, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 180, size: 64, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !161, file: !94, line: 181, baseType: !164, size: 64)
!164 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !85, file: !65, line: 1109, baseType: !166, size: 64, offset: 3072)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !65, line: 906, size: 2816, elements: !169)
!169 = !{!170, !175, !179, !180, !181, !298, !303, !307, !308, !313, !314, !426, !431, !435, !441, !442, !474, !479, !483, !484, !485, !492, !493, !499, !503, !507, !513, !530, !541, !545, !549, !556, !560, !561, !565, !569, !576, !580, !598, !602, !642, !647, !651, !652}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !168, file: !65, line: 907, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!129, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !168, file: !65, line: 908, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !174}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !168, file: !65, line: 909, baseType: !171, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !168, file: !65, line: 910, baseType: !171, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !168, file: !65, line: 911, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !186, !174}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !65, line: 116, baseType: !64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !188, line: 406, size: 1920, elements: !189)
!188 = !DIFile(filename: "include/linux/skbuff.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!189 = !{!190, !191, !192, !200, !204, !205, !209, !210, !213, !214, !215, !219, !220, !232, !233, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !251, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !284, !286, !287, !288, !289, !290, !291, !292, !293, !295, !296, !297}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !188, line: 408, baseType: !186, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !188, line: 409, baseType: !186, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !187, file: !188, line: 411, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !194, line: 59, baseType: !195)
!194 = !DIFile(filename: "include/linux/ktime.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!195 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ktime", file: !194, line: 46, size: 64, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tv64", scope: !195, file: !194, line: 47, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !122, line: 24, baseType: !199)
!199 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !187, file: !188, line: 413, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !203, line: 116, flags: DIFlagFwdDecl)
!203 = !DIFile(filename: "include/linux/net.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !187, file: !188, line: 414, baseType: !174, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !187, file: !188, line: 422, baseType: !206, size: 384, align: 64, offset: 320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 384, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 48)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !187, file: !188, line: 424, baseType: !103, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !187, file: !188, line: 426, baseType: !211, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "sec_path", file: !188, line: 426, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !187, file: !188, line: 428, baseType: !107, size: 32, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !187, file: !188, line: 429, baseType: !107, size: 32, offset: 864)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !187, file: !188, line: 430, baseType: !216, size: 16, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !217, line: 23, baseType: !218)
!217 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!218 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !187, file: !188, line: 431, baseType: !216, size: 16, offset: 912)
!220 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !188, line: 432, baseType: !221, size: 32, offset: 928)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 432, size: 32, elements: !222)
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !221, file: !188, line: 433, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !225, line: 40, baseType: !226)
!225 = !DIFile(filename: "include/uapi/linux/types.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !217, line: 26, baseType: !107)
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !221, file: !188, line: 434, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !188, line: 434, size: 32, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !228, file: !188, line: 435, baseType: !216, size: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !228, file: !188, line: 436, baseType: !216, size: 16, offset: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !187, file: !188, line: 439, baseType: !226, size: 32, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "local_df", scope: !187, file: !188, line: 441, baseType: !234, size: 1, offset: 992, flags: DIFlagBitField, extraData: i64 992)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !217, line: 20, baseType: !235)
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !187, file: !188, line: 442, baseType: !234, size: 1, offset: 993, flags: DIFlagBitField, extraData: i64 992)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !187, file: !188, line: 443, baseType: !234, size: 2, offset: 994, flags: DIFlagBitField, extraData: i64 992)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !187, file: !188, line: 444, baseType: !234, size: 1, offset: 996, flags: DIFlagBitField, extraData: i64 992)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nfctinfo", scope: !187, file: !188, line: 445, baseType: !234, size: 3, offset: 997, flags: DIFlagBitField, extraData: i64 992)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !187, file: !188, line: 446, baseType: !234, size: 3, offset: 1000, flags: DIFlagBitField, extraData: i64 992)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !187, file: !188, line: 447, baseType: !234, size: 2, offset: 1003, flags: DIFlagBitField, extraData: i64 992)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !187, file: !188, line: 448, baseType: !234, size: 1, offset: 1005, flags: DIFlagBitField, extraData: i64 992)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !187, file: !188, line: 449, baseType: !234, size: 1, offset: 1006, flags: DIFlagBitField, extraData: i64 992)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !187, file: !188, line: 450, baseType: !234, size: 1, offset: 1007, flags: DIFlagBitField, extraData: i64 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !187, file: !188, line: 452, baseType: !246, size: 16, offset: 1008)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !225, line: 33, baseType: !216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !187, file: !188, line: 454, baseType: !248, size: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !186}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nfct", scope: !187, file: !188, line: 456, baseType: !252, size: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nf_conntrack", file: !188, line: 114, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !253, file: !188, line: 115, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !94, line: 177, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 175, size: 32, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !257, file: !94, line: 176, baseType: !129, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nfct_reasm", scope: !187, file: !188, line: 459, baseType: !186, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !187, file: !188, line: 465, baseType: !129, size: 32, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rxhash", scope: !187, file: !188, line: 467, baseType: !226, size: 32, offset: 1248)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !187, file: !188, line: 469, baseType: !246, size: 16, offset: 1280)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !187, file: !188, line: 470, baseType: !216, size: 16, offset: 1296)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !187, file: !188, line: 473, baseType: !216, size: 16, offset: 1312)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tc_verd", scope: !187, file: !188, line: 475, baseType: !216, size: 16, offset: 1328)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !187, file: !188, line: 479, baseType: !216, size: 16, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !187, file: !188, line: 482, baseType: !234, size: 2, offset: 1360, flags: DIFlagBitField, extraData: i64 1360)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !187, file: !188, line: 484, baseType: !234, size: 1, offset: 1362, flags: DIFlagBitField, extraData: i64 1360)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !187, file: !188, line: 485, baseType: !234, size: 1, offset: 1363, flags: DIFlagBitField, extraData: i64 1360)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "l4_rxhash", scope: !187, file: !188, line: 486, baseType: !234, size: 1, offset: 1364, flags: DIFlagBitField, extraData: i64 1360)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !187, file: !188, line: 487, baseType: !234, size: 1, offset: 1365, flags: DIFlagBitField, extraData: i64 1360)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !187, file: !188, line: 488, baseType: !234, size: 1, offset: 1366, flags: DIFlagBitField, extraData: i64 1360)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !187, file: !188, line: 489, baseType: !234, size: 1, offset: 1367, flags: DIFlagBitField, extraData: i64 1360)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !187, file: !188, line: 490, baseType: !234, size: 1, offset: 1368, flags: DIFlagBitField, extraData: i64 1360)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !187, file: !188, line: 496, baseType: !234, size: 1, offset: 1369, flags: DIFlagBitField, extraData: i64 1360)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "secmark", scope: !187, file: !188, line: 504, baseType: !226, size: 32, offset: 1376)
!278 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !188, line: 506, baseType: !279, size: 32, offset: 1408)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 506, size: 32, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !279, file: !188, line: 507, baseType: !226, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dropcount", scope: !279, file: !188, line: 508, baseType: !226, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !279, file: !188, line: 509, baseType: !226, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !187, file: !188, line: 512, baseType: !285, size: 32, offset: 1440)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !188, line: 329, baseType: !107)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !187, file: !188, line: 513, baseType: !285, size: 32, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !187, file: !188, line: 514, baseType: !285, size: 32, offset: 1504)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !187, file: !188, line: 515, baseType: !285, size: 32, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !187, file: !188, line: 516, baseType: !285, size: 32, offset: 1568)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !187, file: !188, line: 517, baseType: !285, size: 32, offset: 1600)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !187, file: !188, line: 519, baseType: !285, size: 32, offset: 1632)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !187, file: !188, line: 520, baseType: !285, size: 32, offset: 1664)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !187, file: !188, line: 521, baseType: !294, size: 64, offset: 1728)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !188, line: 522, baseType: !294, size: 64, offset: 1792)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !187, file: !188, line: 523, baseType: !107, size: 32, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !187, file: !188, line: 524, baseType: !256, size: 32, offset: 1888)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !168, file: !65, line: 913, baseType: !299, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !174, !186}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !122, line: 19, baseType: !218)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !168, file: !65, line: 915, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !174, !129}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !168, file: !65, line: 917, baseType: !176, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !168, file: !65, line: 918, baseType: !309, size: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!129, !174, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !168, file: !65, line: 920, baseType: !171, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !168, file: !65, line: 921, baseType: !315, size: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!129, !174, !318, !129}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !320, line: 176, size: 320, elements: !321)
!320 = !DIFile(filename: "/home/vmalik/src/kernel/linux-3.10/include/uapi/linux/if.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!321 = !{!322, !326}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !319, file: !320, line: 181, baseType: !323, size: 128)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !320, line: 178, size: 128, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !323, file: !320, line: 180, baseType: !88, size: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !319, file: !320, line: 197, baseType: !327, size: 192, offset: 128)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !320, line: 183, size: 192, elements: !328)
!328 = !{!329, !341, !342, !343, !344, !345, !347, !348, !349, !358, !359, !360, !361}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !327, file: !320, line: 184, baseType: !330, size: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !331, line: 29, size: 128, elements: !332)
!331 = !DIFile(filename: "include/linux/socket.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!332 = !{!333, !337}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !330, file: !331, line: 30, baseType: !334, size: 16)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !331, line: 23, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !336, line: 11, baseType: !218)
!336 = !DIFile(filename: "include/uapi/linux/socket.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !330, file: !331, line: 31, baseType: !338, size: 112, offset: 16)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 112, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 14)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !327, file: !320, line: 185, baseType: !330, size: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !327, file: !320, line: 186, baseType: !330, size: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !327, file: !320, line: 187, baseType: !330, size: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !327, file: !320, line: 188, baseType: !330, size: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !327, file: !320, line: 189, baseType: !346, size: 16)
!346 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !327, file: !320, line: 190, baseType: !129, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !327, file: !320, line: 191, baseType: !129, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !327, file: !320, line: 192, baseType: !350, size: 192)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !320, line: 142, size: 192, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !350, file: !320, line: 143, baseType: !103, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !350, file: !320, line: 144, baseType: !103, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !350, file: !320, line: 145, baseType: !218, size: 16, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !350, file: !320, line: 146, baseType: !235, size: 8, offset: 144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !350, file: !320, line: 147, baseType: !235, size: 8, offset: 152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !350, file: !320, line: 148, baseType: !235, size: 8, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !327, file: !320, line: 193, baseType: !88, size: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !327, file: !320, line: 194, baseType: !88, size: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !327, file: !320, line: 195, baseType: !312, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !327, file: !320, line: 196, baseType: !362, size: 128)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !320, line: 152, size: 128, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !320, line: 153, baseType: !107, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !362, file: !320, line: 154, baseType: !107, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !362, file: !320, line: 166, baseType: !367, size: 64, offset: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !362, file: !320, line: 155, size: 64, elements: !368)
!368 = !{!369, !377, !384, !396, !402, !409, !417}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !367, file: !320, line: 157, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !372, line: 55, baseType: !373)
!372 = !DIFile(filename: "/home/vmalik/src/kernel/linux-3.10/include/uapi/linux/hdlc/ioctl.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 52, size: 32, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !373, file: !372, line: 53, baseType: !218, size: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !373, file: !372, line: 54, baseType: !218, size: 16, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !367, file: !320, line: 158, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !372, line: 79, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 76, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !380, file: !372, line: 77, baseType: !107, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !380, file: !372, line: 78, baseType: !107, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !367, file: !320, line: 159, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !372, line: 65, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 57, size: 192, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !387, file: !372, line: 58, baseType: !107, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !387, file: !372, line: 59, baseType: !107, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !387, file: !372, line: 60, baseType: !107, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !387, file: !372, line: 61, baseType: !107, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !387, file: !372, line: 62, baseType: !107, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !387, file: !372, line: 63, baseType: !218, size: 16, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !387, file: !372, line: 64, baseType: !218, size: 16, offset: 176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !367, file: !320, line: 160, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !372, line: 69, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 67, size: 32, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !399, file: !372, line: 68, baseType: !107, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !367, file: !320, line: 161, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !372, line: 74, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 71, size: 160, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !405, file: !372, line: 72, baseType: !107, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !405, file: !372, line: 73, baseType: !88, size: 128, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !367, file: !320, line: 164, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !372, line: 43, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 39, size: 96, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !412, file: !372, line: 40, baseType: !107, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !412, file: !372, line: 41, baseType: !107, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !412, file: !372, line: 42, baseType: !218, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !367, file: !320, line: 165, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !372, line: 50, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 45, size: 128, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !420, file: !372, line: 46, baseType: !107, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !420, file: !372, line: 47, baseType: !107, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !420, file: !372, line: 48, baseType: !218, size: 16, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !420, file: !372, line: 49, baseType: !107, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !168, file: !65, line: 923, baseType: !427, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!129, !174, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !168, file: !65, line: 925, baseType: !432, size: 64, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!129, !174, !129}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !168, file: !65, line: 927, baseType: !436, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!129, !174, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !65, line: 199, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !168, file: !65, line: 929, baseType: !176, size: 64, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !168, file: !65, line: 931, baseType: !443, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !174, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !448, line: 41, size: 1472, elements: !449)
!448 = !DIFile(filename: "include/uapi/linux/if_link.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!449 = !{!450, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !447, file: !448, line: 42, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !217, line: 30, baseType: !123)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !447, file: !448, line: 43, baseType: !451, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !447, file: !448, line: 44, baseType: !451, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !447, file: !448, line: 45, baseType: !451, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !447, file: !448, line: 46, baseType: !451, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !447, file: !448, line: 47, baseType: !451, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !447, file: !448, line: 48, baseType: !451, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !447, file: !448, line: 49, baseType: !451, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !447, file: !448, line: 50, baseType: !451, size: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !447, file: !448, line: 51, baseType: !451, size: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !447, file: !448, line: 54, baseType: !451, size: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !447, file: !448, line: 55, baseType: !451, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !447, file: !448, line: 56, baseType: !451, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !447, file: !448, line: 57, baseType: !451, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !447, file: !448, line: 58, baseType: !451, size: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !447, file: !448, line: 59, baseType: !451, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !447, file: !448, line: 62, baseType: !451, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !447, file: !448, line: 63, baseType: !451, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !447, file: !448, line: 64, baseType: !451, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !447, file: !448, line: 65, baseType: !451, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !447, file: !448, line: 66, baseType: !451, size: 64, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !447, file: !448, line: 69, baseType: !451, size: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !447, file: !448, line: 70, baseType: !451, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !168, file: !65, line: 933, baseType: !475, size: 64, offset: 1024)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !174}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !168, file: !65, line: 935, baseType: !480, size: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!129, !174, !246, !302}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !168, file: !65, line: 937, baseType: !480, size: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_poll_controller", scope: !168, file: !65, line: 940, baseType: !176, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_netpoll_setup", scope: !168, file: !65, line: 941, baseType: !486, size: 64, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!129, !174, !489, !491}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "netpoll_info", file: !65, line: 54, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !94, line: 157, baseType: !107)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_netpoll_cleanup", scope: !168, file: !65, line: 944, baseType: !176, size: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !168, file: !65, line: 946, baseType: !494, size: 64, offset: 1408)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!129, !174, !129, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !122, line: 16, baseType: !235)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !168, file: !65, line: 948, baseType: !500, size: 64, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!129, !174, !129, !302, !498}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_tx_rate", scope: !168, file: !65, line: 950, baseType: !504, size: 64, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!129, !174, !129, !129}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !168, file: !65, line: 952, baseType: !508, size: 64, offset: 1600)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!129, !174, !129, !511}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !94, line: 29, baseType: !512)
!512 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !168, file: !65, line: 954, baseType: !514, size: 64, offset: 1664)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!129, !174, !129, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !519, line: 8, size: 416, elements: !520)
!519 = !DIFile(filename: "include/linux/if_link.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!520 = !{!521, !522, !526, !527, !528, !529}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !518, file: !519, line: 9, baseType: !226, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !518, file: !519, line: 10, baseType: !523, size: 256, offset: 32)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 256, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !518, file: !519, line: 11, baseType: !226, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !518, file: !519, line: 12, baseType: !226, size: 32, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tx_rate", scope: !518, file: !519, line: 13, baseType: !226, size: 32, offset: 352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !518, file: !519, line: 14, baseType: !226, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !168, file: !65, line: 957, baseType: !531, size: 64, offset: 1728)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!129, !174, !129, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !537, line: 161, size: 32, elements: !538)
!537 = !DIFile(filename: "include/uapi/linux/netlink.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !536, file: !537, line: 162, baseType: !216, size: 16)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !536, file: !537, line: 163, baseType: !216, size: 16, offset: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !168, file: !65, line: 960, baseType: !542, size: 64, offset: 1792)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!129, !174, !129, !186}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !168, file: !65, line: 962, baseType: !546, size: 64, offset: 1856)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!129, !174, !498}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_rx_flow_steer", scope: !168, file: !65, line: 988, baseType: !550, size: 64, offset: 1920)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!129, !174, !553, !302, !555}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !122, line: 22, baseType: !107)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !168, file: !65, line: 993, baseType: !557, size: 64, offset: 1984)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!129, !174, !174}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !168, file: !65, line: 995, baseType: !557, size: 64, offset: 2048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !168, file: !65, line: 997, baseType: !562, size: 64, offset: 2112)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!119, !174, !119}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !168, file: !65, line: 999, baseType: !566, size: 64, offset: 2176)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!129, !174, !119}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !168, file: !65, line: 1001, baseType: !570, size: 64, offset: 2240)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!129, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !575, line: 33, flags: DIFlagFwdDecl)
!575 = !DIFile(filename: "include/net/dst_ops.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !168, file: !65, line: 1002, baseType: !577, size: 64, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !573}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !168, file: !65, line: 1004, baseType: !581, size: 64, offset: 2368)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!129, !584, !534, !174, !596, !302}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !586, line: 7, size: 96, elements: !587)
!586 = !DIFile(filename: "/home/vmalik/src/kernel/linux-3.10/include/uapi/linux/neighbour.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!587 = !{!588, !589, !590, !591, !593, !594, !595}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !585, file: !586, line: 8, baseType: !234, size: 8)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !585, file: !586, line: 9, baseType: !234, size: 8, offset: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !585, file: !586, line: 10, baseType: !216, size: 16, offset: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !585, file: !586, line: 11, baseType: !592, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !217, line: 25, baseType: !129)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !585, file: !586, line: 12, baseType: !216, size: 16, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !585, file: !586, line: 13, baseType: !234, size: 8, offset: 80)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !585, file: !586, line: 14, baseType: !234, size: 8, offset: 88)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !168, file: !65, line: 1009, baseType: !599, size: 64, offset: 2432)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!129, !584, !534, !174, !596}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !168, file: !65, line: 1013, baseType: !603, size: 64, offset: 2496)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!129, !186, !606, !174, !129}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !608, line: 102, size: 896, elements: !609)
!608 = !DIFile(filename: "include/linux/netlink.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!609 = !{!610, !611, !621, !625, !629, !630, !634, !635, !636, !637, !638}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !607, file: !608, line: 103, baseType: !186, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !607, file: !608, line: 104, baseType: !612, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !537, line: 42, size: 128, elements: !615)
!615 = !{!616, !617, !618, !619, !620}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !614, file: !537, line: 43, baseType: !226, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !614, file: !537, line: 44, baseType: !216, size: 16, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !614, file: !537, line: 45, baseType: !216, size: 16, offset: 48)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !614, file: !537, line: 46, baseType: !226, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !614, file: !537, line: 47, baseType: !226, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !607, file: !608, line: 105, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!129, !186, !606}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !607, file: !608, line: 107, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!129, !606}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !608, line: 108, baseType: !312, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !607, file: !608, line: 110, baseType: !631, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !633, line: 56, flags: DIFlagFwdDecl)
!633 = !DIFile(filename: "/home/vmalik/src/kernel/linux-3.10/arch/x86/include/asm/alternative.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!634 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !607, file: !608, line: 111, baseType: !302, size: 16, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !607, file: !608, line: 112, baseType: !302, size: 16, offset: 400)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !607, file: !608, line: 113, baseType: !107, size: 32, offset: 416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !607, file: !608, line: 113, baseType: !107, size: 32, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !607, file: !608, line: 114, baseType: !639, size: 384, offset: 512)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 384, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 6)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !168, file: !65, line: 1018, baseType: !643, size: 64, offset: 2560)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!129, !174, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !168, file: !65, line: 1020, baseType: !648, size: 64, offset: 2624)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!129, !186, !555, !555, !174, !555}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !168, file: !65, line: 1024, baseType: !643, size: 64, offset: 2688)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !168, file: !65, line: 1026, baseType: !653, size: 64, offset: 2752)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!129, !174, !511}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ethtool_ops", scope: !85, file: !65, line: 1110, baseType: !657, size: 64, offset: 3136)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_ops", file: !72, line: 190, size: 2944, elements: !660)
!660 = !{!661, !689, !690, !713, !714, !728, !740, !744, !748, !752, !753, !754, !755, !767, !768, !798, !799, !815, !819, !830, !834, !848, !852, !856, !866, !867, !868, !869, !873, !874, !949, !953, !966, !970, !971, !972, !978, !994, !998, !1010, !1014, !1015, !1032, !1046, !1047, !1063}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "get_settings", scope: !659, file: !72, line: 191, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!129, !174, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_cmd", file: !667, line: 20, size: 352, elements: !668)
!667 = !DIFile(filename: "include/uapi/linux/ethtool.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !666, file: !667, line: 21, baseType: !226, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "supported", scope: !666, file: !667, line: 22, baseType: !226, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "advertising", scope: !666, file: !667, line: 23, baseType: !226, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !666, file: !667, line: 24, baseType: !216, size: 16, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "duplex", scope: !666, file: !667, line: 28, baseType: !234, size: 8, offset: 112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !666, file: !667, line: 29, baseType: !234, size: 8, offset: 120)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "phy_address", scope: !666, file: !667, line: 30, baseType: !234, size: 8, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "transceiver", scope: !666, file: !667, line: 34, baseType: !234, size: 8, offset: 136)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "autoneg", scope: !666, file: !667, line: 35, baseType: !234, size: 8, offset: 144)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mdio_support", scope: !666, file: !667, line: 36, baseType: !234, size: 8, offset: 152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "maxtxpkt", scope: !666, file: !667, line: 39, baseType: !226, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "maxrxpkt", scope: !666, file: !667, line: 40, baseType: !226, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "speed_hi", scope: !666, file: !667, line: 41, baseType: !216, size: 16, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "eth_tp_mdix", scope: !666, file: !667, line: 45, baseType: !234, size: 8, offset: 240)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "eth_tp_mdix_ctrl", scope: !666, file: !667, line: 46, baseType: !234, size: 8, offset: 248)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lp_advertising", scope: !666, file: !667, line: 49, baseType: !226, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !666, file: !667, line: 50, baseType: !686, size: 64, offset: 288)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 64, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 2)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "set_settings", scope: !659, file: !72, line: 192, baseType: !662, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "get_drvinfo", scope: !659, file: !72, line: 193, baseType: !691, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !174, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_drvinfo", file: !667, line: 83, size: 1568, elements: !696)
!696 = !{!697, !698, !700, !701, !702, !703, !704, !708, !709, !710, !711, !712}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !695, file: !667, line: 84, baseType: !226, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !695, file: !667, line: 85, baseType: !699, size: 256, offset: 32)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 256, elements: !524)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !695, file: !667, line: 86, baseType: !699, size: 256, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fw_version", scope: !695, file: !667, line: 87, baseType: !699, size: 256, offset: 544)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bus_info", scope: !695, file: !667, line: 88, baseType: !699, size: 256, offset: 800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !695, file: !667, line: 90, baseType: !699, size: 256, offset: 1056)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !695, file: !667, line: 91, baseType: !705, size: 96, offset: 1312)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 12)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "n_priv_flags", scope: !695, file: !667, line: 99, baseType: !226, size: 32, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "n_stats", scope: !695, file: !667, line: 100, baseType: !226, size: 32, offset: 1440)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "testinfo_len", scope: !695, file: !667, line: 101, baseType: !226, size: 32, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "eedump_len", scope: !695, file: !667, line: 102, baseType: !226, size: 32, offset: 1504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "regdump_len", scope: !695, file: !667, line: 103, baseType: !226, size: 32, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_regs_len", scope: !659, file: !72, line: 194, baseType: !171, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "get_regs", scope: !659, file: !72, line: 195, baseType: !715, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !174, !718, !312}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_regs", file: !667, line: 122, size: 96, elements: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !719, file: !667, line: 123, baseType: !226, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !719, file: !667, line: 124, baseType: !226, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !719, file: !667, line: 125, baseType: !226, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !719, file: !667, line: 126, baseType: !725, offset: 96)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "get_wol", scope: !659, file: !72, line: 196, baseType: !729, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !174, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_wolinfo", file: !667, line: 108, size: 160, elements: !734)
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !733, file: !667, line: 109, baseType: !226, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "supported", scope: !733, file: !667, line: 110, baseType: !226, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "wolopts", scope: !733, file: !667, line: 111, baseType: !226, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sopass", scope: !733, file: !667, line: 112, baseType: !739, size: 48, offset: 96)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 48, elements: !640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "set_wol", scope: !659, file: !72, line: 197, baseType: !741, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!129, !174, !732}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "get_msglevel", scope: !659, file: !72, line: 198, baseType: !745, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!555, !174}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "set_msglevel", scope: !659, file: !72, line: 199, baseType: !749, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !174, !555}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nway_reset", scope: !659, file: !72, line: 200, baseType: !171, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !659, file: !72, line: 201, baseType: !745, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "get_eeprom_len", scope: !659, file: !72, line: 202, baseType: !171, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "get_eeprom", scope: !659, file: !72, line: 203, baseType: !756, size: 64, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!129, !174, !759, !497}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_eeprom", file: !667, line: 130, size: 128, elements: !761)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !760, file: !667, line: 131, baseType: !226, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !760, file: !667, line: 132, baseType: !226, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !760, file: !667, line: 133, baseType: !226, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !760, file: !667, line: 134, baseType: !226, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !667, line: 135, baseType: !725, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "set_eeprom", scope: !659, file: !72, line: 205, baseType: !756, size: 64, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "get_coalesce", scope: !659, file: !72, line: 207, baseType: !769, size: 64, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!129, !174, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_coalesce", file: !667, line: 256, size: 736, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !773, file: !667, line: 257, baseType: !226, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coalesce_usecs", scope: !773, file: !667, line: 258, baseType: !226, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rx_max_coalesced_frames", scope: !773, file: !667, line: 259, baseType: !226, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coalesce_usecs_irq", scope: !773, file: !667, line: 260, baseType: !226, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rx_max_coalesced_frames_irq", scope: !773, file: !667, line: 261, baseType: !226, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coalesce_usecs", scope: !773, file: !667, line: 262, baseType: !226, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tx_max_coalesced_frames", scope: !773, file: !667, line: 263, baseType: !226, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coalesce_usecs_irq", scope: !773, file: !667, line: 264, baseType: !226, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tx_max_coalesced_frames_irq", scope: !773, file: !667, line: 265, baseType: !226, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stats_block_coalesce_usecs", scope: !773, file: !667, line: 266, baseType: !226, size: 32, offset: 288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "use_adaptive_rx_coalesce", scope: !773, file: !667, line: 267, baseType: !226, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "use_adaptive_tx_coalesce", scope: !773, file: !667, line: 268, baseType: !226, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_rate_low", scope: !773, file: !667, line: 269, baseType: !226, size: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coalesce_usecs_low", scope: !773, file: !667, line: 270, baseType: !226, size: 32, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_max_coalesced_frames_low", scope: !773, file: !667, line: 271, baseType: !226, size: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coalesce_usecs_low", scope: !773, file: !667, line: 272, baseType: !226, size: 32, offset: 480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tx_max_coalesced_frames_low", scope: !773, file: !667, line: 273, baseType: !226, size: 32, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_rate_high", scope: !773, file: !667, line: 274, baseType: !226, size: 32, offset: 544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coalesce_usecs_high", scope: !773, file: !667, line: 275, baseType: !226, size: 32, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rx_max_coalesced_frames_high", scope: !773, file: !667, line: 276, baseType: !226, size: 32, offset: 608)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coalesce_usecs_high", scope: !773, file: !667, line: 277, baseType: !226, size: 32, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_max_coalesced_frames_high", scope: !773, file: !667, line: 278, baseType: !226, size: 32, offset: 672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rate_sample_interval", scope: !773, file: !667, line: 279, baseType: !226, size: 32, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "set_coalesce", scope: !659, file: !72, line: 208, baseType: !769, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "get_ringparam", scope: !659, file: !72, line: 209, baseType: !800, size: 64, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !174, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_ringparam", file: !667, line: 283, size: 288, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !804, file: !667, line: 284, baseType: !226, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rx_max_pending", scope: !804, file: !667, line: 290, baseType: !226, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mini_max_pending", scope: !804, file: !667, line: 291, baseType: !226, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rx_jumbo_max_pending", scope: !804, file: !667, line: 292, baseType: !226, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tx_max_pending", scope: !804, file: !667, line: 293, baseType: !226, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pending", scope: !804, file: !667, line: 298, baseType: !226, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mini_pending", scope: !804, file: !667, line: 299, baseType: !226, size: 32, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rx_jumbo_pending", scope: !804, file: !667, line: 300, baseType: !226, size: 32, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pending", scope: !804, file: !667, line: 301, baseType: !226, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "set_ringparam", scope: !659, file: !72, line: 211, baseType: !816, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!129, !174, !803}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "get_pauseparam", scope: !659, file: !72, line: 213, baseType: !820, size: 64, offset: 1152)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !174, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_pauseparam", file: !667, line: 333, size: 128, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !824, file: !667, line: 334, baseType: !226, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "autoneg", scope: !824, file: !667, line: 346, baseType: !226, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pause", scope: !824, file: !667, line: 347, baseType: !226, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pause", scope: !824, file: !667, line: 348, baseType: !226, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "set_pauseparam", scope: !659, file: !72, line: 215, baseType: !831, size: 64, offset: 1216)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!129, !174, !823}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "self_test", scope: !659, file: !72, line: 217, baseType: !835, size: 64, offset: 1280)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !174, !838, !847}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_test", file: !667, line: 397, size: 128, elements: !840)
!840 = !{!841, !842, !843, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !839, file: !667, line: 398, baseType: !226, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !839, file: !667, line: 399, baseType: !226, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !839, file: !667, line: 400, baseType: !226, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !839, file: !667, line: 401, baseType: !226, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !839, file: !667, line: 402, baseType: !846, offset: 128)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, elements: !726)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_strings", scope: !659, file: !72, line: 218, baseType: !849, size: 64, offset: 1344)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !174, !555, !497}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "set_phys_id", scope: !659, file: !72, line: 219, baseType: !853, size: 64, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!129, !174, !71}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "get_ethtool_stats", scope: !659, file: !72, line: 220, baseType: !857, size: 64, offset: 1472)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !174, !860, !847}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_stats", file: !667, line: 406, size: 64, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !861, file: !667, line: 407, baseType: !226, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "n_stats", scope: !861, file: !667, line: 408, baseType: !226, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !861, file: !667, line: 409, baseType: !846, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !659, file: !72, line: 222, baseType: !171, size: 64, offset: 1536)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !659, file: !72, line: 223, baseType: !176, size: 64, offset: 1600)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "get_priv_flags", scope: !659, file: !72, line: 224, baseType: !745, size: 64, offset: 1664)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "set_priv_flags", scope: !659, file: !72, line: 225, baseType: !870, size: 64, offset: 1728)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!129, !174, !555}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "get_sset_count", scope: !659, file: !72, line: 226, baseType: !432, size: 64, offset: 1792)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "get_rxnfc", scope: !659, file: !72, line: 227, baseType: !875, size: 64, offset: 1856)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!129, !174, !878, !948}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_rxnfc", file: !667, line: 603, size: 1536, elements: !880)
!880 = !{!881, !882, !883, !884, !945, !946}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !879, file: !667, line: 604, baseType: !226, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flow_type", scope: !879, file: !667, line: 605, baseType: !226, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !879, file: !667, line: 606, baseType: !451, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !879, file: !667, line: 607, baseType: !885, size: 1344, offset: 128)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_rx_flow_spec", file: !667, line: 541, size: 1344, elements: !886)
!886 = !{!887, !888, !931, !941, !942, !943, !944}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flow_type", scope: !885, file: !667, line: 542, baseType: !226, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "h_u", scope: !885, file: !667, line: 543, baseType: !889, size: 416, offset: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ethtool_flow_union", file: !667, line: 495, size: 416, elements: !890)
!890 = !{!891, !900, !901, !902, !909, !910, !919, !927}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_ip4_spec", scope: !889, file: !667, line: 496, baseType: !892, size: 128)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_tcpip4_spec", file: !667, line: 451, size: 128, elements: !893)
!893 = !{!894, !896, !897, !898, !899}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ip4src", scope: !892, file: !667, line: 452, baseType: !895, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !225, line: 35, baseType: !226)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ip4dst", scope: !892, file: !667, line: 453, baseType: !895, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "psrc", scope: !892, file: !667, line: 454, baseType: !246, size: 16, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pdst", scope: !892, file: !667, line: 455, baseType: !246, size: 16, offset: 80)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !892, file: !667, line: 456, baseType: !234, size: 8, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "udp_ip4_spec", scope: !889, file: !667, line: 497, baseType: !892, size: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sctp_ip4_spec", scope: !889, file: !667, line: 498, baseType: !892, size: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ah_ip4_spec", scope: !889, file: !667, line: 499, baseType: !903, size: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_ah_espip4_spec", file: !667, line: 468, size: 128, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ip4src", scope: !903, file: !667, line: 469, baseType: !895, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ip4dst", scope: !903, file: !667, line: 470, baseType: !895, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "spi", scope: !903, file: !667, line: 471, baseType: !895, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !903, file: !667, line: 472, baseType: !234, size: 8, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "esp_ip4_spec", scope: !889, file: !667, line: 500, baseType: !903, size: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "usr_ip4_spec", scope: !889, file: !667, line: 501, baseType: !911, size: 128)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_usrip4_spec", file: !667, line: 486, size: 128, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ip4src", scope: !911, file: !667, line: 487, baseType: !895, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ip4dst", scope: !911, file: !667, line: 488, baseType: !895, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "l4_4_bytes", scope: !911, file: !667, line: 489, baseType: !895, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !911, file: !667, line: 490, baseType: !234, size: 8, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ver", scope: !911, file: !667, line: 491, baseType: !234, size: 8, offset: 104)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !911, file: !667, line: 492, baseType: !234, size: 8, offset: 112)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ether_spec", scope: !889, file: !667, line: 502, baseType: !920, size: 112)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !921, line: 133, size: 112, elements: !922)
!921 = !DIFile(filename: "include/uapi/linux/if_ether.h", directory: "/home/vmalik/src/kernel/linux-3.10")
!922 = !{!923, !925, !926}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !920, file: !921, line: 134, baseType: !924, size: 48)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 48, elements: !640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !920, file: !921, line: 135, baseType: !924, size: 48, offset: 48)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !920, file: !921, line: 136, baseType: !246, size: 16, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hdata", scope: !889, file: !667, line: 503, baseType: !928, size: 416)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 416, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 52)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "h_ext", scope: !885, file: !667, line: 544, baseType: !932, size: 160, offset: 448)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_flow_ext", file: !667, line: 517, size: 160, elements: !933)
!933 = !{!934, !936, !937, !938, !939}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !932, file: !667, line: 518, baseType: !935, size: 16)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 16, elements: !687)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !932, file: !667, line: 519, baseType: !924, size: 48, offset: 16)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_etype", scope: !932, file: !667, line: 520, baseType: !246, size: 16, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !932, file: !667, line: 521, baseType: !246, size: 16, offset: 80)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !932, file: !667, line: 522, baseType: !940, size: 64, offset: 96)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 64, elements: !687)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "m_u", scope: !885, file: !667, line: 545, baseType: !889, size: 416, offset: 608)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "m_ext", scope: !885, file: !667, line: 546, baseType: !932, size: 160, offset: 1024)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ring_cookie", scope: !885, file: !667, line: 547, baseType: !451, size: 64, offset: 1216)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !885, file: !667, line: 548, baseType: !226, size: 32, offset: 1280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rule_cnt", scope: !879, file: !667, line: 608, baseType: !226, size: 32, offset: 1472)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rule_locs", scope: !879, file: !667, line: 609, baseType: !947, offset: 1504)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, elements: !726)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "set_rxnfc", scope: !659, file: !72, line: 229, baseType: !950, size: 64, offset: 1920)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!129, !174, !878}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flash_device", scope: !659, file: !72, line: 230, baseType: !954, size: 64, offset: 1984)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!129, !174, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_flash", file: !667, line: 687, size: 1088, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !958, file: !667, line: 688, baseType: !226, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !958, file: !667, line: 689, baseType: !226, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !958, file: !667, line: 690, baseType: !963, size: 1024, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !659, file: !72, line: 231, baseType: !967, size: 64, offset: 2048)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!129, !174, !948}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "get_rxfh_indir_size", scope: !659, file: !72, line: 232, baseType: !745, size: 64, offset: 2112)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "get_rxfh_indir", scope: !659, file: !72, line: 233, baseType: !967, size: 64, offset: 2176)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "set_rxfh_indir", scope: !659, file: !72, line: 234, baseType: !973, size: 64, offset: 2240)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!129, !174, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_channels", scope: !659, file: !72, line: 235, baseType: !979, size: 64, offset: 2304)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !174, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethtool_channels", file: !667, line: 320, size: 288, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !983, file: !667, line: 321, baseType: !226, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max_rx", scope: !983, file: !667, line: 322, baseType: !226, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx", scope: !983, file: !667, line: 323, baseType: !226, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "max_other", scope: !983, file: !667, line: 324, baseType: !226, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "max_combined", scope: !983, file: !667, line: 325, baseType: !226, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rx_count", scope: !983, file: !667, line: 326, baseType: !226, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tx_count", scope: !983, file: !667, line: 327, baseType: !226, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "other_count", scope: !983, file: !667, line: 328, baseType: !226, size: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "combined_count", scope: !983, file: !667, line: 329, baseType: !226, size: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "set_channels", scope: !659, file: !72, line: 236, baseType: !995, size: 64, offset: 2368)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!129, !174, !982}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "get_dump_flag", scope: !659, file: !72, line: 237, baseType: !999, size: 64, offset: 2432)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!129, !174, !1002}
