; ModuleID = 'net/ipv4/tcp_bic.bc'
source_filename = "net/ipv4/tcp_bic.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kernel_param_ops = type { i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.kernel_param_ops*, i16, i16, %union.anon.6 }
%union.anon.6 = type { i8* }
%struct.smp_ops = type { void ()*, void (i32)*, void (i32)*, void (i32)*, void (i32)*, i32 (i32, %struct.task_struct*)*, i32 ()*, void (i32)*, void ()*, void (%struct.cpumask*)*, void (i32)* }

!4 = !{!5, !12, !18, !25, !32, !39, !47, !53, !59, !63, !70, !76, !6813, !5039, !3939, !1374, !3153, !3753, !7106, !7115, !7127, !7131, !7138, !7145, !7151}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 202, size: 32, elements: !7)
!6 = !DIFile(filename: "include/linux/module.h", directory: "/diffkemp/kernel/linux-3.10")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!9 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!10 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!11 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !13, line: 27, size: 32, elements: !14)
!13 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/diffkemp/kernel/linux-3.10")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !19, line: 6, size: 32, elements: !20)
!19 = !DIFile(filename: "include/linux/pid.h", directory: "/diffkemp/kernel/linux-3.10")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!22 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!23 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!24 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netdev_tx", file: !26, line: 110, size: 32, elements: !27)
!26 = !DIFile(filename: "include/linux/netdevice.h", directory: "/diffkemp/kernel/linux-3.10")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "__NETDEV_TX_MIN", value: -2147483648)
!29 = !DIEnumerator(name: "NETDEV_TX_OK", value: 0)
!30 = !DIEnumerator(name: "NETDEV_TX_BUSY", value: 16)
!31 = !DIEnumerator(name: "NETDEV_TX_LOCKED", value: 32)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !33, line: 55, size: 32, elements: !34)
!33 = !DIFile(filename: "include/linux/ethtool.h", directory: "/diffkemp/kernel/linux-3.10")
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0)
!36 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1)
!37 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2)
!38 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !40, line: 492, size: 32, elements: !41)
!40 = !DIFile(filename: "include/linux/pm.h", directory: "/diffkemp/kernel/linux-3.10")
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!43 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!44 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!45 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!46 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !40, line: 470, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!50 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!51 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!52 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !54, line: 65, size: 32, elements: !55)
!54 = !DIFile(filename: "include/linux/pm_qos.h", directory: "/diffkemp/kernel/linux-3.10")
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0)
!57 = !DIEnumerator(name: "PM_QOS_MAX", value: 1)
!58 = !DIEnumerator(name: "PM_QOS_MIN", value: 2)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !54, line: 51, size: 32, elements: !60)
!60 = !{!61, !62}
!61 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY", value: 1)
!62 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 2)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_data_direction", file: !64, line: 7, size: 32, elements: !65)
!64 = !DIFile(filename: "include/linux/dma-direction.h", directory: "/diffkemp/kernel/linux-3.10")
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "DMA_BIDIRECTIONAL", value: 0)
!67 = !DIEnumerator(name: "DMA_TO_DEVICE", value: 1)
!68 = !DIEnumerator(name: "DMA_FROM_DEVICE", value: 2)
!69 = !DIEnumerator(name: "DMA_NONE", value: 3)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !26, line: 385, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0)
!73 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1)
!74 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2)
!75 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !77, file: !26, line: 1260, size: 32, elements: !7099)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !26, line: 1040, size: 22528, elements: !78)
!78 = !{!79, !84, !92, !94, !96, !97, !98, !100, !101, !107, !108, !109, !110, !116, !117, !118, !119, !120, !122, !123, !149, !157, !161, !164, !5589, !5981, !6006, !6007, !6008, !6009, !6010, !6011, !6012, !6013, !6014, !6015, !6016, !6017, !6018, !6019, !6020, !6021, !6022, !6023, !6024, !6025, !6030, !6031, !6032, !6033, !6034, !6035, !6036, !6039, !6598, !6599, !6602, !6605, !6703, !6704, !6707, !6708, !6709, !6736, !6737, !6738, !6745, !6746, !6779, !6780, !6781, !6782, !6783, !6784, !6785, !6786, !6800, !6803, !6804, !6805, !6806, !6807, !6808, !6809, !6810, !6811, !6812, !6817, !6818, !6819, !6820, !6836, !6839, !6842, !6843, !6845, !6895, !6896, !6897, !7070, !7071, !7077, !7078, !7079, !7088, !7091, !7092, !7093}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !26, line: 1047, baseType: !80, size: 128)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !82)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !{!83}
!83 = !DISubrange(count: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name_hlist", scope: !77, file: !26, line: 1050, baseType: !85, size: 128, offset: 128)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !86, line: 193, size: 128, elements: !87)
!86 = !DIFile(filename: "include/linux/types.h", directory: "/diffkemp/kernel/linux-3.10")
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !86, line: 194, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !85, file: !86, line: 194, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !77, file: !26, line: 1053, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !77, file: !26, line: 1059, baseType: !95, size: 64, offset: 320)
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !77, file: !26, line: 1060, baseType: !95, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !77, file: !26, line: 1061, baseType: !95, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !77, file: !26, line: 1062, baseType: !99, size: 32, offset: 512)
!99 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !77, file: !26, line: 1069, baseType: !95, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !77, file: !26, line: 1071, baseType: !102, size: 128, offset: 640)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !86, line: 185, size: 128, elements: !103)
!103 = !{!104, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !86, line: 186, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !86, line: 186, baseType: !105, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !77, file: !26, line: 1072, baseType: !102, size: 128, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !77, file: !26, line: 1073, baseType: !102, size: 128, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "upper_dev_list", scope: !77, file: !26, line: 1074, baseType: !102, size: 128, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !77, file: !26, line: 1078, baseType: !111, size: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !112, line: 15, baseType: !113)
!112 = !DIFile(filename: "include/linux/netdev_features.h", directory: "/diffkemp/kernel/linux-3.10")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !114, line: 25, baseType: !115)
!114 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!115 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !77, file: !26, line: 1080, baseType: !111, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !77, file: !26, line: 1082, baseType: !111, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !77, file: !26, line: 1084, baseType: !111, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !77, file: !26, line: 1090, baseType: !111, size: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !77, file: !26, line: 1093, baseType: !121, size: 32, offset: 1472)
!121 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "iflink", scope: !77, file: !26, line: 1094, baseType: !121, size: 32, offset: 1504)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !77, file: !26, line: 1096, baseType: !124, size: 1472, offset: 1536)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !26, line: 163, size: 1472, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !124, file: !26, line: 164, baseType: !95, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !124, file: !26, line: 165, baseType: !95, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !124, file: !26, line: 166, baseType: !95, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !124, file: !26, line: 167, baseType: !95, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !124, file: !26, line: 168, baseType: !95, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !124, file: !26, line: 169, baseType: !95, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !124, file: !26, line: 170, baseType: !95, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !124, file: !26, line: 171, baseType: !95, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !124, file: !26, line: 172, baseType: !95, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !124, file: !26, line: 173, baseType: !95, size: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !124, file: !26, line: 174, baseType: !95, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !124, file: !26, line: 175, baseType: !95, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !124, file: !26, line: 176, baseType: !95, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !124, file: !26, line: 177, baseType: !95, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !124, file: !26, line: 178, baseType: !95, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !124, file: !26, line: 179, baseType: !95, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !124, file: !26, line: 180, baseType: !95, size: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !124, file: !26, line: 181, baseType: !95, size: 64, offset: 1088)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !124, file: !26, line: 182, baseType: !95, size: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !124, file: !26, line: 183, baseType: !95, size: 64, offset: 1216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !124, file: !26, line: 184, baseType: !95, size: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !124, file: !26, line: 185, baseType: !95, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !124, file: !26, line: 186, baseType: !95, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !77, file: !26, line: 1097, baseType: !150, size: 64, offset: 3008)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !151, line: 23, baseType: !152)
!151 = !DIFile(filename: "include/asm-generic/atomic-long.h", directory: "/diffkemp/kernel/linux-3.10")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !86, line: 182, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 180, size: 64, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !153, file: !86, line: 181, baseType: !156, size: 64)
!156 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !77, file: !26, line: 1104, baseType: !158, size: 64, offset: 3072)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !26, line: 1104, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !77, file: !26, line: 1106, baseType: !162, size: 64, offset: 3136)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !26, line: 1106, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !77, file: !26, line: 1109, baseType: !165, size: 64, offset: 3200)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !26, line: 906, size: 3264, elements: !168)
!168 = !{!169, !174, !178, !179, !180, !5231, !5235, !5239, !5240, !5244, !5245, !5345, !5350, !5354, !5358, !5359, !5390, !5395, !5399, !5400, !5401, !5407, !5408, !5413, !5417, !5421, !5425, !5440, !5451, !5455, !5459, !5460, !5461, !5476, !5480, !5481, !5497, !5502, !5506, !5510, !5511, !5515, !5519, !5520, !5521, !5536, !5540, !5575, !5580, !5584, !5585}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !167, file: !26, line: 907, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!121, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !167, file: !26, line: 908, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !173}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !167, file: !26, line: 909, baseType: !170, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !167, file: !26, line: 910, baseType: !170, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !167, file: !26, line: 911, baseType: !181, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !185, !173}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !26, line: 116, baseType: !25)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !187, line: 406, size: 1984, elements: !188)
!187 = !DIFile(filename: "include/linux/skbuff.h", directory: "/diffkemp/kernel/linux-3.10")
!188 = !{!189, !190, !191, !199, !5142, !5143, !5145, !5146, !5149, !5150, !5151, !5152, !5153, !5163, !5164, !5165, !5166, !5167, !5168, !5169, !5170, !5171, !5172, !5173, !5174, !5175, !5176, !5181, !5182, !5191, !5192, !5193, !5194, !5195, !5196, !5197, !5198, !5199, !5200, !5201, !5202, !5203, !5204, !5205, !5206, !5207, !5210, !5211, !5217, !5219, !5220, !5221, !5222, !5223, !5224, !5225, !5226, !5228, !5229, !5230}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !187, line: 408, baseType: !185, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !187, line: 409, baseType: !185, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !186, file: !187, line: 411, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !193, line: 59, baseType: !194)
!193 = !DIFile(filename: "include/linux/ktime.h", directory: "/diffkemp/kernel/linux-3.10")
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ktime", file: !193, line: 46, size: 64, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tv64", scope: !194, file: !193, line: 47, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !114, line: 24, baseType: !198)
!198 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !186, file: !187, line: 413, baseType: !200, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !202, line: 285, size: 10560, elements: !203)
!202 = !DIFile(filename: "include/net/sock.h", directory: "/diffkemp/kernel/linux-3.10")
!203 = !{!204, !4937, !4945, !4946, !4953, !4954, !4955, !4956, !4957, !4982, !4989, !4990, !4994, !4995, !4996, !4997, !4998, !4999, !5000, !5001, !5002, !5003, !5004, !5005, !5006, !5007, !5008, !5009, !5010, !5011, !5012, !5013, !5014, !5015, !5016, !5017, !5018, !5019, !5020, !5021, !5022, !5023, !5024, !5025, !5026, !5027, !5028, !5029, !5030, !5031, !5032, !5127, !5128, !5129, !5130, !5131, !5132, !5133, !5134, !5135, !5136, !5137, !5138, !5139, !5140, !5141}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__sk_common", scope: !201, file: !202, line: 290, baseType: !205, size: 640)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_common", file: !202, line: 157, size: 640, elements: !206)
!206 = !{!207, !222, !232, !243, !244, !247, !248, !249, !250, !262, !4926, !4927, !4929, !4934, !4935, !4936}
!207 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !202, line: 161, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !202, line: 161, size: 64, elements: !209)
!209 = !{!210, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "skc_addrpair", scope: !208, file: !202, line: 162, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__addrpair", file: !202, line: 130, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !213, line: 30, baseType: !115)
!213 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!214 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !202, line: 163, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !202, line: 163, size: 64, elements: !216)
!216 = !{!217, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "skc_daddr", scope: !215, file: !202, line: 164, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !219, line: 35, baseType: !220)
!219 = !DIFile(filename: "include/uapi/linux/types.h", directory: "/diffkemp/kernel/linux-3.10")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !213, line: 26, baseType: !99)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "skc_rcv_saddr", scope: !215, file: !202, line: 165, baseType: !218, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !202, line: 168, baseType: !223, size: 32, offset: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !202, line: 168, size: 32, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "skc_hash", scope: !223, file: !202, line: 169, baseType: !99, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "skc_u16hashes", scope: !223, file: !202, line: 170, baseType: !227, size: 32)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 32, elements: !230)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !213, line: 23, baseType: !229)
!229 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!230 = !{!231}
!231 = !DISubrange(count: 2)
!232 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !202, line: 173, baseType: !233, size: 32, offset: 96)
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !202, line: 173, size: 32, elements: !234)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portpair", scope: !233, file: !202, line: 174, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__portpair", file: !202, line: 129, baseType: !220)
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !202, line: 175, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !202, line: 175, size: 32, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "skc_dport", scope: !238, file: !202, line: 176, baseType: !241, size: 16)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !219, line: 33, baseType: !228)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "skc_num", scope: !238, file: !202, line: 177, baseType: !228, size: 16, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "skc_family", scope: !205, file: !202, line: 181, baseType: !229, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "skc_state", scope: !205, file: !202, line: 182, baseType: !245, size: 8, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !246)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuse", scope: !205, file: !202, line: 183, baseType: !246, size: 4, offset: 152, flags: DIFlagBitField, extraData: i64 152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuseport", scope: !205, file: !202, line: 184, baseType: !246, size: 4, offset: 156, flags: DIFlagBitField, extraData: i64 152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bound_dev_if", scope: !205, file: !202, line: 185, baseType: !121, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !202, line: 186, baseType: !251, size: 128, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !202, line: 186, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bind_node", scope: !251, file: !202, line: 187, baseType: !85, size: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portaddr_node", scope: !251, file: !202, line: 188, baseType: !255, size: 128)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_nulls_node", file: !256, line: 21, size: 128, elements: !257)
!256 = !DIFile(filename: "include/linux/list_nulls.h", directory: "/diffkemp/kernel/linux-3.10")
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !256, line: 22, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !255, file: !256, line: 22, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "skc_prot", scope: !205, file: !202, line: 190, baseType: !263, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proto", file: !202, line: 885, size: 3200, elements: !265)
!265 = !{!266, !270, !286, !290, !295, !299, !303, !307, !311, !315, !319, !320, !321, !325, !4630, !4634, !4638, !4639, !4643, !4644, !4645, !4646, !4647, !4648, !4652, !4653, !4654, !4655, !4657, !4659, !4660, !4662, !4663, !4664, !4665, !4666, !4667, !4668, !4669, !4670, !4717, !4730, !4769, !4770, !4771, !4772, !4897, !4901}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !264, file: !202, line: 886, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !200, !156}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !264, file: !202, line: 888, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!121, !200, !274, !121}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !276, line: 29, size: 128, elements: !277)
!276 = !DIFile(filename: "include/linux/socket.h", directory: "/diffkemp/kernel/linux-3.10")
!277 = !{!278, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !275, file: !276, line: 30, baseType: !279, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !276, line: 23, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !281, line: 11, baseType: !229)
!281 = !DIFile(filename: "include/uapi/linux/socket.h", directory: "/diffkemp/kernel/linux-3.10")
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !275, file: !276, line: 31, baseType: !283, size: 112, offset: 16)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !264, file: !202, line: 891, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!121, !200, !121}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !264, file: !202, line: 893, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!200, !200, !121, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !264, file: !202, line: 895, baseType: !296, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!121, !200, !121, !95}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !264, file: !202, line: 897, baseType: !300, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!121, !200}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !264, file: !202, line: 898, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !200}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !264, file: !202, line: 899, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !200, !121}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "setsockopt", scope: !264, file: !202, line: 900, baseType: !312, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!121, !200, !121, !121, !93, !99}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "getsockopt", scope: !264, file: !202, line: 903, baseType: !316, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!121, !200, !121, !121, !93, !294}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "compat_setsockopt", scope: !264, file: !202, line: 907, baseType: !312, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "compat_getsockopt", scope: !264, file: !202, line: 911, baseType: !316, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "compat_ioctl", scope: !264, file: !202, line: 915, baseType: !322, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!121, !200, !99, !95}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !264, file: !202, line: 918, baseType: !326, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!121, !329, !200, !4620, !541}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !331, line: 32, size: 1344, elements: !332)
!331 = !DIFile(filename: "include/linux/aio.h", directory: "/diffkemp/kernel/linux-3.10")
!332 = !{!333, !338, !4578, !4581, !4595, !4599, !4604, !4605, !4606, !4607, !4608, !4609, !4610, !4611, !4612, !4614, !4615, !4616, !4617}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ki_users", scope: !330, file: !331, line: 33, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !86, line: 177, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 175, size: 32, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !335, file: !86, line: 176, baseType: !121, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !330, file: !331, line: 35, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !341, line: 763, size: 2880, elements: !342)
!341 = !DIFile(filename: "include/linux/fs.h", directory: "/diffkemp/kernel/linux-3.10")
!342 = !{!343, !356, !4544, !4545, !4546, !4547, !4548, !4549, !4550, !4551, !4552, !4561, !4562, !4571, !4572, !4573, !4574, !4575, !4576, !4577}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !340, file: !341, line: 771, baseType: !344, size: 128)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !340, file: !341, line: 768, size: 128, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fu_list", scope: !344, file: !341, line: 769, baseType: !102, size: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !344, file: !341, line: 770, baseType: !348, size: 128)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !86, line: 209, size: 128, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !86, line: 210, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !348, file: !86, line: 211, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !351}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !340, file: !341, line: 772, baseType: !357, size: 128, offset: 128)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !358, line: 7, size: 128, elements: !359)
!358 = !DIFile(filename: "include/linux/path.h", directory: "/diffkemp/kernel/linux-3.10")
!359 = !{!360, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !357, file: !358, line: 8, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !363, line: 15, flags: DIFlagFwdDecl)
!363 = !DIFile(filename: "include/linux/dcache.h", directory: "/diffkemp/kernel/linux-3.10")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !357, file: !358, line: 9, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !363, line: 103, size: 2112, elements: !367)
!367 = !{!368, !369, !375, !383, !384, !400, !4529, !4530, !4531, !4532, !4533, !4534, !4535, !4536, !4537, !4542, !4543}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !366, file: !363, line: 105, baseType: !99, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !366, file: !363, line: 106, baseType: !370, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !371, line: 41, baseType: !372)
!371 = !DIFile(filename: "include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-3.10")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !371, line: 39, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !372, file: !371, line: 40, baseType: !99, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !366, file: !363, line: 107, baseType: !376, size: 128, offset: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !377, line: 37, size: 128, elements: !378)
!377 = !DIFile(filename: "include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-3.10")
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !377, line: 38, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !376, file: !377, line: 38, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !366, file: !363, line: 108, baseType: !365, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !366, file: !363, line: 109, baseType: !385, size: 128, offset: 256)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !363, line: 42, size: 128, elements: !386)
!386 = !{!387, !397}
!387 = !DIDerivedType(tag: DW_TAG_member, scope: !385, file: !363, line: 43, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !385, file: !363, line: 43, size: 64, elements: !389)
!389 = !{!390, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !363, line: 44, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !363, line: 44, size: 64, elements: !392)
!392 = !{!393, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !391, file: !363, line: 45, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !114, line: 22, baseType: !99)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !391, file: !363, line: 45, baseType: !394, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !388, file: !363, line: 47, baseType: !113, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !363, line: 49, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !366, file: !363, line: 110, baseType: !401, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !341, line: 521, size: 8256, elements: !403)
!403 = !{!404, !406, !407, !413, !417, !418, !421, !422, !592, !4282, !4283, !4284, !4285, !4291, !4292, !4293, !4294, !4295, !4296, !4297, !4298, !4299, !4301, !4302, !4303, !4304, !4305, !4306, !4307, !4308, !4313, !4314, !4315, !4316, !4317, !4511, !4512, !4513, !4515, !4516, !4524, !4525, !4526, !4527, !4528}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !402, file: !341, line: 522, baseType: !405, size: 16)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !86, line: 18, baseType: !229)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !402, file: !341, line: 523, baseType: !229, size: 16, offset: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !402, file: !341, line: 524, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !409, line: 46, baseType: !410)
!409 = !DIFile(filename: "include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-3.10")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !86, line: 31, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !412, line: 48, baseType: !99)
!412 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-3.10")
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !402, file: !341, line: 525, baseType: !414, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !409, line: 47, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !86, line: 32, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !412, line: 49, baseType: !99)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !402, file: !341, line: 526, baseType: !99, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !402, file: !341, line: 529, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !341, line: 509, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !402, file: !341, line: 530, baseType: !419, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !402, file: !341, line: 533, baseType: !423, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !341, line: 1548, size: 1536, align: 512, elements: !426)
!426 = !{!427, !431, !438, !442, !446, !450, !454, !460, !464, !468, !474, !478, !479, !485, !489, !514, !535, !544, !550, !554, !558, !583, !588}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !425, file: !341, line: 1549, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!365, !401, !365, !99}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "follow_link", scope: !425, file: !341, line: 1550, baseType: !432, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !365, !436}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !363, line: 13, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !425, file: !341, line: 1551, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!121, !401, !121}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !425, file: !341, line: 1552, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!419, !401, !121}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !425, file: !341, line: 1554, baseType: !447, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!121, !365, !93, !121}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "put_link", scope: !425, file: !341, line: 1555, baseType: !451, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !365, !436, !435}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !425, file: !341, line: 1557, baseType: !455, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!121, !401, !365, !405, !458}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !86, line: 29, baseType: !459)
!459 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !425, file: !341, line: 1558, baseType: !461, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!121, !365, !401, !365}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !425, file: !341, line: 1559, baseType: !465, size: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!121, !401, !365}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !425, file: !341, line: 1560, baseType: !469, size: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!121, !401, !365, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !425, file: !341, line: 1561, baseType: !475, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!121, !401, !365, !405}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !425, file: !341, line: 1562, baseType: !465, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !425, file: !341, line: 1563, baseType: !480, size: 64, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!121, !401, !365, !405, !483}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !86, line: 15, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !86, line: 12, baseType: !220)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !425, file: !341, line: 1564, baseType: !486, size: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!121, !401, !365, !401, !365}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !425, file: !341, line: 1566, baseType: !490, size: 64, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!121, !365, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !341, line: 224, size: 640, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !503, !511, !512, !513}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !494, file: !341, line: 225, baseType: !99, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !494, file: !341, line: 226, baseType: !405, size: 16, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !494, file: !341, line: 227, baseType: !408, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !494, file: !341, line: 228, baseType: !414, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !494, file: !341, line: 229, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !86, line: 45, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !412, line: 87, baseType: !198)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !494, file: !341, line: 230, baseType: !504, size: 128, offset: 192)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !505, line: 9, size: 128, elements: !506)
!505 = !DIFile(filename: "include/uapi/linux/time.h", directory: "/diffkemp/kernel/linux-3.10")
!506 = !{!507, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !504, file: !505, line: 10, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time_t", file: !412, line: 88, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !412, line: 14, baseType: !156)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !504, file: !505, line: 11, baseType: !156, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !494, file: !341, line: 231, baseType: !504, size: 128, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !494, file: !341, line: 232, baseType: !504, size: 128, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !494, file: !341, line: 239, baseType: !339, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !425, file: !341, line: 1567, baseType: !515, size: 64, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!121, !361, !365, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !520, line: 21, size: 832, elements: !521)
!520 = !DIFile(filename: "include/linux/stat.h", directory: "/diffkemp/kernel/linux-3.10")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !519, file: !520, line: 22, baseType: !113, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !519, file: !520, line: 23, baseType: !483, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !519, file: !520, line: 24, baseType: !405, size: 16, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !519, file: !520, line: 25, baseType: !99, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !519, file: !520, line: 26, baseType: !408, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !519, file: !520, line: 27, baseType: !414, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !519, file: !520, line: 28, baseType: !483, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !520, line: 29, baseType: !501, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !519, file: !520, line: 30, baseType: !504, size: 128, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !519, file: !520, line: 31, baseType: !504, size: 128, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !519, file: !520, line: 32, baseType: !504, size: 128, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !519, file: !520, line: 33, baseType: !95, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !519, file: !520, line: 34, baseType: !115, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "setxattr", scope: !425, file: !341, line: 1568, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!121, !365, !472, !539, !541, !121}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 54, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !412, line: 71, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !412, line: 15, baseType: !95)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getxattr", scope: !425, file: !341, line: 1569, baseType: !545, size: 64, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !365, !472, !435, !541}
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !86, line: 59, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !412, line: 72, baseType: !509)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !425, file: !341, line: 1570, baseType: !551, size: 64, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!548, !365, !93, !541}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "removexattr", scope: !425, file: !341, line: 1571, baseType: !555, size: 64, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!121, !365, !472}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !425, file: !341, line: 1572, baseType: !559, size: 64, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!121, !401, !562, !113, !113}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !341, line: 1475, size: 192, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fi_flags", scope: !563, file: !341, line: 1476, baseType: !99, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_mapped", scope: !563, file: !341, line: 1477, baseType: !99, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_max", scope: !563, file: !341, line: 1478, baseType: !99, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_start", scope: !563, file: !341, line: 1479, baseType: !569, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !571, line: 16, size: 448, elements: !572)
!571 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/include/uapi/linux/fiemap.h", directory: "/diffkemp/kernel/linux-3.10")
!572 = !{!573, !574, !575, !576, !578, !579}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !570, file: !571, line: 17, baseType: !212, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !570, file: !571, line: 19, baseType: !212, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !570, file: !571, line: 21, baseType: !212, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !570, file: !571, line: 22, baseType: !577, size: 128, offset: 192)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 128, elements: !230)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !570, file: !571, line: 23, baseType: !220, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !570, file: !571, line: 24, baseType: !580, size: 96, offset: 352)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 96, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 3)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !425, file: !341, line: 1574, baseType: !584, size: 64, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!121, !401, !587, !121}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !425, file: !341, line: 1575, baseType: !589, size: 64, offset: 1408)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!121, !401, !365, !339, !99, !405, !294}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !402, file: !341, line: 534, baseType: !593, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !341, line: 1236, size: 17408, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !3799, !3905, !3976, !4068, !4072, !4073, !4074, !4075, !4076, !4077, !4078, !4079, !4099, !4100, !4104, !4105, !4106, !4107, !4108, !4109, !4110, !4111, !4143, !4144, !4147, !4148, !4190, !4200, !4201, !4203, !4204, !4205, !4207, !4208, !4209, !4210, !4211, !4261, !4262, !4280, !4281}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !594, file: !341, line: 1237, baseType: !102, size: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !594, file: !341, line: 1238, baseType: !483, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !594, file: !341, line: 1239, baseType: !246, size: 8, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !594, file: !341, line: 1240, baseType: !95, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !594, file: !341, line: 1241, baseType: !501, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !594, file: !341, line: 1242, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !341, line: 1804, size: 1024, elements: !604)
!604 = !{!605, !606, !607, !611, !615, !3789, !3790, !3791, !3792, !3793, !3794, !3796, !3797, !3798}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !603, file: !341, line: 1805, baseType: !472, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !603, file: !341, line: 1806, baseType: !121, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !603, file: !341, line: 1813, baseType: !608, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!365, !602, !121, !472, !435}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !603, file: !341, line: 1815, baseType: !612, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !593}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !603, file: !341, line: 1816, baseType: !616, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 223, size: 4928, elements: !618)
!618 = !{!619, !620, !621, !625, !853, !879, !880, !881, !882, !890, !893, !894, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !964, !968, !969, !970, !971, !972, !973, !974, !975, !976, !980, !981, !982, !983, !992, !1008, !1009, !1010, !1011, !1012, !1013, !1016, !1019, !1020, !1021, !1022, !1023, !1047, !1048, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !3777, !3778, !3784, !3788}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !617, file: !6, line: 225, baseType: !5, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !617, file: !6, line: 228, baseType: !102, size: 128, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !6, line: 231, baseType: !622, size: 448, offset: 192)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 448, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 56)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !617, file: !6, line: 234, baseType: !626, size: 704, offset: 640)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 40, size: 704, elements: !627)
!627 = !{!628, !848, !849, !850}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !626, file: !6, line: 41, baseType: !629, size: 512)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !630, line: 60, size: 512, elements: !631)
!630 = !DIFile(filename: "include/linux/kobject.h", directory: "/diffkemp/kernel/linux-3.10")
!631 = !{!632, !633, !634, !636, !768, !835, !838, !843, !844, !845, !846, !847}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !629, file: !630, line: 61, baseType: !472, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !629, file: !630, line: 62, baseType: !102, size: 128, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !629, file: !630, line: 63, baseType: !635, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !629, file: !630, line: 64, baseType: !637, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !630, line: 159, size: 1280, elements: !639)
!639 = !{!640, !641, !734, !735}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !638, file: !630, line: 160, baseType: !102, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !638, file: !630, line: 161, baseType: !642, size: 576, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !643, line: 76, baseType: !644)
!643 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !643, line: 64, size: 576, elements: !645)
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !643, line: 65, baseType: !647, size: 576)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !643, line: 65, size: 576, elements: !648)
!648 = !{!649, !725}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !647, file: !643, line: 66, baseType: !650, size: 576)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !643, line: 20, size: 576, elements: !651)
!651 = !{!652, !669, !670, !671, !672}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !650, file: !643, line: 21, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !654, line: 27, baseType: !655)
!654 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_spinlock", file: !654, line: 20, size: 32, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !655, file: !654, line: 21, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !654, line: 21, size: 32, elements: !659)
!659 = !{!660, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "head_tail", scope: !658, file: !654, line: 22, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticketpair_t", file: !654, line: 15, baseType: !394)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tickets", scope: !658, file: !654, line: 25, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__raw_tickets", file: !654, line: 23, size: 32, elements: !664)
!664 = !{!665, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !663, file: !654, line: 24, baseType: !666, size: 16)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticket_t", file: !654, line: 14, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !114, line: 19, baseType: !229)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !663, file: !654, line: 24, baseType: !666, size: 16, offset: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !650, file: !643, line: 26, baseType: !99, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "owner_cpu", scope: !650, file: !643, line: 26, baseType: !99, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !650, file: !643, line: 27, baseType: !435, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !650, file: !643, line: 30, baseType: !673, size: 384, offset: 192)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_map", file: !674, line: 150, size: 384, elements: !675)
!674 = !DIFile(filename: "include/linux/lockdep.h", directory: "/diffkemp/kernel/linux-3.10")
!675 = !{!676, !687, !722, !723, !724}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !673, file: !674, line: 151, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !674, line: 54, size: 64, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "subkeys", scope: !678, file: !674, line: 55, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 64, elements: !685)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_subclass_key", file: !674, line: 50, size: 8, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__one_byte", scope: !682, file: !674, line: 51, baseType: !81, size: 8)
!685 = !{!686}
!686 = !DISubrange(count: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "class_cache", scope: !673, file: !674, line: 152, baseType: !688, size: 128, offset: 64)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 128, elements: !230)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class", file: !674, line: 65, size: 3968, elements: !691)
!691 = !{!692, !693, !694, !696, !697, !698, !699, !711, !712, !713, !714, !715, !716, !717, !721}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !690, file: !674, line: 69, baseType: !102, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lock_entry", scope: !690, file: !674, line: 74, baseType: !102, size: 128, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !690, file: !674, line: 76, baseType: !695, size: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "subclass", scope: !690, file: !674, line: 77, baseType: !99, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dep_gen_id", scope: !690, file: !674, line: 78, baseType: !99, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "usage_mask", scope: !690, file: !674, line: 83, baseType: !95, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "usage_traces", scope: !690, file: !674, line: 84, baseType: !700, size: 2496, offset: 448)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 2496, elements: !709)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_trace", file: !702, line: 10, size: 192, elements: !703)
!702 = !DIFile(filename: "include/linux/stacktrace.h", directory: "/diffkemp/kernel/linux-3.10")
!703 = !{!704, !705, !706, !708}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nr_entries", scope: !701, file: !702, line: 11, baseType: !99, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !701, file: !702, line: 11, baseType: !99, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !701, file: !702, line: 12, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !701, file: !702, line: 13, baseType: !121, size: 32, offset: 128)
!709 = !{!710}
!710 = !DISubrange(count: 13)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "locks_after", scope: !690, file: !674, line: 91, baseType: !102, size: 128, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "locks_before", scope: !690, file: !674, line: 91, baseType: !102, size: 128, offset: 3072)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !690, file: !674, line: 97, baseType: !99, size: 32, offset: 3200)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !690, file: !674, line: 102, baseType: !95, size: 64, offset: 3264)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !690, file: !674, line: 104, baseType: !472, size: 64, offset: 3328)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name_version", scope: !690, file: !674, line: 105, baseType: !121, size: 32, offset: 3392)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "contention_point", scope: !690, file: !674, line: 108, baseType: !718, size: 256, offset: 3456)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 4)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "contending_point", scope: !690, file: !674, line: 109, baseType: !718, size: 256, offset: 3712)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !674, line: 153, baseType: !472, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !673, file: !674, line: 155, baseType: !121, size: 32, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !673, file: !674, line: 156, baseType: !95, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !647, file: !643, line: 70, baseType: !726, size: 576)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !643, line: 70, size: 576, elements: !727)
!727 = !{!728, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__padding", scope: !726, file: !643, line: 71, baseType: !729, size: 192)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 192, elements: !731)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !114, line: 16, baseType: !246)
!731 = !{!732}
!732 = !DISubrange(count: 24)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !726, file: !643, line: 72, baseType: !673, size: 384, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !638, file: !630, line: 162, baseType: !629, size: 512, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !638, file: !630, line: 163, baseType: !736, size: 64, offset: 1216)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !630, line: 123, size: 192, elements: !739)
!739 = !{!740, !745, !750}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !738, file: !630, line: 124, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!121, !637, !635}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !630, line: 125, baseType: !746, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!472, !637, !635}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !738, file: !630, line: 126, baseType: !751, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!121, !637, !635, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !630, line: 116, size: 18496, elements: !757)
!757 = !{!758, !762, !763, !767}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !756, file: !630, line: 117, baseType: !759, size: 2048)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !756, file: !630, line: 118, baseType: !121, size: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !756, file: !630, line: 119, baseType: !764, size: 16384, offset: 2080)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16384, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 2048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !756, file: !630, line: 120, baseType: !121, size: 32, offset: 18464)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !629, file: !630, line: 65, baseType: !769, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !630, line: 108, size: 320, elements: !771)
!771 = !{!772, !776, !804, !806, !831}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !770, file: !630, line: 109, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !635}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !770, file: !630, line: 110, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !780, line: 124, size: 192, elements: !781)
!780 = !DIFile(filename: "include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-3.10")
!781 = !{!782, !794, !798}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !779, file: !780, line: 125, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!548, !635, !786, !93}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !780, line: 26, size: 256, elements: !788)
!788 = !{!789, !790, !791, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !780, line: 27, baseType: !472, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !787, file: !780, line: 28, baseType: !405, size: 16, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_lockdep", scope: !787, file: !780, line: 30, baseType: !458, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !787, file: !780, line: 31, baseType: !677, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !787, file: !780, line: 32, baseType: !678, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !779, file: !780, line: 126, baseType: !795, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!548, !635, !786, !472, !541}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !779, file: !780, line: 127, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!539, !635, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !770, file: !630, line: 111, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !770, file: !630, line: 112, baseType: !807, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !635}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 320, elements: !813)
!813 = !{!814, !815, !819, !823, !827}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !812, file: !13, line: 41, baseType: !12, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !812, file: !13, line: 42, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!435}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !812, file: !13, line: 43, baseType: !820, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!539, !200}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !812, file: !13, line: 44, baseType: !824, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!539}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !812, file: !13, line: 45, baseType: !828, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !435}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !770, file: !630, line: 113, baseType: !832, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!539, !635}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !629, file: !630, line: 66, baseType: !836, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_dirent", file: !780, line: 130, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !629, file: !630, line: 67, baseType: !839, size: 32, offset: 448)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !840, line: 24, size: 32, elements: !841)
!840 = !DIFile(filename: "include/linux/kref.h", directory: "/diffkemp/kernel/linux-3.10")
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !839, file: !840, line: 25, baseType: !334, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !629, file: !630, line: 68, baseType: !99, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !629, file: !630, line: 69, baseType: !99, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !629, file: !630, line: 70, baseType: !99, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !629, file: !630, line: 71, baseType: !99, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !629, file: !630, line: 72, baseType: !99, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !626, file: !6, line: 42, baseType: !616, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !626, file: !6, line: 43, baseType: !635, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !626, file: !6, line: 44, baseType: !851, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !6, line: 44, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !617, file: !6, line: 235, baseType: !854, size: 64, offset: 1344)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !6, line: 47, size: 576, elements: !856)
!856 = !{!857, !858, !863, !867, !871, !875}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !855, file: !6, line: 48, baseType: !787, size: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !855, file: !6, line: 49, baseType: !859, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!548, !854, !862, !93}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !855, file: !6, line: 51, baseType: !864, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!548, !854, !862, !472, !541}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !855, file: !6, line: 53, baseType: !868, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !616, !472}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !855, file: !6, line: 54, baseType: !872, size: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!121, !616}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !855, file: !6, line: 55, baseType: !876, size: 64, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !616}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !617, file: !6, line: 236, baseType: !472, size: 64, offset: 1408)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !617, file: !6, line: 237, baseType: !472, size: 64, offset: 1472)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !617, file: !6, line: 238, baseType: !635, size: 64, offset: 1536)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !617, file: !6, line: 241, baseType: !883, size: 64, offset: 1600)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !886, line: 26, size: 128, elements: !887)
!886 = !DIFile(filename: "include/linux/export.h", directory: "/diffkemp/kernel/linux-3.10")
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !885, file: !886, line: 28, baseType: !95, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !886, line: 29, baseType: !472, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !617, file: !6, line: 242, baseType: !891, size: 64, offset: 1664)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !617, file: !6, line: 243, baseType: !99, size: 32, offset: 1728)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !617, file: !6, line: 246, baseType: !895, size: 64, offset: 1792)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !897, line: 48, size: 256, elements: !898)
!897 = !DIFile(filename: "include/linux/moduleparam.h", directory: "/diffkemp/kernel/linux-3.10")
!898 = !{!899, !900, !916, !917, !920}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !896, file: !897, line: 49, baseType: !472, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !896, file: !897, line: 50, baseType: !901, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !897, line: 39, size: 192, elements: !904)
!904 = !{!905, !911, !915}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !903, file: !897, line: 41, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!121, !472, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !903, file: !897, line: 43, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!121, !93, !909}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !903, file: !897, line: 45, baseType: !828, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !896, file: !897, line: 51, baseType: !667, size: 16, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !896, file: !897, line: 52, baseType: !918, size: 16, offset: 144)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !114, line: 18, baseType: !919)
!919 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!920 = !DIDerivedType(tag: DW_TAG_member, scope: !896, file: !897, line: 53, baseType: !921, size: 64, offset: 192)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !896, file: !897, line: 53, size: 64, elements: !922)
!922 = !{!923, !924, !931}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !921, file: !897, line: 54, baseType: !435, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !921, file: !897, line: 55, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !897, line: 61, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !927, file: !897, line: 62, baseType: !99, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !927, file: !897, line: 63, baseType: !93, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !921, file: !897, line: 56, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !897, line: 67, size: 256, elements: !935)
!935 = !{!936, !937, !938, !940, !941}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !934, file: !897, line: 69, baseType: !99, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !934, file: !897, line: 70, baseType: !99, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !934, file: !897, line: 71, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !934, file: !897, line: 72, baseType: !901, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !934, file: !897, line: 73, baseType: !435, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !617, file: !6, line: 247, baseType: !99, size: 32, offset: 1856)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !617, file: !6, line: 250, baseType: !99, size: 32, offset: 1888)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !617, file: !6, line: 251, baseType: !883, size: 64, offset: 1920)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !617, file: !6, line: 252, baseType: !891, size: 64, offset: 1984)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "unused_syms", scope: !617, file: !6, line: 256, baseType: !883, size: 64, offset: 2048)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "unused_crcs", scope: !617, file: !6, line: 257, baseType: !891, size: 64, offset: 2112)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "num_unused_syms", scope: !617, file: !6, line: 258, baseType: !99, size: 32, offset: 2176)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "num_unused_gpl_syms", scope: !617, file: !6, line: 261, baseType: !99, size: 32, offset: 2208)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gpl_syms", scope: !617, file: !6, line: 262, baseType: !883, size: 64, offset: 2240)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gpl_crcs", scope: !617, file: !6, line: 263, baseType: !891, size: 64, offset: 2304)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "sig_ok", scope: !617, file: !6, line: 268, baseType: !458, size: 8, offset: 2368)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !617, file: !6, line: 272, baseType: !883, size: 64, offset: 2432)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !617, file: !6, line: 273, baseType: !891, size: 64, offset: 2496)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !617, file: !6, line: 274, baseType: !99, size: 32, offset: 2560)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !617, file: !6, line: 277, baseType: !99, size: 32, offset: 2592)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !617, file: !6, line: 278, baseType: !958, size: 64, offset: 2624)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !960, line: 97, size: 64, elements: !961)
!960 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/uaccess.h", directory: "/diffkemp/kernel/linux-3.10")
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !959, file: !960, line: 98, baseType: !121, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !959, file: !960, line: 98, baseType: !121, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !617, file: !6, line: 281, baseType: !965, size: 64, offset: 2688)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!121}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !617, file: !6, line: 284, baseType: !435, size: 64, offset: 2752)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "module_core", scope: !617, file: !6, line: 287, baseType: !435, size: 64, offset: 2816)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "init_size", scope: !617, file: !6, line: 290, baseType: !99, size: 32, offset: 2880)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "core_size", scope: !617, file: !6, line: 290, baseType: !99, size: 32, offset: 2912)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "init_text_size", scope: !617, file: !6, line: 293, baseType: !99, size: 32, offset: 2944)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "core_text_size", scope: !617, file: !6, line: 293, baseType: !99, size: 32, offset: 2976)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "init_ro_size", scope: !617, file: !6, line: 296, baseType: !99, size: 32, offset: 3008)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "core_ro_size", scope: !617, file: !6, line: 296, baseType: !99, size: 32, offset: 3040)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !617, file: !6, line: 299, baseType: !977, offset: 3072)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !978, line: 9, elements: !979)
!978 = !DIFile(filename: "include/asm-generic/module.h", directory: "/diffkemp/kernel/linux-3.10")
!979 = !{}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !617, file: !6, line: 301, baseType: !99, size: 32, offset: 3072)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !617, file: !6, line: 305, baseType: !99, size: 32, offset: 3104)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !617, file: !6, line: 306, baseType: !102, size: 128, offset: 3136)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !617, file: !6, line: 307, baseType: !984, size: 64, offset: 3264)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !986, line: 18, size: 96, elements: !987)
!986 = !DIFile(filename: "include/asm-generic/bug.h", directory: "/diffkemp/kernel/linux-3.10")
!987 = !{!988, !989, !990, !991}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr_disp", scope: !985, file: !986, line: 22, baseType: !121, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "file_disp", scope: !985, file: !986, line: 28, baseType: !121, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !985, file: !986, line: 30, baseType: !229, size: 16, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !986, line: 32, baseType: !229, size: 16, offset: 80)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !617, file: !6, line: 316, baseType: !993, size: 64, offset: 3328)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !995, line: 198, baseType: !996)
!995 = !DIFile(filename: "include/uapi/linux/elf.h", directory: "/diffkemp/kernel/linux-3.10")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !995, line: 191, size: 192, elements: !997)
!997 = !{!998, !1000, !1001, !1002, !1004, !1006}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !996, file: !995, line: 192, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !995, line: 20, baseType: !220)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !996, file: !995, line: 193, baseType: !246, size: 8, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !996, file: !995, line: 194, baseType: !246, size: 8, offset: 40)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !996, file: !995, line: 195, baseType: !1003, size: 16, offset: 48)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !995, line: 16, baseType: !228)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !996, file: !995, line: 196, baseType: !1005, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !995, line: 15, baseType: !212)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !996, file: !995, line: 197, baseType: !1007, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !995, line: 21, baseType: !212)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "core_symtab", scope: !617, file: !6, line: 316, baseType: !993, size: 64, offset: 3392)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !617, file: !6, line: 317, baseType: !99, size: 32, offset: 3456)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "core_num_syms", scope: !617, file: !6, line: 317, baseType: !99, size: 32, offset: 3488)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !617, file: !6, line: 318, baseType: !93, size: 64, offset: 3520)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "core_strtab", scope: !617, file: !6, line: 318, baseType: !93, size: 64, offset: 3584)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !617, file: !6, line: 321, baseType: !1014, size: 64, offset: 3648)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !6, line: 321, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !617, file: !6, line: 324, baseType: !1017, size: 64, offset: 3712)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !6, line: 324, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !617, file: !6, line: 329, baseType: !93, size: 64, offset: 3776)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !617, file: !6, line: 333, baseType: !435, size: 64, offset: 3840)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !617, file: !6, line: 334, baseType: !99, size: 32, offset: 3904)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !617, file: !6, line: 338, baseType: !99, size: 32, offset: 3936)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !617, file: !6, line: 339, baseType: !1024, size: 64, offset: 3968)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !1028, line: 30, size: 320, elements: !1029)
!1028 = !DIFile(filename: "include/linux/tracepoint.h", directory: "/diffkemp/kernel/linux-3.10")
!1029 = !{!1030, !1031, !1036, !1040, !1041}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !1028, line: 31, baseType: !472, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1027, file: !1028, line: 32, baseType: !1032, size: 32, offset: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !1033, line: 136, size: 32, elements: !1034)
