; ModuleID = 'net/ipv4/tcp_bic.bc'
source_filename = "net/ipv4/tcp_bic.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module = type { i32, %struct.list_head, [56 x i8], %struct.module_kobject, %struct.module_attribute*, i8*, i8*, %struct.kobject*, %struct.kernel_symbol*, i32*, i32, %struct.mutex, %struct.kernel_param*, i32, i32, %struct.kernel_symbol*, i32*, %struct.kernel_symbol*, i32*, i32, i32, %struct.kernel_symbol*, i32*, i8, i8, %struct.kernel_symbol*, i32*, i32, i32, %struct.exception_table_entry*, i32 ()*, [56 x i8], %struct.module_layout, %struct.module_layout, %struct.mod_arch_specific, i64, i32, %struct.list_head, %struct.bug_entry*, %struct.mod_kallsyms*, %struct.mod_kallsyms, %struct.module_sect_attrs*, %struct.module_notes_attrs*, i8*, i8*, i32, i32, %struct.tracepoint**, i32, i8**, %struct.trace_event_call**, i32, %struct.trace_enum_map**, i32, i32, i64*, i8, i8, %struct.klp_modinfo*, %struct.list_head, %struct.list_head, void ()*, %struct.atomic_t, void ()**, i32, [36 x i8] }
%struct.module_kobject = type { %struct.kobject, %struct.module*, %struct.kobject*, %struct.module_param_attrs*, %struct.completion* }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, %struct.delayed_work, i8 }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "__param_str_fast_convergence", scope: !2, file: !3, line: 35, type: !10299, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !9559, globals: !10202)
!3 = !DIFile(filename: "net/ipv4/tcp_bic.c", directory: "/diffkemp/kernel/linux-4.11")
!4 = !{!5, !12, !18, !23, !28, !34, !7728, !3205, !7928, !4517, !8546, !8836, !9183, !9193, !3499, !3641, !3703, !4982, !5002, !5540, !4179, !4251, !4322, !4330, !4435, !6025, !6278, !6634, !7014, !9540, !9551}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 277, size: 32, elements: !7)
!6 = !DIFile(filename: "./include/linux/module.h", directory: "/diffkemp/kernel/linux-4.11")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!9 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!10 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!11 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !13, line: 27, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/diffkemp/kernel/linux-4.11")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writeback_sync_modes", file: !19, line: 39, size: 32, elements: !20)
!19 = !DIFile(filename: "./include/linux/writeback.h", directory: "/diffkemp/kernel/linux-4.11")
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "WB_SYNC_NONE", value: 0)
!22 = !DIEnumerator(name: "WB_SYNC_ALL", value: 1)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !24, line: 43, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/diffkemp/kernel/linux-4.11")
!25 = !{!26, !27}
!26 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!27 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netdev_tx", file: !29, line: 108, size: 32, elements: !30)
!29 = !DIFile(filename: "./include/linux/netdevice.h", directory: "/diffkemp/kernel/linux-4.11")
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "__NETDEV_TX_MIN", value: -2147483648)
!32 = !DIEnumerator(name: "NETDEV_TX_OK", value: 0)
!33 = !DIEnumerator(name: "NETDEV_TX_BUSY", value: 16)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 254, size: 32, elements: !9536)
!35 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/diffkemp/kernel/linux-4.11")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nf_bridge_info", file: !35, line: 252, size: 320, elements: !37)
!37 = !{!38, !45, !46, !50, !51, !52, !56, !9528, !9529}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !36, file: !35, line: 253, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !40, line: 176, baseType: !41)
!40 = !DIFile(filename: "./include/linux/types.h", directory: "/diffkemp/kernel/linux-4.11")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 174, size: 32, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !41, file: !40, line: 175, baseType: !44, size: 32)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "orig_proto", scope: !36, file: !35, line: 258, baseType: !34, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_otherhost", scope: !36, file: !35, line: 259, baseType: !47, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !48, line: 16, baseType: !49)
!48 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-4.11")
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "in_prerouting", scope: !36, file: !35, line: 260, baseType: !47, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bridged_dnat", scope: !36, file: !35, line: 261, baseType: !47, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "frag_max_size", scope: !36, file: !35, line: 262, baseType: !53, size: 16, offset: 48)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !54, line: 23, baseType: !55)
!54 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-4.11")
!55 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "physindev", scope: !36, file: !35, line: 263, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !29, line: 1631, size: 25088, elements: !59)
!59 = !{!60, !65, !72, !74, !76, !77, !78, !79, !80, !81, !87, !88, !89, !90, !91, !92, !97, !102, !103, !104, !105, !106, !107, !108, !109, !110, !136, !144, !145, !146, !150, !153, !7737, !8221, !8225, !8248, !8393, !8419, !8420, !8421, !8422, !8423, !8424, !8425, !8426, !8427, !8428, !8429, !8430, !8431, !8432, !8433, !8434, !8435, !8436, !8437, !8438, !8439, !8440, !8441, !8442, !8443, !8444, !8449, !8450, !8451, !8452, !8453, !8454, !8457, !8778, !8781, !8782, !8785, !8788, !8789, !8790, !8793, !8796, !8799, !8800, !8827, !8828, !8829, !8830, !8843, !8844, !9147, !9148, !9149, !9150, !9153, !9154, !9155, !9156, !9157, !9158, !9160, !9161, !9162, !9163, !9177, !9178, !9179, !9180, !9181, !9182, !9191, !9192, !9197, !9198, !9199, !9200, !9222, !9225, !9228, !9229, !9231, !9232, !9302, !9303, !9304, !9506, !9507, !9513, !9514, !9515, !9524, !9525, !9526, !9527}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !29, line: 1632, baseType: !61, size: 128)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !63)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !{!64}
!64 = !DISubrange(count: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name_hlist", scope: !58, file: !29, line: 1633, baseType: !66, size: 128, offset: 128)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !40, line: 192, size: 128, elements: !67)
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !40, line: 193, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !66, file: !40, line: 193, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !58, file: !29, line: 1634, baseType: !73, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !58, file: !29, line: 1639, baseType: !75, size: 64, offset: 320)
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !58, file: !29, line: 1640, baseType: !75, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !58, file: !29, line: 1641, baseType: !75, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !58, file: !29, line: 1642, baseType: !44, size: 32, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_changes", scope: !58, file: !29, line: 1644, baseType: !39, size: 32, offset: 544)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !58, file: !29, line: 1652, baseType: !75, size: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !58, file: !29, line: 1654, baseType: !82, size: 128, offset: 640)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !40, line: 184, size: 128, elements: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !40, line: 185, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !40, line: 185, baseType: !85, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !58, file: !29, line: 1655, baseType: !82, size: 128, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !58, file: !29, line: 1656, baseType: !82, size: 128, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !58, file: !29, line: 1657, baseType: !82, size: 128, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !58, file: !29, line: 1658, baseType: !82, size: 128, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !58, file: !29, line: 1659, baseType: !82, size: 128, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !58, file: !29, line: 1664, baseType: !93, size: 256, offset: 1408)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !58, file: !29, line: 1661, size: 256, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !93, file: !29, line: 1662, baseType: !82, size: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !93, file: !29, line: 1663, baseType: !82, size: 128, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !58, file: !29, line: 1666, baseType: !98, size: 64, offset: 1664)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !99, line: 15, baseType: !100)
!99 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/diffkemp/kernel/linux-4.11")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !48, line: 25, baseType: !101)
!101 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !58, file: !29, line: 1667, baseType: !98, size: 64, offset: 1728)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !58, file: !29, line: 1668, baseType: !98, size: 64, offset: 1792)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !58, file: !29, line: 1669, baseType: !98, size: 64, offset: 1856)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !58, file: !29, line: 1670, baseType: !98, size: 64, offset: 1920)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !58, file: !29, line: 1671, baseType: !98, size: 64, offset: 1984)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !58, file: !29, line: 1672, baseType: !98, size: 64, offset: 2048)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !58, file: !29, line: 1674, baseType: !44, size: 32, offset: 2112)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !58, file: !29, line: 1675, baseType: !44, size: 32, offset: 2144)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !58, file: !29, line: 1677, baseType: !111, size: 1472, offset: 2176)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !29, line: 162, size: 1472, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !111, file: !29, line: 163, baseType: !75, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !111, file: !29, line: 164, baseType: !75, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !111, file: !29, line: 165, baseType: !75, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !111, file: !29, line: 166, baseType: !75, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !111, file: !29, line: 167, baseType: !75, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !111, file: !29, line: 168, baseType: !75, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !111, file: !29, line: 169, baseType: !75, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !111, file: !29, line: 170, baseType: !75, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !111, file: !29, line: 171, baseType: !75, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !111, file: !29, line: 172, baseType: !75, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !111, file: !29, line: 173, baseType: !75, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !111, file: !29, line: 174, baseType: !75, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !111, file: !29, line: 175, baseType: !75, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !111, file: !29, line: 176, baseType: !75, size: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !111, file: !29, line: 177, baseType: !75, size: 64, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !111, file: !29, line: 178, baseType: !75, size: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !111, file: !29, line: 179, baseType: !75, size: 64, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !111, file: !29, line: 180, baseType: !75, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !111, file: !29, line: 181, baseType: !75, size: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !111, file: !29, line: 182, baseType: !75, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !111, file: !29, line: 183, baseType: !75, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !111, file: !29, line: 184, baseType: !75, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !111, file: !29, line: 185, baseType: !75, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !58, file: !29, line: 1679, baseType: !137, size: 64, offset: 3648)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !138, line: 23, baseType: !139)
!138 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/diffkemp/kernel/linux-4.11")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !40, line: 181, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 179, size: 64, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !140, file: !40, line: 180, baseType: !143, size: 64)
!143 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !58, file: !29, line: 1680, baseType: !137, size: 64, offset: 3712)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !58, file: !29, line: 1681, baseType: !137, size: 64, offset: 3776)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !58, file: !29, line: 1684, baseType: !147, size: 64, offset: 3840)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !29, line: 1684, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !58, file: !29, line: 1685, baseType: !151, size: 64, offset: 3904)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !29, line: 1685, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !58, file: !29, line: 1687, baseType: !154, size: 64, offset: 3968)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !29, line: 1129, size: 4672, elements: !157)
!157 = !{!158, !162, !166, !167, !168, !7257, !7261, !7269, !7273, !7274, !7278, !7279, !7379, !7384, !7388, !7392, !7393, !7425, !7429, !7433, !7438, !7442, !7443, !7444, !7450, !7451, !7456, !7460, !7464, !7468, !7469, !7489, !7493, !7506, !7510, !7514, !7518, !7519, !7544, !7545, !7546, !7550, !7554, !7555, !7573, !7577, !7583, !7587, !7588, !7592, !7596, !7600, !7604, !7619, !7623, !7659, !7664, !7668, !7669, !7673, !7682, !7686, !7692, !7693, !7697, !7701, !7705, !7706, !7710, !7714, !7715, !7719, !7720}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !156, file: !29, line: 1130, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!44, !57}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !156, file: !29, line: 1131, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !57}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !156, file: !29, line: 1132, baseType: !159, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !156, file: !29, line: 1133, baseType: !159, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !156, file: !29, line: 1134, baseType: !169, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !173, !57}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !29, line: 113, baseType: !28)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !35, line: 637, size: 1856, elements: !175)
!175 = !{!176, !214, !7150, !7155, !7157, !7158, !7159, !7162, !7163, !7165, !7166, !7167, !7168, !7169, !7170, !7172, !7173, !7174, !7175, !7176, !7177, !7178, !7179, !7181, !7182, !7183, !7184, !7185, !7186, !7187, !7188, !7189, !7190, !7191, !7192, !7193, !7194, !7195, !7196, !7197, !7198, !7199, !7200, !7201, !7202, !7203, !7204, !7205, !7206, !7207, !7208, !7209, !7210, !7220, !7221, !7222, !7223, !7224, !7225, !7230, !7231, !7236, !7241, !7242, !7243, !7244, !7245, !7246, !7247, !7248, !7249, !7251, !7252, !7254, !7255, !7256}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !35, line: 638, baseType: !177, size: 192)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !35, line: 638, size: 192, elements: !178)
!178 = !{!179, !206}
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !35, line: 639, baseType: !180, size: 192)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !35, line: 639, size: 192, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !35, line: 641, baseType: !173, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !35, line: 642, baseType: !173, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !35, line: 644, baseType: !185, size: 64, offset: 128)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !35, line: 644, size: 64, elements: !186)
!186 = !{!187, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !185, file: !35, line: 645, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !189, line: 28, baseType: !190)
!189 = !DIFile(filename: "./include/linux/ktime.h", directory: "/diffkemp/kernel/linux-4.11")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !48, line: 24, baseType: !191)
!191 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp", scope: !185, file: !35, line: 646, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_mstamp", file: !35, line: 511, size: 64, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !35, line: 512, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !35, line: 512, size: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v64", scope: !196, file: !35, line: 513, baseType: !100, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, scope: !196, file: !35, line: 514, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !35, line: 514, size: 64, elements: !201)
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_us", scope: !200, file: !35, line: 515, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !48, line: 22, baseType: !204)
!204 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_jiffies", scope: !200, file: !35, line: 516, baseType: !203, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !177, file: !35, line: 649, baseType: !207, size: 192, align: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !208, line: 36, size: 192, align: 64, elements: !209)
!208 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/diffkemp/kernel/linux-4.11")
!209 = !{!210, !211, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !207, file: !208, line: 37, baseType: !75, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !207, file: !208, line: 38, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !207, file: !208, line: 39, baseType: !212, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !174, file: !35, line: 651, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !217, line: 311, size: 9792, elements: !218)
!217 = !DIFile(filename: "./include/net/sock.h", directory: "/diffkemp/kernel/linux-4.11")
!218 = !{!219, !6910, !6918, !6919, !6920, !6921, !6922, !6929, !6930, !6931, !6932, !6933, !6940, !6953, !6957, !6958, !6959, !6960, !6961, !6962, !6963, !6964, !6965, !6966, !6967, !6968, !6969, !6970, !6971, !6972, !6973, !6974, !6975, !6976, !6977, !6978, !6979, !6980, !6981, !6982, !6984, !6985, !6986, !6987, !6988, !6989, !6990, !6991, !6992, !6993, !6994, !6995, !6996, !6997, !6998, !6999, !7000, !7001, !7002, !7003, !7004, !7005, !7006, !7007, !7123, !7124, !7125, !7139, !7140, !7141, !7142, !7143, !7144, !7145, !7146, !7149}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__sk_common", scope: !216, file: !217, line: 316, baseType: !220, size: 1088)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_common", file: !217, line: 149, size: 1088, elements: !221)
!221 = !{!222, !236, !244, !255, !256, !258, !259, !260, !261, !262, !263, !268, !6877, !6878, !6879, !6880, !6881, !6888, !6890, !6895, !6896, !6902, !6903, !6904}
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !220, file: !217, line: 153, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !217, line: 153, size: 64, elements: !224)
!224 = !{!225, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "skc_addrpair", scope: !223, file: !217, line: 154, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__addrpair", file: !217, line: 118, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !54, line: 30, baseType: !101)
!228 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !217, line: 155, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !217, line: 155, size: 64, elements: !230)
!230 = !{!231, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "skc_daddr", scope: !229, file: !217, line: 156, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !233, line: 31, baseType: !234)
!233 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/diffkemp/kernel/linux-4.11")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !54, line: 26, baseType: !204)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "skc_rcv_saddr", scope: !229, file: !217, line: 157, baseType: !232, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !220, file: !217, line: 160, baseType: !237, size: 32, offset: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !217, line: 160, size: 32, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "skc_hash", scope: !237, file: !217, line: 161, baseType: !204, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "skc_u16hashes", scope: !237, file: !217, line: 162, baseType: !241, size: 32)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !220, file: !217, line: 165, baseType: !245, size: 32, offset: 96)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !217, line: 165, size: 32, elements: !246)
!246 = !{!247, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portpair", scope: !245, file: !217, line: 166, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__portpair", file: !217, line: 117, baseType: !234)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !217, line: 167, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !217, line: 167, size: 32, elements: !251)
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "skc_dport", scope: !250, file: !217, line: 168, baseType: !253, size: 16)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !233, line: 29, baseType: !53)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "skc_num", scope: !250, file: !217, line: 169, baseType: !53, size: 16, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "skc_family", scope: !220, file: !217, line: 173, baseType: !55, size: 16, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "skc_state", scope: !220, file: !217, line: 174, baseType: !257, size: 8, offset: 144)
!257 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuse", scope: !220, file: !217, line: 175, baseType: !49, size: 4, offset: 152, flags: DIFlagBitField, extraData: i64 152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuseport", scope: !220, file: !217, line: 176, baseType: !49, size: 1, offset: 156, flags: DIFlagBitField, extraData: i64 152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "skc_ipv6only", scope: !220, file: !217, line: 177, baseType: !49, size: 1, offset: 157, flags: DIFlagBitField, extraData: i64 152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "skc_net_refcnt", scope: !220, file: !217, line: 178, baseType: !49, size: 1, offset: 158, flags: DIFlagBitField, extraData: i64 152)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bound_dev_if", scope: !220, file: !217, line: 179, baseType: !44, size: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !220, file: !217, line: 180, baseType: !264, size: 128, offset: 192)
!264 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !217, line: 180, size: 128, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bind_node", scope: !264, file: !217, line: 181, baseType: !66, size: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portaddr_node", scope: !264, file: !217, line: 182, baseType: !66, size: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "skc_prot", scope: !220, file: !217, line: 184, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proto", file: !217, line: 1012, size: 3072, elements: !271)
!271 = !{!272, !276, !292, !296, !303, !307, !311, !315, !319, !323, !327, !328, !329, !330, !334, !6751, !6755, !6759, !6760, !6764, !6765, !6766, !6767, !6768, !6772, !6773, !6779, !6780, !6781, !6783, !6784, !6786, !6787, !6788, !6789, !6790, !6791, !6792, !6793, !6794, !6843, !6856, !6873, !6874, !6875, !6876}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !270, file: !217, line: 1013, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !215, !143}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !270, file: !217, line: 1015, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!44, !215, !280, !44}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !282, line: 29, size: 128, elements: !283)
!282 = !DIFile(filename: "./include/linux/socket.h", directory: "/diffkemp/kernel/linux-4.11")
!283 = !{!284, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !281, file: !282, line: 30, baseType: !285, size: 16)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !282, line: 23, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !287, line: 11, baseType: !55)
!287 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/diffkemp/kernel/linux-4.11")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !281, file: !282, line: 31, baseType: !289, size: 112, offset: 16)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 112, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 14)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !270, file: !217, line: 1018, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!44, !215, !44}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !270, file: !217, line: 1020, baseType: !297, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!215, !215, !44, !300, !301}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !40, line: 29, baseType: !302)
!302 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !270, file: !217, line: 1023, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !215, !44, !75}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !270, file: !217, line: 1025, baseType: !308, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!44, !215}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !270, file: !217, line: 1026, baseType: !312, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !215}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !270, file: !217, line: 1027, baseType: !316, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !215, !44}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setsockopt", scope: !270, file: !217, line: 1028, baseType: !320, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!44, !215, !44, !44, !73, !204}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "getsockopt", scope: !270, file: !217, line: 1031, baseType: !324, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!44, !215, !44, !44, !73, !300}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !270, file: !217, line: 1034, baseType: !316, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_setsockopt", scope: !270, file: !217, line: 1036, baseType: !320, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_getsockopt", scope: !270, file: !217, line: 1040, baseType: !324, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_ioctl", scope: !270, file: !217, line: 1044, baseType: !331, size: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!44, !215, !204, !75}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !270, file: !217, line: 1047, baseType: !335, size: 64, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!44, !215, !338, !350}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !282, line: 47, size: 704, elements: !340)
!340 = !{!341, !343, !344, !6747, !6748, !6749, !6750}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !339, file: !282, line: 48, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !339, file: !282, line: 49, baseType: !44, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iter", scope: !339, file: !282, line: 50, baseType: !345, size: 320, offset: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !346, line: 30, size: 320, elements: !347)
!346 = !DIFile(filename: "./include/linux/uio.h", directory: "/diffkemp/kernel/linux-4.11")
!347 = !{!348, !349, !354, !355, !6738}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !346, line: 31, baseType: !44, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "iov_offset", scope: !345, file: !346, line: 32, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 54, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !352, line: 71, baseType: !353)
!352 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-4.11")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !352, line: 15, baseType: !75)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !345, file: !346, line: 33, baseType: !350, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !346, line: 34, baseType: !356, size: 64, offset: 192)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !346, line: 34, size: 64, elements: !357)
!357 = !{!358, !366, !373, !6737}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !356, file: !346, line: 35, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !362, line: 16, size: 128, elements: !363)
!362 = !DIFile(filename: "./include/uapi/linux/uio.h", directory: "/diffkemp/kernel/linux-4.11")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !361, file: !362, line: 18, baseType: !342, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !361, file: !362, line: 19, baseType: !351, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "kvec", scope: !356, file: !346, line: 36, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !346, line: 18, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !369, file: !346, line: 19, baseType: !342, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !369, file: !346, line: 20, baseType: !350, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bvec", scope: !356, file: !346, line: 37, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_vec", file: !377, line: 29, size: 128, elements: !378)
!377 = !DIFile(filename: "./include/linux/bvec.h", directory: "/diffkemp/kernel/linux-4.11")
!378 = !{!379, !6735, !6736}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bv_page", scope: !376, file: !377, line: 30, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !382, line: 40, size: 512, align: 128, elements: !383)
!382 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/diffkemp/kernel/linux-4.11")
!383 = !{!384, !385, !6678, !6683, !6703, !6728, !6734}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !382, line: 42, baseType: !75, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !382, line: 44, baseType: !386, size: 64, offset: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !382, line: 44, size: 64, elements: !387)
!387 = !{!388, !6676, !6677}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !386, file: !382, line: 45, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !391, line: 379, size: 3328, align: 64, elements: !392)
!391 = !DIFile(filename: "./include/linux/fs.h", directory: "/diffkemp/kernel/linux-4.11")
!392 = !{!393, !6571, !6572, !6573, !6574, !6575, !6576, !6577, !6578, !6579, !6671, !6672, !6673, !6674, !6675}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !390, file: !391, line: 380, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !391, line: 554, size: 8256, elements: !396)
!396 = !{!397, !399, !400, !408, !415, !416, !419, !420, !6501, !6502, !6503, !6504, !6505, !6511, !6512, !6513, !6514, !6515, !6516, !6517, !6518, !6519, !6520, !6521, !6522, !6523, !6524, !6525, !6526, !6527, !6528, !6529, !6530, !6531, !6532, !6533, !6538, !6539, !6540, !6541, !6542, !6543, !6544, !6552, !6553, !6554, !6564, !6565, !6566, !6567, !6570}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !395, file: !391, line: 555, baseType: !398, size: 16)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !40, line: 18, baseType: !55)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !395, file: !391, line: 556, baseType: !55, size: 16, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !395, file: !391, line: 557, baseType: !401, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !402, line: 22, baseType: !403)
!402 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-4.11")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 20, size: 32, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !403, file: !402, line: 21, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !40, line: 31, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !352, line: 48, baseType: !204)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !395, file: !391, line: 558, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !402, line: 27, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 25, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !410, file: !402, line: 26, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !40, line: 32, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !352, line: 49, baseType: !204)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !395, file: !391, line: 559, baseType: !204, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !395, file: !391, line: 562, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !391, line: 527, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !395, file: !391, line: 563, baseType: !417, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !395, file: !391, line: 566, baseType: !421, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !391, line: 1694, size: 1536, align: 512, elements: !424)
!424 = !{!425, !6369, !6379, !6383, !6387, !6391, !6395, !6399, !6403, !6407, !6411, !6412, !6416, !6420, !6436, !6461, !6465, !6488, !6492, !6496, !6497}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !423, file: !391, line: 1695, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !394, !429, !204}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !431, line: 84, size: 2560, elements: !432)
!431 = !DIFile(filename: "./include/linux/dcache.h", directory: "/diffkemp/kernel/linux-4.11")
!432 = !{!433, !434, !495, !503, !504, !519, !520, !524, !564, !632, !6354, !6355, !6356, !6361, !6362, !6363}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !430, file: !431, line: 86, baseType: !204, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !430, file: !431, line: 87, baseType: !435, size: 448, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !436, line: 52, baseType: !437)
!436 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-4.11")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !436, line: 47, size: 448, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !437, file: !436, line: 48, baseType: !204, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !437, file: !436, line: 50, baseType: !441, size: 384, offset: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_map", file: !442, line: 150, size: 384, elements: !443)
!442 = !DIFile(filename: "./include/linux/lockdep.h", directory: "/diffkemp/kernel/linux-4.11")
!443 = !{!444, !455, !492, !493, !494}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !441, file: !442, line: 151, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !442, line: 54, size: 64, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "subkeys", scope: !446, file: !442, line: 55, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 64, elements: !453)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_subclass_key", file: !442, line: 50, size: 8, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__one_byte", scope: !450, file: !442, line: 51, baseType: !62, size: 8)
!453 = !{!454}
!454 = !DISubrange(count: 8)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "class_cache", scope: !441, file: !442, line: 152, baseType: !456, size: 128, offset: 64)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 128, elements: !242)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class", file: !442, line: 65, size: 3968, elements: !459)
!459 = !{!460, !461, !462, !464, !465, !466, !467, !479, !480, !481, !482, !483, !486, !487, !491}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !458, file: !442, line: 69, baseType: !66, size: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lock_entry", scope: !458, file: !442, line: 74, baseType: !82, size: 128, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !458, file: !442, line: 76, baseType: !463, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "subclass", scope: !458, file: !442, line: 77, baseType: !204, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dep_gen_id", scope: !458, file: !442, line: 78, baseType: !204, size: 32, offset: 352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "usage_mask", scope: !458, file: !442, line: 83, baseType: !75, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "usage_traces", scope: !458, file: !442, line: 84, baseType: !468, size: 2496, offset: 448)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 2496, elements: !477)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_trace", file: !470, line: 10, size: 192, elements: !471)
!470 = !DIFile(filename: "./include/linux/stacktrace.h", directory: "/diffkemp/kernel/linux-4.11")
!471 = !{!472, !473, !474, !476}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nr_entries", scope: !469, file: !470, line: 11, baseType: !204, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !469, file: !470, line: 11, baseType: !204, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !469, file: !470, line: 12, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !469, file: !470, line: 13, baseType: !44, size: 32, offset: 128)
!477 = !{!478}
!478 = !DISubrange(count: 13)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "locks_after", scope: !458, file: !442, line: 91, baseType: !82, size: 128, offset: 2944)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "locks_before", scope: !458, file: !442, line: 91, baseType: !82, size: 128, offset: 3072)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !458, file: !442, line: 97, baseType: !204, size: 32, offset: 3200)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !458, file: !442, line: 102, baseType: !75, size: 64, offset: 3264)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !442, line: 104, baseType: !484, size: 64, offset: 3328)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name_version", scope: !458, file: !442, line: 105, baseType: !44, size: 32, offset: 3392)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "contention_point", scope: !458, file: !442, line: 108, baseType: !488, size: 256, offset: 3456)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 256, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 4)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "contending_point", scope: !458, file: !442, line: 109, baseType: !488, size: 256, offset: 3712)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !442, line: 153, baseType: !484, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !441, file: !442, line: 155, baseType: !44, size: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !441, file: !442, line: 156, baseType: !75, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !430, file: !431, line: 88, baseType: !496, size: 128, offset: 512)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !497, line: 37, size: 128, elements: !498)
!497 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-4.11")
!498 = !{!499, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !497, line: 38, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !496, file: !497, line: 38, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !430, file: !431, line: 89, baseType: !429, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !430, file: !431, line: 90, baseType: !505, size: 128, offset: 704)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !431, line: 46, size: 128, elements: !506)
!506 = !{!507, !516}
!507 = !DIDerivedType(tag: DW_TAG_member, scope: !505, file: !431, line: 47, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !431, line: 47, size: 64, elements: !509)
!509 = !{!510, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !431, line: 48, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !431, line: 48, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !511, file: !431, line: 49, baseType: !203, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !511, file: !431, line: 49, baseType: !203, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !508, file: !431, line: 51, baseType: !100, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !431, line: 53, baseType: !517, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !430, file: !431, line: 91, baseType: !394, size: 64, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !430, file: !431, line: 93, baseType: !521, size: 256, offset: 896)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 256, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "d_lockref", scope: !430, file: !431, line: 96, baseType: !525, size: 640, offset: 1152)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockref", file: !526, line: 24, size: 640, elements: !527)
!526 = !DIFile(filename: "./include/linux/lockref.h", directory: "/diffkemp/kernel/linux-4.11")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !525, file: !526, line: 25, baseType: !529, size: 640)
!529 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !525, file: !526, line: 25, size: 640, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !526, line: 29, baseType: !532, size: 640)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !529, file: !526, line: 29, size: 640, elements: !533)
!533 = !{!534, !563}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !532, file: !526, line: 30, baseType: !535, size: 576)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !536, line: 76, baseType: !537)
!536 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-4.11")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !536, line: 64, size: 576, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !536, line: 65, baseType: !540, size: 576)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !536, line: 65, size: 576, elements: !541)
!541 = !{!542, !555}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !540, file: !536, line: 66, baseType: !543, size: 576)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !536, line: 20, size: 576, elements: !544)
!544 = !{!545, !551, !552, !553, !554}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !543, file: !536, line: 21, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !547, line: 33, baseType: !548)
!547 = !DIFile(filename: "./include/asm-generic/qspinlock_types.h", directory: "/diffkemp/kernel/linux-4.11")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !547, line: 31, size: 32, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !548, file: !547, line: 32, baseType: !39, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !543, file: !536, line: 26, baseType: !204, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "owner_cpu", scope: !543, file: !536, line: 26, baseType: !204, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !543, file: !536, line: 27, baseType: !342, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !543, file: !536, line: 30, baseType: !441, size: 384, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !536, line: 70, baseType: !556, size: 576)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !536, line: 70, size: 576, elements: !557)
!557 = !{!558, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__padding", scope: !556, file: !536, line: 71, baseType: !559, size: 192)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 24)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !556, file: !536, line: 72, baseType: !441, size: 384, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !532, file: !526, line: 31, baseType: !44, size: 32, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !430, file: !431, line: 97, baseType: !565, size: 64, offset: 1792)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !431, line: 130, size: 1024, align: 512, elements: !568)
!568 = !{!569, !573, !574, !581, !587, !591, !595, !599, !600, !604, !608, !620, !626}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !567, file: !431, line: 131, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!44, !429, !204}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !567, file: !431, line: 132, baseType: !570, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !567, file: !431, line: 133, baseType: !575, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!44, !578, !580}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !567, file: !431, line: 134, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!44, !578, !204, !484, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !567, file: !431, line: 136, baseType: !588, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!44, !578}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "d_init", scope: !567, file: !431, line: 137, baseType: !592, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!44, !429}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !567, file: !431, line: 138, baseType: !596, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !429}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !567, file: !431, line: 139, baseType: !596, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !567, file: !431, line: 140, baseType: !601, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !429, !394}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !567, file: !431, line: 141, baseType: !605, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!73, !429, !73, !44}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !567, file: !431, line: 142, baseType: !609, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !614}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !431, line: 17, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !616, line: 7, size: 128, elements: !617)
!616 = !DIFile(filename: "./include/linux/path.h", directory: "/diffkemp/kernel/linux-4.11")
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !615, file: !616, line: 8, baseType: !612, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !615, file: !616, line: 9, baseType: !429, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "d_manage", scope: !567, file: !431, line: 143, baseType: !621, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!44, !624, !301}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "d_real", scope: !567, file: !431, line: 144, baseType: !627, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!429, !429, !630, !204}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "d_sb", scope: !430, file: !431, line: 98, baseType: !633, size: 64, offset: 1856)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !391, line: 1293, size: 22528, elements: !635)
!635 = !{!636, !637, !640, !641, !642, !645, !5905, !6065, !6101, !6184, !6188, !6189, !6190, !6191, !6192, !6193, !6194, !6195, !6196, !6201, !6205, !6209, !6210, !6211, !6212, !6215, !6216, !6217, !6258, !6291, !6292, !6294, !6295, !6296, !6297, !6298, !6299, !6300, !6301, !6302, !6303, !6318, !6319, !6320, !6321, !6322, !6323, !6345, !6346, !6347, !6348, !6349, !6350, !6351, !6352, !6353}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !634, file: !391, line: 1294, baseType: !82, size: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !634, file: !391, line: 1295, baseType: !638, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !40, line: 15, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !40, line: 12, baseType: !234)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !634, file: !391, line: 1296, baseType: !49, size: 8, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !634, file: !391, line: 1297, baseType: !75, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !634, file: !391, line: 1298, baseType: !643, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !40, line: 45, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !352, line: 87, baseType: !191)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !634, file: !391, line: 1299, baseType: !646, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !391, line: 2015, size: 1024, elements: !648)
!648 = !{!649, !650, !651, !655, !659, !5895, !5896, !5897, !5898, !5899, !5900, !5902, !5903, !5904}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !391, line: 2016, baseType: !484, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !647, file: !391, line: 2017, baseType: !44, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !647, file: !391, line: 2023, baseType: !652, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!429, !646, !44, !484, !342}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !647, file: !391, line: 2025, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !633}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !647, file: !391, line: 2026, baseType: !660, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 328, size: 9728, align: 512, elements: !662)
!662 = !{!663, !664, !665, !669, !5619, !5645, !5646, !5647, !5648, !5656, !5659, !5660, !5661, !5711, !5712, !5713, !5714, !5715, !5716, !5717, !5718, !5719, !5720, !5721, !5722, !5723, !5724, !5725, !5726, !5727, !5735, !5739, !5757, !5758, !5761, !5762, !5763, !5764, !5773, !5795, !5796, !5799, !5802, !5803, !5804, !5805, !5806, !5828, !5829, !5831, !5835, !5836, !5840, !5841, !5842, !5843, !5844, !5845, !5886, !5887, !5888, !5889, !5890, !5894}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !661, file: !6, line: 329, baseType: !5, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !661, file: !6, line: 332, baseType: !82, size: 128, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !6, line: 335, baseType: !666, size: 448, offset: 192)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 448, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 56)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !661, file: !6, line: 338, baseType: !670, size: 2368, offset: 640)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 42, size: 2368, elements: !671)
!671 = !{!672, !5613, !5614, !5615, !5618}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !670, file: !6, line: 43, baseType: !673, size: 2112)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !674, line: 63, size: 2112, elements: !675)
!674 = !DIFile(filename: "./include/linux/kobject.h", directory: "/diffkemp/kernel/linux-4.11")
!675 = !{!676, !677, !678, !680, !722, !792, !5606, !5607, !5608, !5609, !5610, !5611, !5612}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !674, line: 64, baseType: !484, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !673, file: !674, line: 65, baseType: !82, size: 128, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !673, file: !674, line: 66, baseType: !679, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !673, file: !674, line: 67, baseType: !681, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !674, line: 168, size: 2880, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !682, file: !674, line: 169, baseType: !82, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !682, file: !674, line: 170, baseType: !535, size: 576, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !682, file: !674, line: 171, baseType: !673, size: 2112, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !682, file: !674, line: 172, baseType: !688, size: 64, offset: 2816)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !674, line: 132, size: 192, elements: !691)
!691 = !{!692, !697, !702}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !690, file: !674, line: 133, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!44, !681, !679}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !690, file: !674, line: 134, baseType: !698, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!484, !681, !679}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !690, file: !674, line: 135, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!44, !681, !679, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !674, line: 124, size: 18688, elements: !709)
!709 = !{!710, !714, !716, !717, !721}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !708, file: !674, line: 125, baseType: !711, size: 192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 3)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !708, file: !674, line: 126, baseType: !715, size: 2048, offset: 192)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2048, elements: !522)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !708, file: !674, line: 127, baseType: !44, size: 32, offset: 2240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !708, file: !674, line: 128, baseType: !718, size: 16384, offset: 2272)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 16384, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 2048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !708, file: !674, line: 129, baseType: !44, size: 32, offset: 18656)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !673, file: !674, line: 68, baseType: !723, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !674, line: 116, size: 320, elements: !725)
!725 = !{!726, !730, !755, !757, !788}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !724, file: !674, line: 117, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !679}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !724, file: !674, line: 118, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !734, line: 209, size: 128, elements: !735)
!734 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-4.11")
!735 = !{!736, !751}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !733, file: !734, line: 210, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!740, !679, !743, !73}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !40, line: 59, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !352, line: 72, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !352, line: 14, baseType: !143)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !734, line: 29, size: 256, elements: !745)
!745 = !{!746, !747, !748, !749, !750}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !734, line: 30, baseType: !484, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !744, file: !734, line: 31, baseType: !398, size: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_lockdep", scope: !744, file: !734, line: 33, baseType: !301, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !744, file: !734, line: 34, baseType: !445, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !744, file: !734, line: 35, baseType: !446, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !733, file: !734, line: 211, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!740, !679, !743, !484, !350}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !724, file: !674, line: 119, baseType: !756, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !724, file: !674, line: 120, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !679}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 384, elements: !764)
!764 = !{!765, !766, !770, !774, !780, !784}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !13, line: 41, baseType: !12, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !763, file: !13, line: 42, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!301}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !763, file: !13, line: 43, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!342}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !763, file: !13, line: 44, baseType: !775, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !215}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !763, file: !13, line: 45, baseType: !781, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!778}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !763, file: !13, line: 46, baseType: !785, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !342}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !724, file: !674, line: 121, baseType: !789, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!778, !679}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !673, file: !674, line: 69, baseType: !793, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !795, line: 107, size: 1344, elements: !796)
!795 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/diffkemp/kernel/linux-4.11")
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !5599, !5600, !5601, !5602, !5603}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !795, line: 108, baseType: !39, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !794, file: !795, line: 109, baseType: !39, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !794, file: !795, line: 111, baseType: !441, size: 384, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !794, file: !795, line: 119, baseType: !793, size: 64, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !795, line: 120, baseType: !484, size: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !794, file: !795, line: 122, baseType: !207, size: 192, align: 64, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !794, file: !795, line: 124, baseType: !778, size: 64, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !794, file: !795, line: 125, baseType: !204, size: 32, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_member, scope: !794, file: !795, line: 126, baseType: !806, size: 256, offset: 896)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !795, line: 126, size: 256, elements: !807)
!807 = !{!808, !5584, !5588}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !806, file: !795, line: 127, baseType: !809, size: 192)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !795, line: 75, size: 192, elements: !810)
!810 = !{!811, !812, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !809, file: !795, line: 76, baseType: !75, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !809, file: !795, line: 78, baseType: !813, size: 64, offset: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !208, line: 43, size: 64, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !813, file: !208, line: 44, baseType: !212, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !809, file: !795, line: 84, baseType: !817, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !795, line: 160, size: 1152, elements: !819)
!819 = !{!820, !821, !822, !864, !5582, !5583}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !818, file: !795, line: 162, baseType: !793, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !795, line: 163, baseType: !204, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ino_ida", scope: !818, file: !795, line: 166, baseType: !823, size: 128, offset: 128)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !824, line: 177, size: 128, elements: !825)
!824 = !DIFile(filename: "./include/linux/idr.h", directory: "/diffkemp/kernel/linux-4.11")
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ida_rt", scope: !823, file: !824, line: 178, baseType: !827, size: 128)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "radix_tree_root", file: !828, line: 112, size: 128, elements: !829)
!828 = !DIFile(filename: "./include/linux/radix-tree.h", directory: "/diffkemp/kernel/linux-4.11")
!829 = !{!830, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !827, file: !828, line: 113, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !40, line: 157, baseType: !204)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rnode", scope: !827, file: !828, line: 114, baseType: !833, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "radix_tree_node", file: !828, line: 93, size: 4608, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !843, !856, !860}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !834, file: !828, line: 94, baseType: !49, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !834, file: !828, line: 95, baseType: !49, size: 8, offset: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !834, file: !828, line: 96, baseType: !49, size: 8, offset: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "exceptional", scope: !834, file: !828, line: 97, baseType: !49, size: 8, offset: 24)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !834, file: !828, line: 98, baseType: !833, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !834, file: !828, line: 99, baseType: !842, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, scope: !834, file: !828, line: 100, baseType: !844, size: 128, offset: 192)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !828, line: 100, size: 128, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !844, file: !828, line: 101, baseType: !82, size: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "callback_head", scope: !844, file: !828, line: 102, baseType: !848, size: 128, align: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !40, line: 222, size: 128, align: 64, elements: !849)
!849 = !{!850, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !40, line: 223, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !848, file: !40, line: 224, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !851}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !834, file: !828, line: 104, baseType: !857, size: 4096, offset: 320)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 4096, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !834, file: !828, line: 105, baseType: !861, size: 192, offset: 4416)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 192, elements: !862)
!862 = !{!713, !863}
!863 = !DISubrange(count: 1)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !818, file: !795, line: 167, baseType: !865, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !795, line: 147, size: 384, elements: !867)
!867 = !{!868, !872, !5566, !5570, !5574, !5578}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !866, file: !795, line: 148, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!44, !817, !300, !73}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !866, file: !795, line: 149, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!44, !876, !817}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !878, line: 15, size: 2048, elements: !879)
!878 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/diffkemp/kernel/linux-4.11")
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887, !888, !902, !924, !925, !5565}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !877, file: !878, line: 16, baseType: !73, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !877, file: !878, line: 17, baseType: !350, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !877, file: !878, line: 18, baseType: !350, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !877, file: !878, line: 19, baseType: !350, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !877, file: !878, line: 20, baseType: !350, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !877, file: !878, line: 21, baseType: !643, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !877, file: !878, line: 22, baseType: !643, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !877, file: !878, line: 23, baseType: !100, size: 64, offset: 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !877, file: !878, line: 24, baseType: !889, size: 1280, offset: 512)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !890, line: 53, size: 1280, elements: !891)
!890 = !DIFile(filename: "./include/linux/mutex.h", directory: "/diffkemp/kernel/linux-4.11")
!891 = !{!892, !893, !894, !899, !900, !901}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !889, file: !890, line: 54, baseType: !137, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !889, file: !890, line: 55, baseType: !535, size: 576, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !889, file: !890, line: 57, baseType: !895, size: 32, offset: 640)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !896, line: 14, size: 32, elements: !897)
!896 = !DIFile(filename: "./include/linux/osq_lock.h", directory: "/diffkemp/kernel/linux-4.11")
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !895, file: !896, line: 19, baseType: !39, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !889, file: !890, line: 59, baseType: !82, size: 128, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !889, file: !890, line: 61, baseType: !342, size: 64, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !889, file: !890, line: 64, baseType: !441, size: 384, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !877, file: !878, line: 25, baseType: !903, size: 64, offset: 1792)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !878, line: 31, size: 256, elements: !906)
!906 = !{!907, !912, !916, !920}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !905, file: !878, line: 32, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!342, !876, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !905, file: !878, line: 33, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !876, !342}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !878, line: 34, baseType: !917, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!342, !876, !342, !911}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !905, file: !878, line: 35, baseType: !921, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!44, !876, !342}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !877, file: !878, line: 26, baseType: !44, size: 32, offset: 1856)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !877, file: !878, line: 27, baseType: !926, size: 64, offset: 1920)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !391, line: 835, size: 4032, align: 32, elements: !929)
!929 = !{!930, !940, !941, !942, !5527, !5528, !5529, !5530, !5532, !5533, !5534, !5549, !5550, !5559, !5560, !5561, !5562, !5563, !5564}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !928, file: !391, line: 839, baseType: !931, size: 128)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !928, file: !391, line: 836, size: 128, elements: !932)
!932 = !{!933, !939}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !931, file: !391, line: 837, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !935, line: 70, size: 64, elements: !936)
!935 = !DIFile(filename: "./include/linux/llist.h", directory: "/diffkemp/kernel/linux-4.11")
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !935, line: 71, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !931, file: !391, line: 838, baseType: !848, size: 128, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !928, file: !391, line: 840, baseType: !615, size: 128, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !928, file: !391, line: 841, baseType: !394, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "f_op", scope: !928, file: !391, line: 842, baseType: !943, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !391, line: 1654, size: 1920, elements: !946)
!946 = !{!947, !948, !953, !957, !961, !977, !978, !992, !993, !1014, !1018, !1019, !5368, !5372, !5377, !5378, !5382, !5386, !5484, !5488, !5489, !5493, !5494, !5498, !5502, !5507, !5511, !5515, !5519, !5523}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !945, file: !391, line: 1655, baseType: !660, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "llseek", scope: !945, file: !391, line: 1656, baseType: !949, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!643, !952, !643, !44}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !945, file: !391, line: 1657, baseType: !954, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!740, !952, !73, !350, !911}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !945, file: !391, line: 1658, baseType: !958, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!740, !952, !484, !350, !911}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "read_iter", scope: !945, file: !391, line: 1659, baseType: !962, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!740, !965, !976}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !391, line: 274, size: 320, elements: !967)
!967 = !{!968, !969, !970, !974, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !966, file: !391, line: 275, baseType: !952, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !966, file: !391, line: 276, baseType: !643, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !966, file: !391, line: 277, baseType: !971, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !965, !143, !143}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !966, file: !391, line: 278, baseType: !342, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !966, file: !391, line: 279, baseType: !44, size: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "write_iter", scope: !945, file: !391, line: 1660, baseType: !962, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "iterate", scope: !945, file: !391, line: 1661, baseType: !979, size: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!44, !952, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_context", file: !391, line: 1619, size: 128, elements: !984)
!984 = !{!985, !991}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "actor", scope: !983, file: !391, line: 1620, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "filldir_t", file: !391, line: 1616, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!44, !982, !484, !44, !643, !100, !204}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !983, file: !391, line: 1621, baseType: !643, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "iterate_shared", scope: !945, file: !391, line: 1662, baseType: !979, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !945, file: !391, line: 1663, baseType: !994, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!204, !952, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !999, line: 37, size: 128, elements: !1000)
!999 = !DIFile(filename: "./include/linux/poll.h", directory: "/diffkemp/kernel/linux-4.11")
!1000 = !{!1001, !1013}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_qproc", scope: !998, file: !999, line: 38, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "poll_queue_proc", file: !999, line: 31, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !952, !1006, !997}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !1008, line: 44, baseType: !1009)
!1008 = !DIFile(filename: "./include/linux/wait.h", directory: "/diffkemp/kernel/linux-4.11")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__wait_queue_head", file: !1008, line: 40, size: 704, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1009, file: !1008, line: 41, baseType: !535, size: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !1009, file: !1008, line: 42, baseType: !82, size: 128, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_key", scope: !998, file: !999, line: 39, baseType: !75, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "unlocked_ioctl", scope: !945, file: !391, line: 1664, baseType: !1015, size: 64, offset: 576)
