; ModuleID = 'sound/usb/card.bc'
source_filename = "sound/usb/card.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kernel_param_ops = type { i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.kernel_param_ops*, i16, i16, %union.anon.42 }
%union.anon.42 = type { i8* }
%struct.kparam_array = type { i32, i32, i32*, %struct.kernel_param_ops*, i8* }
%struct.usb_driver = type { i8*, i32 (%struct.usb_interface*, %struct.usb_device_id*)*, void (%struct.usb_interface*)*, i32 (%struct.usb_interface*, i32, i8*)*, i32 (%struct.usb_interface*, i32)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, %struct.usb_device_id*, %struct.usb_dynids, %struct.usbdrv_wrap, i8 }
%struct.usb_interface = type { %struct.usb_host_interface*, %struct.usb_host_interface*, i32, %struct.usb_interface_assoc_descriptor*, i32, i32, i8, %struct.device, %struct.device*, %struct.atomic_t, %struct.work_struct }
%struct.usb_host_interface = type { %struct.usb_interface_descriptor, i32, i8*, %struct.usb_host_endpoint*, i8* }
%struct.usb_interface_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.usb_host_endpoint = type <{ %struct.usb_endpoint_descriptor, %struct.usb_ss_ep_comp_descriptor, i8, %struct.list_head, i8*, %struct.ep_device*, i8*, i32, i32 }>

!9 = !DIEnumerator(name: "USB_STATE_ATTACHED", value: 1)
!10 = !DIEnumerator(name: "USB_STATE_POWERED", value: 2)
!11 = !DIEnumerator(name: "USB_STATE_RECONNECTING", value: 3)
!12 = !DIEnumerator(name: "USB_STATE_UNAUTHENTICATED", value: 4)
!13 = !DIEnumerator(name: "USB_STATE_DEFAULT", value: 5)
!14 = !DIEnumerator(name: "USB_STATE_ADDRESS", value: 6)
!15 = !DIEnumerator(name: "USB_STATE_CONFIGURED", value: 7)
!16 = !DIEnumerator(name: "USB_STATE_SUSPENDED", value: 8)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_device_speed", file: !6, line: 910, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24}
!19 = !DIEnumerator(name: "USB_SPEED_UNKNOWN", value: 0)
!20 = !DIEnumerator(name: "USB_SPEED_LOW", value: 1)
!21 = !DIEnumerator(name: "USB_SPEED_FULL", value: 2)
!22 = !DIEnumerator(name: "USB_SPEED_HIGH", value: 3)
!23 = !DIEnumerator(name: "USB_SPEED_WIRELESS", value: 4)
!24 = !DIEnumerator(name: "USB_SPEED_SUPER", value: 5)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !26, line: 27, size: 32, elements: !27)
!26 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/diffkemp/kernel/linux-3.10")
!27 = !{!28, !29, !30}
!28 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!29 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!30 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !32, line: 202, size: 32, elements: !33)
!32 = !DIFile(filename: "include/linux/module.h", directory: "/diffkemp/kernel/linux-3.10")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!35 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!36 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!37 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !39, line: 53, size: 32, elements: !40)
!39 = !DIFile(filename: "include/linux/quota.h", directory: "/diffkemp/kernel/linux-3.10")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "USRQUOTA", value: 0)
!42 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!43 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !45, line: 6, size: 32, elements: !46)
!45 = !DIFile(filename: "include/linux/pid.h", directory: "/diffkemp/kernel/linux-3.10")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!48 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!49 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!50 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !52, line: 10, size: 32, elements: !53)
!52 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/diffkemp/kernel/linux-3.10")
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!55 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!56 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !58, line: 44, size: 32, elements: !59)
!58 = !DIFile(filename: "include/linux/hrtimer.h", directory: "/diffkemp/kernel/linux-3.10")
!59 = !{!60, !61}
!60 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!61 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !63, line: 65, size: 32, elements: !64)
!63 = !DIFile(filename: "include/linux/pm_qos.h", directory: "/diffkemp/kernel/linux-3.10")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0)
!66 = !DIEnumerator(name: "PM_QOS_MAX", value: 1)
!67 = !DIEnumerator(name: "PM_QOS_MIN", value: 2)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !63, line: 51, size: 32, elements: !69)
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY", value: 1)
!71 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 2)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_interface_condition", file: !73, line: 91, size: 32, elements: !74)
!73 = !DIFile(filename: "include/linux/usb.h", directory: "/diffkemp/kernel/linux-3.10")
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "USB_INTERFACE_UNBOUND", value: 0)
!76 = !DIEnumerator(name: "USB_INTERFACE_BINDING", value: 1)
!77 = !DIEnumerator(name: "USB_INTERFACE_BOUND", value: 2)
!78 = !DIEnumerator(name: "USB_INTERFACE_UNBINDING", value: 3)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_device_removable", file: !73, line: 383, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE_UNKNOWN", value: 0)
!82 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE", value: 1)
!83 = !DIEnumerator(name: "USB_DEVICE_FIXED", value: 2)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 10, size: 32, elements: !86)
!85 = !DIFile(filename: "include/linux/stddef.h", directory: "/diffkemp/kernel/linux-3.10")
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "false", value: 0)
!88 = !DIEnumerator(name: "true", value: 1)
!89 = !{!90, !108, !113, !115, !117, !969, !2962, !187, !174, !270, !2964, !203, !3654, !4553}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snd_usb_audio_quirk", file: !93, line: 95, size: 256, elements: !94)
!93 = !DIFile(filename: "sound/usb/usbaudio.h", directory: "/diffkemp/kernel/linux-3.10")
!94 = !{!95, !99, !100, !106, !110}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_name", scope: !92, file: !93, line: 96, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "product_name", scope: !92, file: !93, line: 97, baseType: !96, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ifnum", scope: !92, file: !93, line: 98, baseType: !101, size: 16, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !102, line: 100, baseType: !103)
!102 = !DIFile(filename: "include/linux/types.h", directory: "/diffkemp/kernel/linux-3.10")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !104, line: 22, baseType: !105)
!104 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!105 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !93, line: 99, baseType: !107, size: 16, offset: 144)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !102, line: 107, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !104, line: 23, baseType: !109)
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !93, line: 100, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !114, line: 32, baseType: !108)
!114 = !DIFile(filename: "include/uapi/linux/types.h", directory: "/diffkemp/kernel/linux-3.10")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !116, line: 19, baseType: !109)
!116 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !32, line: 223, size: 4352, elements: !119)
!119 = !{!120, !121, !127, !131, !312, !338, !339, !340, !341, !349, !352, !353, !400, !401, !402, !403, !404, !405, !406, !407, !408, !415, !419, !420, !421, !422, !423, !424, !425, !426, !427, !431, !432, !433, !434, !443, !462, !463, !464, !465, !466, !467, !470, !473, !474, !475, !476, !477, !501, !502, !504, !508, !509, !510, !511, !2955, !2956}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !118, file: !32, line: 225, baseType: !31, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !118, file: !32, line: 228, baseType: !122, size: 128, offset: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !102, line: 185, size: 128, elements: !123)
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !102, line: 186, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !102, line: 186, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !32, line: 231, baseType: !128, size: 448, offset: 192)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 56)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !118, file: !32, line: 234, baseType: !132, size: 704, offset: 640)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !32, line: 40, size: 704, elements: !133)
!133 = !{!134, !307, !308, !309}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !132, file: !32, line: 41, baseType: !135, size: 512)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !136, line: 60, size: 512, elements: !137)
!136 = !DIFile(filename: "include/linux/kobject.h", directory: "/diffkemp/kernel/linux-3.10")
!137 = !{!138, !139, !140, !142, !212, !289, !292, !301, !303, !304, !305, !306}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 61, baseType: !96, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !135, file: !136, line: 62, baseType: !122, size: 128, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !136, line: 63, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !135, file: !136, line: 64, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !136, line: 159, size: 768, elements: !145)
!145 = !{!146, !147, !176, !177}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !144, file: !136, line: 160, baseType: !122, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !144, file: !136, line: 161, baseType: !148, size: 16, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !149, line: 76, baseType: !150)
!149 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !149, line: 64, size: 16, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, scope: !150, file: !149, line: 65, baseType: !153, size: 16)
!153 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !150, file: !149, line: 65, size: 16, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !153, file: !149, line: 66, baseType: !156, size: 16)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !149, line: 20, size: 16, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !156, file: !149, line: 21, baseType: !159, size: 16)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !160, line: 27, baseType: !161)
!160 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_spinlock", file: !160, line: 20, size: 16, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !160, line: 21, baseType: !164, size: 16)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !160, line: 21, size: 16, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "head_tail", scope: !164, file: !160, line: 22, baseType: !167, size: 16)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticketpair_t", file: !160, line: 12, baseType: !115)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tickets", scope: !164, file: !160, line: 25, baseType: !169, size: 16)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__raw_tickets", file: !160, line: 23, size: 16, elements: !170)
!170 = !{!171, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !169, file: !160, line: 24, baseType: !172, size: 8)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticket_t", file: !160, line: 11, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !116, line: 16, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !169, file: !160, line: 24, baseType: !172, size: 8, offset: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !144, file: !136, line: 162, baseType: !135, size: 512, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !144, file: !136, line: 163, baseType: !178, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !136, line: 123, size: 192, elements: !181)
!181 = !{!182, !188, !193}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !180, file: !136, line: 124, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !143, !141}
!187 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !136, line: 125, baseType: !189, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!96, !143, !141}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !180, file: !136, line: 126, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!187, !143, !141, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !136, line: 116, size: 18496, elements: !200)
!200 = !{!201, !206, !207, !211}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !199, file: !136, line: 117, baseType: !202, size: 2048)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 2048, elements: !204)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!204 = !{!205}
!205 = !DISubrange(count: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !199, file: !136, line: 118, baseType: !187, size: 32, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !199, file: !136, line: 119, baseType: !208, size: 16384, offset: 2080)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 16384, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2048)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !199, file: !136, line: 120, baseType: !187, size: 32, offset: 18464)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !135, file: !136, line: 65, baseType: !213, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !136, line: 108, size: 320, elements: !215)
!215 = !{!216, !220, !255, !257, !285}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !214, file: !136, line: 109, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !141}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !214, file: !136, line: 110, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !224, line: 124, size: 192, elements: !225)
!224 = !DIFile(filename: "include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-3.10")
!225 = !{!226, !241, !249}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !223, file: !224, line: 125, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !141, !235, !203}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !102, line: 59, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !232, line: 72, baseType: !233)
!232 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-3.10")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !232, line: 14, baseType: !234)
!234 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !224, line: 26, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !224, line: 27, baseType: !96, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !236, file: !224, line: 28, baseType: !240, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !102, line: 18, baseType: !109)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !223, file: !224, line: 126, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!230, !141, !235, !96, !245}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 54, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !232, line: 71, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !232, line: 15, baseType: !248)
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !223, file: !224, line: 127, baseType: !250, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!111, !141, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !214, file: !136, line: 111, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !214, file: !136, line: 112, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !141}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !26, line: 40, size: 320, elements: !264)
!264 = !{!265, !266, !271, !277, !281}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !26, line: 41, baseType: !25, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !263, file: !26, line: 42, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !263, file: !26, line: 43, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!111, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !26, line: 20, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !263, file: !26, line: 44, baseType: !278, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!111}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !263, file: !26, line: 45, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !270}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !214, file: !136, line: 113, baseType: !286, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!111, !141}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !135, file: !136, line: 66, baseType: !290, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_dirent", file: !224, line: 130, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !135, file: !136, line: 67, baseType: !293, size: 32, offset: 448)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !294, line: 24, size: 32, elements: !295)
!294 = !DIFile(filename: "include/linux/kref.h", directory: "/diffkemp/kernel/linux-3.10")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !293, file: !294, line: 25, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !102, line: 177, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 175, size: 32, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !298, file: !102, line: 176, baseType: !187, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !135, file: !136, line: 68, baseType: !302, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!302 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !135, file: !136, line: 69, baseType: !302, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !135, file: !136, line: 70, baseType: !302, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !135, file: !136, line: 71, baseType: !302, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !135, file: !136, line: 72, baseType: !302, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !132, file: !32, line: 42, baseType: !117, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !132, file: !32, line: 43, baseType: !141, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !132, file: !32, line: 44, baseType: !310, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !32, line: 44, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !118, file: !32, line: 235, baseType: !313, size: 64, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !32, line: 47, size: 448, elements: !315)
!315 = !{!316, !317, !322, !326, !330, !334}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !314, file: !32, line: 48, baseType: !236, size: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !314, file: !32, line: 49, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!230, !313, !321, !203}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !314, file: !32, line: 51, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!230, !313, !321, !96, !245}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !314, file: !32, line: 53, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !117, !96}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !314, file: !32, line: 54, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!187, !117}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !314, file: !32, line: 55, baseType: !335, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !117}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !118, file: !32, line: 236, baseType: !96, size: 64, offset: 1408)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !118, file: !32, line: 237, baseType: !96, size: 64, offset: 1472)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !118, file: !32, line: 238, baseType: !141, size: 64, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !118, file: !32, line: 241, baseType: !342, size: 64, offset: 1600)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !345, line: 26, size: 128, elements: !346)
!345 = !DIFile(filename: "include/linux/export.h", directory: "/diffkemp/kernel/linux-3.10")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !345, line: 28, baseType: !248, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !345, line: 29, baseType: !96, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !118, file: !32, line: 242, baseType: !350, size: 64, offset: 1664)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !118, file: !32, line: 243, baseType: !302, size: 32, offset: 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !118, file: !32, line: 246, baseType: !354, size: 64, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !356, line: 48, size: 256, elements: !357)
!356 = !DIFile(filename: "include/linux/moduleparam.h", directory: "/diffkemp/kernel/linux-3.10")
!357 = !{!358, !359, !375, !376, !378}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !356, line: 49, baseType: !96, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !355, file: !356, line: 50, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !356, line: 39, size: 192, elements: !363)
!363 = !{!364, !370, !374}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !362, file: !356, line: 41, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!187, !96, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !362, file: !356, line: 43, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!187, !203, !368}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !362, file: !356, line: 45, baseType: !282, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !355, file: !356, line: 51, baseType: !115, size: 16, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !355, file: !356, line: 52, baseType: !377, size: 16, offset: 144)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !116, line: 18, baseType: !105)
!378 = !DIDerivedType(tag: DW_TAG_member, scope: !355, file: !356, line: 53, baseType: !379, size: 64, offset: 192)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !355, file: !356, line: 53, size: 64, elements: !380)
!380 = !{!381, !382, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !379, file: !356, line: 54, baseType: !270, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !379, file: !356, line: 55, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !356, line: 61, size: 128, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !385, file: !356, line: 62, baseType: !302, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !385, file: !356, line: 63, baseType: !203, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !379, file: !356, line: 56, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !356, line: 67, size: 256, elements: !393)
!393 = !{!394, !395, !396, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !392, file: !356, line: 69, baseType: !302, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !392, file: !356, line: 70, baseType: !302, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !392, file: !356, line: 71, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !392, file: !356, line: 72, baseType: !360, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !392, file: !356, line: 73, baseType: !270, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !118, file: !32, line: 247, baseType: !302, size: 32, offset: 1856)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !118, file: !32, line: 250, baseType: !302, size: 32, offset: 1888)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !118, file: !32, line: 251, baseType: !342, size: 64, offset: 1920)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !118, file: !32, line: 252, baseType: !350, size: 64, offset: 1984)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !118, file: !32, line: 272, baseType: !342, size: 64, offset: 2048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !118, file: !32, line: 273, baseType: !350, size: 64, offset: 2112)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !118, file: !32, line: 274, baseType: !302, size: 32, offset: 2176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !118, file: !32, line: 277, baseType: !302, size: 32, offset: 2208)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !118, file: !32, line: 278, baseType: !409, size: 64, offset: 2240)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !411, line: 97, size: 64, elements: !412)
!411 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/uaccess.h", directory: "/diffkemp/kernel/linux-3.10")
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !410, file: !411, line: 98, baseType: !187, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !410, file: !411, line: 98, baseType: !187, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !118, file: !32, line: 281, baseType: !416, size: 64, offset: 2304)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!187}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !118, file: !32, line: 284, baseType: !270, size: 64, offset: 2368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "module_core", scope: !118, file: !32, line: 287, baseType: !270, size: 64, offset: 2432)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "init_size", scope: !118, file: !32, line: 290, baseType: !302, size: 32, offset: 2496)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "core_size", scope: !118, file: !32, line: 290, baseType: !302, size: 32, offset: 2528)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "init_text_size", scope: !118, file: !32, line: 293, baseType: !302, size: 32, offset: 2560)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "core_text_size", scope: !118, file: !32, line: 293, baseType: !302, size: 32, offset: 2592)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "init_ro_size", scope: !118, file: !32, line: 296, baseType: !302, size: 32, offset: 2624)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "core_ro_size", scope: !118, file: !32, line: 296, baseType: !302, size: 32, offset: 2656)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !118, file: !32, line: 299, baseType: !428, offset: 2688)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !429, line: 9, elements: !430)
!429 = !DIFile(filename: "include/asm-generic/module.h", directory: "/diffkemp/kernel/linux-3.10")
!430 = !{}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !118, file: !32, line: 301, baseType: !302, size: 32, offset: 2688)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !118, file: !32, line: 305, baseType: !302, size: 32, offset: 2720)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !118, file: !32, line: 306, baseType: !122, size: 128, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !118, file: !32, line: 307, baseType: !435, size: 64, offset: 2880)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !437, line: 18, size: 96, elements: !438)
!437 = !DIFile(filename: "include/asm-generic/bug.h", directory: "/diffkemp/kernel/linux-3.10")
!438 = !{!439, !440, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr_disp", scope: !436, file: !437, line: 22, baseType: !187, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "file_disp", scope: !436, file: !437, line: 28, baseType: !187, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !436, file: !437, line: 30, baseType: !109, size: 16, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !436, file: !437, line: 32, baseType: !109, size: 16, offset: 80)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !118, file: !32, line: 316, baseType: !444, size: 64, offset: 2944)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !446, line: 198, baseType: !447)
!446 = !DIFile(filename: "include/uapi/linux/elf.h", directory: "/diffkemp/kernel/linux-3.10")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !446, line: 191, size: 192, elements: !448)
!448 = !{!449, !452, !453, !454, !456, !460}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !447, file: !446, line: 192, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !446, line: 20, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !104, line: 26, baseType: !302)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !447, file: !446, line: 193, baseType: !174, size: 8, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !447, file: !446, line: 194, baseType: !174, size: 8, offset: 40)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !447, file: !446, line: 195, baseType: !455, size: 16, offset: 48)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !446, line: 16, baseType: !108)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !447, file: !446, line: 196, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !446, line: 15, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !104, line: 30, baseType: !459)
!459 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !447, file: !446, line: 197, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !446, line: 21, baseType: !458)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "core_symtab", scope: !118, file: !32, line: 316, baseType: !444, size: 64, offset: 3008)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !118, file: !32, line: 317, baseType: !302, size: 32, offset: 3072)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "core_num_syms", scope: !118, file: !32, line: 317, baseType: !302, size: 32, offset: 3104)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !118, file: !32, line: 318, baseType: !203, size: 64, offset: 3136)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "core_strtab", scope: !118, file: !32, line: 318, baseType: !203, size: 64, offset: 3200)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !118, file: !32, line: 321, baseType: !468, size: 64, offset: 3264)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !32, line: 321, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !118, file: !32, line: 324, baseType: !471, size: 64, offset: 3328)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !32, line: 324, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !118, file: !32, line: 329, baseType: !203, size: 64, offset: 3392)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !118, file: !32, line: 333, baseType: !270, size: 64, offset: 3456)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !118, file: !32, line: 334, baseType: !302, size: 32, offset: 3520)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !118, file: !32, line: 338, baseType: !302, size: 32, offset: 3552)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !118, file: !32, line: 339, baseType: !478, size: 64, offset: 3584)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !482, line: 30, size: 320, elements: !483)
!482 = !DIFile(filename: "include/linux/tracepoint.h", directory: "/diffkemp/kernel/linux-3.10")
!483 = !{!484, !485, !490, !494, !495}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !482, line: 31, baseType: !96, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !481, file: !482, line: 32, baseType: !486, size: 32, offset: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !487, line: 136, size: 32, elements: !488)
!487 = !DIFile(filename: "include/linux/jump_label.h", directory: "/diffkemp/kernel/linux-3.10")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !486, file: !487, line: 137, baseType: !297, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "regfunc", scope: !481, file: !482, line: 33, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "unregfunc", scope: !481, file: !482, line: 34, baseType: !491, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !481, file: !482, line: 35, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint_func", file: !482, line: 25, size: 128, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !497, file: !482, line: 26, baseType: !270, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !497, file: !482, line: 27, baseType: !270, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_bprintk_fmt", scope: !118, file: !32, line: 346, baseType: !302, size: 32, offset: 3648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "trace_bprintk_fmt_start", scope: !118, file: !32, line: 347, baseType: !503, size: 64, offset: 3712)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "trace_events", scope: !118, file: !32, line: 350, baseType: !505, size: 64, offset: 3776)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftrace_event_call", file: !32, line: 350, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_events", scope: !118, file: !32, line: 351, baseType: !302, size: 32, offset: 3840)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "source_list", scope: !118, file: !32, line: 360, baseType: !122, size: 128, offset: 3904)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "target_list", scope: !118, file: !32, line: 362, baseType: !122, size: 128, offset: 4032)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "waiter", scope: !118, file: !32, line: 365, baseType: !512, size: 64, offset: 4160)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !514, line: 1034, size: 15552, elements: !515)
!514 = !DIFile(filename: "include/linux/sched.h", directory: "/diffkemp/kernel/linux-3.10")
!515 = !{!516, !518, !519, !520, !521, !522, !528, !529, !530, !531, !532, !533, !534, !538, !609, !618, !621, !622, !623, !624, !625, !634, !641, !642, !649, !2275, !2276, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2311, !2312, !2314, !2315, !2316, !2319, !2320, !2321, !2322, !2323, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2340, !2342, !2343, !2344, !2346, !2347, !2348, !2355, !2557, !2560, !2561, !2565, !2742, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2779, !2780, !2782, !2783, !2787, !2788, !2789, !2797, !2798, !2799, !2800, !2801, !2805, !2809, !2810, !2813, !2816, !2819, !2820, !2824, !2825, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2903, !2904, !2907, !2910, !2911, !2914, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2931, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !513, file: !514, line: 1035, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !513, file: !514, line: 1036, baseType: !270, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !513, file: !514, line: 1037, baseType: !297, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !513, file: !514, line: 1038, baseType: !302, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !513, file: !514, line: 1039, baseType: !302, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !513, file: !514, line: 1042, baseType: !523, size: 64, offset: 256)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !524, line: 65, size: 64, elements: !525)
!524 = !DIFile(filename: "include/linux/llist.h", directory: "/diffkemp/kernel/linux-3.10")
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !524, line: 66, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !513, file: !514, line: 1043, baseType: !187, size: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !513, file: !514, line: 1045, baseType: !187, size: 32, offset: 352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !513, file: !514, line: 1047, baseType: !187, size: 32, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !513, file: !514, line: 1047, baseType: !187, size: 32, offset: 416)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !513, file: !514, line: 1047, baseType: !187, size: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !513, file: !514, line: 1048, baseType: !302, size: 32, offset: 480)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !513, file: !514, line: 1049, baseType: !535, size: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !514, line: 1049, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !513, file: !514, line: 1050, baseType: !539, size: 3008, offset: 576)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !514, line: 972, size: 3008, elements: !540)
!540 = !{!541, !546, !554, !555, !556, !558, !559, !560, !561, !562, !594, !596, !599, !600}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !539, file: !514, line: 973, baseType: !542, size: 128)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !514, line: 920, size: 128, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !542, file: !514, line: 921, baseType: !248, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !542, file: !514, line: 921, baseType: !248, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !539, file: !514, line: 974, baseType: !547, size: 192, align: 64, offset: 128)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !548, line: 35, size: 192, align: 64, elements: !549)
!548 = !DIFile(filename: "include/linux/rbtree.h", directory: "/diffkemp/kernel/linux-3.10")
!549 = !{!550, !551, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !547, file: !548, line: 36, baseType: !248, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !547, file: !548, line: 37, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !547, file: !548, line: 38, baseType: !552, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !539, file: !514, line: 975, baseType: !122, size: 128, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !539, file: !514, line: 976, baseType: !302, size: 32, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !539, file: !514, line: 978, baseType: !557, size: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !116, line: 25, baseType: !459)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !539, file: !514, line: 979, baseType: !557, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !539, file: !514, line: 980, baseType: !557, size: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !539, file: !514, line: 981, baseType: !557, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !539, file: !514, line: 983, baseType: !557, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !539, file: !514, line: 986, baseType: !563, size: 1728, offset: 832)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !514, line: 937, size: 1728, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !563, file: !514, line: 938, baseType: !557, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !563, file: !514, line: 939, baseType: !557, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !563, file: !514, line: 940, baseType: !557, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !563, file: !514, line: 941, baseType: !557, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !563, file: !514, line: 942, baseType: !557, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !563, file: !514, line: 943, baseType: !557, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !563, file: !514, line: 945, baseType: !557, size: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !563, file: !514, line: 946, baseType: !557, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !563, file: !514, line: 947, baseType: !574, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !116, line: 24, baseType: !575)
!575 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !563, file: !514, line: 949, baseType: !557, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !563, file: !514, line: 950, baseType: !557, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !563, file: !514, line: 951, baseType: !557, size: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !563, file: !514, line: 952, baseType: !557, size: 64, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !563, file: !514, line: 954, baseType: !557, size: 64, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !563, file: !514, line: 955, baseType: !557, size: 64, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !563, file: !514, line: 956, baseType: !557, size: 64, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !563, file: !514, line: 957, baseType: !557, size: 64, offset: 1024)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !563, file: !514, line: 958, baseType: !557, size: 64, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !563, file: !514, line: 960, baseType: !557, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !563, file: !514, line: 961, baseType: !557, size: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !563, file: !514, line: 962, baseType: !557, size: 64, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !563, file: !514, line: 963, baseType: !557, size: 64, offset: 1344)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !563, file: !514, line: 964, baseType: !557, size: 64, offset: 1408)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !563, file: !514, line: 965, baseType: !557, size: 64, offset: 1472)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !563, file: !514, line: 966, baseType: !557, size: 64, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !563, file: !514, line: 967, baseType: !557, size: 64, offset: 1600)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !563, file: !514, line: 968, baseType: !557, size: 64, offset: 1664)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !539, file: !514, line: 990, baseType: !595, size: 64, offset: 2560)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !539, file: !514, line: 992, baseType: !597, size: 64, offset: 2624)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !514, line: 123, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !539, file: !514, line: 994, baseType: !597, size: 64, offset: 2688)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !539, file: !514, line: 1004, baseType: !601, size: 256, offset: 2752)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !514, line: 924, size: 256, elements: !602)
!602 = !{!603, !605, !606, !607, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum", scope: !601, file: !514, line: 930, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !116, line: 22, baseType: !302)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_period", scope: !601, file: !514, line: 930, baseType: !604, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "last_runnable_update", scope: !601, file: !514, line: 931, baseType: !557, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decay_count", scope: !601, file: !514, line: 932, baseType: !574, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg_contrib", scope: !601, file: !514, line: 933, baseType: !248, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !513, file: !514, line: 1051, baseType: !610, size: 384, offset: 3584)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !514, line: 1008, size: 384, elements: !611)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !610, file: !514, line: 1009, baseType: !122, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !610, file: !514, line: 1010, baseType: !248, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !610, file: !514, line: 1011, baseType: !248, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !610, file: !514, line: 1012, baseType: !302, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !610, file: !514, line: 1014, baseType: !617, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !513, file: !514, line: 1053, baseType: !619, size: 64, offset: 3968)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !514, line: 124, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_counter", scope: !513, file: !514, line: 1069, baseType: !174, size: 8, offset: 4032)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "btrace_seq", scope: !513, file: !514, line: 1071, baseType: !302, size: 32, offset: 4064)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !513, file: !514, line: 1074, baseType: !302, size: 32, offset: 4096)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !513, file: !514, line: 1075, baseType: !187, size: 32, offset: 4128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_allowed", scope: !513, file: !514, line: 1076, baseType: !626, size: 64, offset: 4160)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !627, line: 14, baseType: !628)
!627 = !DIFile(filename: "include/linux/cpumask.h", directory: "/diffkemp/kernel/linux-3.10")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !627, line: 14, size: 64, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !628, file: !627, line: 14, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 64, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 1)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !513, file: !514, line: 1091, baseType: !635, size: 256, offset: 4224)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !514, line: 695, size: 256, elements: !636)
!636 = !{!637, !638, !639, !640}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !635, file: !514, line: 697, baseType: !248, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "run_delay", scope: !635, file: !514, line: 698, baseType: !459, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "last_arrival", scope: !635, file: !514, line: 701, baseType: !459, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "last_queued", scope: !635, file: !514, line: 702, baseType: !459, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !513, file: !514, line: 1094, baseType: !122, size: 128, offset: 4480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_tasks", scope: !513, file: !514, line: 1096, baseType: !643, size: 320, offset: 4608)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_node", file: !644, line: 85, size: 320, elements: !645)
!644 = !DIFile(filename: "include/linux/plist.h", directory: "/diffkemp/kernel/linux-3.10")
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !643, file: !644, line: 86, baseType: !187, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prio_list", scope: !643, file: !644, line: 87, baseType: !122, size: 128, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !643, file: !644, line: 88, baseType: !122, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !513, file: !514, line: 1099, baseType: !650, size: 64, offset: 4928)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !652, line: 325, size: 6528, elements: !653)
!652 = !DIFile(filename: "include/linux/mm_types.h", directory: "/diffkemp/kernel/linux-3.10")
!653 = !{!654, !2180, !2181, !2182, !2183, !2187, !2188, !2189, !2190, !2191, !2192, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2230, !2235, !2238, !2241, !2251, !2252, !2269, !2270, !2271, !2272}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !651, file: !652, line: 326, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !652, line: 228, size: 1472, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !673, !674, !683, !684, !687, !2176, !2177, !2178, !2179}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !656, file: !652, line: 231, baseType: !248, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !656, file: !652, line: 232, baseType: !248, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !656, file: !652, line: 236, baseType: !655, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !656, file: !652, line: 236, baseType: !655, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !656, file: !652, line: 238, baseType: !547, size: 192, align: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !656, file: !652, line: 246, baseType: !248, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !656, file: !652, line: 250, baseType: !650, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !656, file: !652, line: 251, baseType: !666, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !667, line: 212, baseType: !668)
!667 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/pgtable_types.h", directory: "/diffkemp/kernel/linux-3.10")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !667, line: 212, size: 64, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !668, file: !667, line: 212, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !672, line: 16, baseType: !248)
!672 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/pgtable_64_types.h", directory: "/diffkemp/kernel/linux-3.10")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !656, file: !652, line: 252, baseType: !248, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !656, file: !652, line: 265, baseType: !675, size: 256, offset: 704)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !656, file: !652, line: 259, size: 256, elements: !676)
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !675, file: !652, line: 263, baseType: !678, size: 256)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !652, line: 260, size: 256, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !678, file: !652, line: 261, baseType: !547, size: 192, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !678, file: !652, line: 262, baseType: !248, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nonlinear", scope: !675, file: !652, line: 264, baseType: !122, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !656, file: !652, line: 273, baseType: !122, size: 128, offset: 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !656, file: !652, line: 275, baseType: !685, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !652, line: 275, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !656, file: !652, line: 278, baseType: !688, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !691, line: 196, size: 576, elements: !692)
!691 = !DIFile(filename: "include/linux/mm.h", directory: "/diffkemp/kernel/linux-3.10")
!692 = !{!693, !697, !698, !2146, !2147, !2151, !2157, !2161, !2172}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !690, file: !691, line: 197, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !655}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !690, file: !691, line: 198, baseType: !694, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fault", scope: !690, file: !691, line: 199, baseType: !699, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!187, !655, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_fault", file: !691, line: 179, size: 256, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !691, line: 180, baseType: !302, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pgoff", scope: !703, file: !691, line: 181, baseType: !248, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_address", scope: !703, file: !691, line: 182, baseType: !270, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !703, file: !691, line: 184, baseType: !709, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !652, line: 41, size: 512, align: 128, elements: !711)
!711 = !{!712, !713, !2057, !2085, !2099}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !710, file: !652, line: 43, baseType: !248, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !710, file: !652, line: 45, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !716, line: 406, size: 1344, align: 64, elements: !717)
!716 = !DIFile(filename: "include/linux/fs.h", directory: "/diffkemp/kernel/linux-3.10")
!717 = !{!718, !1936, !1945, !1946, !1947, !1951, !1952, !1953, !1954, !1955, !2052, !2053, !2054, !2055, !2056}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !715, file: !716, line: 407, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !716, line: 521, size: 4480, elements: !721)
!721 = !{!722, !723, !724, !729, !733, !734, !737, !738, !1882, !1883, !1884, !1885, !1886, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1923, !1924, !1932, !1933, !1934, !1935}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !720, file: !716, line: 522, baseType: !240, size: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !720, file: !716, line: 523, baseType: !109, size: 16, offset: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !720, file: !716, line: 524, baseType: !725, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !726, line: 46, baseType: !727)
!726 = !DIFile(filename: "include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-3.10")
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !102, line: 31, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !232, line: 48, baseType: !302)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !720, file: !716, line: 525, baseType: !730, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !726, line: 47, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !102, line: 32, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !232, line: 49, baseType: !302)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !720, file: !716, line: 526, baseType: !302, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !720, file: !716, line: 529, baseType: !735, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !716, line: 509, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !720, file: !716, line: 530, baseType: !735, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !720, file: !716, line: 533, baseType: !739, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !716, line: 1548, size: 1536, align: 512, elements: !742)
!742 = !{!743, !1344, !1350, !1354, !1358, !1362, !1366, !1370, !1374, !1378, !1382, !1386, !1387, !1391, !1395, !1813, !1834, !1838, !1842, !1846, !1850, !1873, !1878}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !741, file: !716, line: 1549, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !719, !747, !302}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !749, line: 103, size: 1536, elements: !750)
!749 = !DIFile(filename: "include/linux/dcache.h", directory: "/diffkemp/kernel/linux-3.10")
!750 = !{!751, !752, !758, !766, !767, !782, !783, !785, !786, !787, !847, !1326, !1327, !1328, !1329, !1342, !1343}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !748, file: !749, line: 105, baseType: !302, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !748, file: !749, line: 106, baseType: !753, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !754, line: 41, baseType: !755)
!754 = !DIFile(filename: "include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-3.10")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !754, line: 39, size: 32, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !755, file: !754, line: 40, baseType: !302, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !748, file: !749, line: 107, baseType: !759, size: 128, offset: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !760, line: 37, size: 128, elements: !761)
!760 = !DIFile(filename: "include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-3.10")
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !760, line: 38, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !759, file: !760, line: 38, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !748, file: !749, line: 108, baseType: !747, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !748, file: !749, line: 109, baseType: !768, size: 128, offset: 256)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !749, line: 42, size: 128, elements: !769)
!769 = !{!770, !779}
!770 = !DIDerivedType(tag: DW_TAG_member, scope: !768, file: !749, line: 43, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !768, file: !749, line: 43, size: 64, elements: !772)
!772 = !{!773, !778}
!773 = !DIDerivedType(tag: DW_TAG_member, scope: !771, file: !749, line: 44, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !749, line: 44, size: 64, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !774, file: !749, line: 45, baseType: !604, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !774, file: !749, line: 45, baseType: !604, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !771, file: !749, line: 47, baseType: !557, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !749, line: 49, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !748, file: !749, line: 110, baseType: !719, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !748, file: !749, line: 112, baseType: !784, size: 256, offset: 448)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 256, elements: !204)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "d_count", scope: !748, file: !749, line: 115, baseType: !302, size: 32, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "d_lock", scope: !748, file: !749, line: 116, baseType: !148, size: 16, offset: 736)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !748, file: !749, line: 117, baseType: !788, size: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !749, line: 146, size: 1024, align: 512, elements: !791)
!791 = !{!792, !796, !797, !806, !812, !816, !820, !821, !825, !829, !841}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !790, file: !749, line: 147, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!187, !747, !302}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !790, file: !749, line: 148, baseType: !793, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !790, file: !749, line: 149, baseType: !798, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!187, !801, !803, !805}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !790, file: !749, line: 151, baseType: !807, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!187, !801, !803, !801, !803, !302, !96, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !790, file: !749, line: 154, baseType: !813, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!187, !801}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !790, file: !749, line: 155, baseType: !817, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !747}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !790, file: !749, line: 156, baseType: !817, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !790, file: !749, line: 157, baseType: !822, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !747, !719}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !790, file: !749, line: 158, baseType: !826, size: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!203, !747, !203, !187}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !790, file: !749, line: 159, baseType: !830, size: 64, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !835}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !749, line: 15, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !837, line: 7, size: 128, elements: !838)
!837 = !DIFile(filename: "include/linux/path.h", directory: "/diffkemp/kernel/linux-3.10")
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !836, file: !837, line: 8, baseType: !833, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !836, file: !837, line: 9, baseType: !747, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "d_manage", scope: !790, file: !749, line: 160, baseType: !842, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!187, !747, !845}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !102, line: 29, baseType: !846)
!846 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "d_sb", scope: !748, file: !749, line: 118, baseType: !848, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !716, line: 1236, size: 8192, elements: !850)
!850 = !{!851, !852, !855, !856, !857, !860, !898, !975, !1056, !1149, !1153, !1154, !1155, !1156, !1164, !1165, !1166, !1167, !1172, !1173, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1216, !1219, !1222, !1223, !1267, !1284, !1286, !1290, !1291, !1292, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1324, !1325}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !849, file: !716, line: 1237, baseType: !122, size: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !849, file: !716, line: 1238, baseType: !853, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !102, line: 15, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !102, line: 12, baseType: !451)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !849, file: !716, line: 1239, baseType: !174, size: 8, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !849, file: !716, line: 1240, baseType: !248, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !849, file: !716, line: 1241, baseType: !858, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !102, line: 45, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !232, line: 87, baseType: !575)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !849, file: !716, line: 1242, baseType: !861, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !716, line: 1804, size: 448, elements: !863)
!863 = !{!864, !865, !866, !870, !874, !875, !876, !886, !889, !890, !891, !895, !896, !897}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !862, file: !716, line: 1805, baseType: !96, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !862, file: !716, line: 1806, baseType: !187, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !862, file: !716, line: 1813, baseType: !867, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!747, !861, !187, !96, !270}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !862, file: !716, line: 1815, baseType: !871, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !848}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !862, file: !716, line: 1816, baseType: !117, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !862, file: !716, line: 1817, baseType: !861, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !862, file: !716, line: 1818, baseType: !877, size: 64, offset: 384)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !102, line: 189, size: 64, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !877, file: !102, line: 190, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !102, line: 193, size: 128, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !102, line: 194, baseType: !880, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !881, file: !102, line: 194, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !862, file: !716, line: 1820, baseType: !887, offset: 448)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !888, line: 411, elements: !430)
!888 = !DIFile(filename: "include/linux/lockdep.h", directory: "/diffkemp/kernel/linux-3.10")
!889 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !862, file: !716, line: 1821, baseType: !887, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !862, file: !716, line: 1822, baseType: !887, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !862, file: !716, line: 1823, baseType: !892, offset: 448)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 3)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !862, file: !716, line: 1825, baseType: !887, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !862, file: !716, line: 1826, baseType: !887, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !862, file: !716, line: 1827, baseType: !887, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !849, file: !716, line: 1243, baseType: !899, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !716, line: 1592, size: 1408, elements: !902)
!902 = !{!903, !907, !911, !915, !921, !925, !926, !927, !931, !935, !936, !942, !947, !948, !954, !955, !956, !957, !961, !965, !970, !971}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !901, file: !716, line: 1593, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!719, !848}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !901, file: !716, line: 1594, baseType: !908, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !719}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !901, file: !716, line: 1596, baseType: !912, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !719, !187}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !901, file: !716, line: 1597, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!187, !719, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !716, line: 289, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !901, file: !716, line: 1598, baseType: !922, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!187, !719}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !901, file: !716, line: 1599, baseType: !908, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !901, file: !716, line: 1600, baseType: !871, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !901, file: !716, line: 1601, baseType: !928, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!187, !848, !187}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !901, file: !716, line: 1602, baseType: !932, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!187, !848}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !901, file: !716, line: 1603, baseType: !932, size: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !901, file: !716, line: 1604, baseType: !937, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!187, !747, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !716, line: 42, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !901, file: !716, line: 1605, baseType: !943, size: 64, offset: 704)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!187, !848, !946, !203}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !901, file: !716, line: 1606, baseType: !871, size: 64, offset: 768)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !901, file: !716, line: 1608, baseType: !949, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!187, !952, !747}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !667, line: 330, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !901, file: !716, line: 1609, baseType: !949, size: 64, offset: 896)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !901, file: !716, line: 1610, baseType: !949, size: 64, offset: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !901, file: !716, line: 1611, baseType: !949, size: 64, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "quota_read", scope: !901, file: !716, line: 1613, baseType: !958, size: 64, offset: 1088)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!230, !848, !187, !203, !245, !858}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "quota_write", scope: !901, file: !716, line: 1614, baseType: !962, size: 64, offset: 1152)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!230, !848, !187, !96, !245, !858}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !901, file: !716, line: 1616, baseType: !966, size: 64, offset: 1216)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!187, !848, !709, !969}
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !102, line: 157, baseType: !302)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cached_objects", scope: !901, file: !716, line: 1617, baseType: !932, size: 64, offset: 1280)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "free_cached_objects", scope: !901, file: !716, line: 1618, baseType: !972, size: 64, offset: 1344)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !848, !187}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dq_op", scope: !849, file: !716, line: 1244, baseType: !976, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dquot_operations", file: !39, line: 304, size: 512, elements: !979)
!979 = !{!980, !1039, !1043, !1047, !1048, !1049, !1050, !1051}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "write_dquot", scope: !978, file: !39, line: 305, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!187, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dquot", file: !39, line: 277, size: 1920, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !1000, !1001, !1008, !1009, !1022, !1023, !1024}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dq_hash", scope: !985, file: !39, line: 278, baseType: !881, size: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "dq_inuse", scope: !985, file: !39, line: 279, baseType: !122, size: 128, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dq_free", scope: !985, file: !39, line: 280, baseType: !122, size: 128, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dq_dirty", scope: !985, file: !39, line: 281, baseType: !122, size: 128, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dq_lock", scope: !985, file: !39, line: 282, baseType: !992, size: 320, offset: 512)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !993, line: 48, size: 320, elements: !994)
!993 = !DIFile(filename: "include/linux/mutex.h", directory: "/diffkemp/kernel/linux-3.10")
!994 = !{!995, !996, !997, !998, !999}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !992, file: !993, line: 50, baseType: !297, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !992, file: !993, line: 51, baseType: !148, size: 16, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !992, file: !993, line: 52, baseType: !122, size: 128, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !992, file: !993, line: 54, baseType: !512, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "spin_mlock", scope: !992, file: !993, line: 57, baseType: !270, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dq_count", scope: !985, file: !39, line: 283, baseType: !297, size: 32, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dq_wait_unused", scope: !985, file: !39, line: 284, baseType: !1002, size: 192, offset: 896)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !1003, line: 37, baseType: !1004)
!1003 = !DIFile(filename: "include/linux/wait.h", directory: "/diffkemp/kernel/linux-3.10")
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__wait_queue_head", file: !1003, line: 33, size: 192, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1004, file: !1003, line: 34, baseType: !148, size: 16)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !1004, file: !1003, line: 35, baseType: !122, size: 128, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dq_sb", scope: !985, file: !39, line: 285, baseType: !848, size: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dq_id", scope: !985, file: !39, line: 286, baseType: !1010, size: 64, offset: 1152)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kqid", file: !39, line: 62, size: 64, elements: !1011)
!1011 = !{!1012, !1021}
!1012 = !DIDerivedType(tag: DW_TAG_member, scope: !1010, file: !39, line: 63, baseType: !1013, size: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1010, file: !39, line: 63, size: 32, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1013, file: !39, line: 64, baseType: !725, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1013, file: !39, line: 65, baseType: !730, size: 32)
