; ModuleID = 'sound/usb/card.bc'
source_filename = "sound/usb/card.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon.46 }
%struct.module = type { i32, %struct.list_head, [56 x i8], %struct.module_kobject, %struct.module_attribute*, i8*, i8*, %struct.kobject*, %struct.kernel_symbol*, i32*, i32, %struct.mutex, %struct.kernel_param*, i32, i32, %struct.kernel_symbol*, i32*, i8, %struct.kernel_symbol*, i32*, i32, i32, %struct.exception_table_entry*, i32 ()*, [40 x i8], %struct.module_layout, %struct.module_layout, %struct.mod_arch_specific, i64, i32, %struct.list_head, %struct.bug_entry*, %struct.mod_kallsyms*, %struct.mod_kallsyms, %struct.module_sect_attrs*, %struct.module_notes_attrs*, i8*, i8*, i32, i32, %struct.tracepoint**, i32, i8**, %struct.trace_event_call**, i32, %struct.trace_enum_map**, i32, %struct.list_head, %struct.list_head, void ()*, %struct.atomic_t, [12 x i8] }
%struct.module_kobject = type { %struct.kobject, %struct.module*, %struct.kobject*, %struct.module_param_attrs*, %struct.completion* }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }

!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !102, line: 70, size: 32, elements: !103)
!102 = !DIFile(filename: "./include/linux/pm_qos.h", directory: "/diffkemp/kernel/linux-4.11")
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0)
!105 = !DIEnumerator(name: "PM_QOS_MAX", value: 1)
!106 = !DIEnumerator(name: "PM_QOS_MIN", value: 2)
!107 = !DIEnumerator(name: "PM_QOS_SUM", value: 3)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !102, line: 55, size: 32, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "DEV_PM_QOS_RESUME_LATENCY", value: 1)
!111 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY_TOLERANCE", value: 2)
!112 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 3)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_interface_condition", file: !114, line: 95, size: 32, elements: !115)
!114 = !DIFile(filename: "./include/linux/usb.h", directory: "/diffkemp/kernel/linux-4.11")
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "USB_INTERFACE_UNBOUND", value: 0)
!117 = !DIEnumerator(name: "USB_INTERFACE_BINDING", value: 1)
!118 = !DIEnumerator(name: "USB_INTERFACE_BOUND", value: 2)
!119 = !DIEnumerator(name: "USB_INTERFACE_UNBINDING", value: 3)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_device_removable", file: !114, line: 407, size: 32, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE_UNKNOWN", value: 0)
!123 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE", value: 1)
!124 = !DIEnumerator(name: "USB_DEVICE_FIXED", value: 2)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 9, size: 32, elements: !127)
!126 = !DIFile(filename: "./include/linux/stddef.h", directory: "/diffkemp/kernel/linux-4.11")
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "false", value: 0)
!129 = !DIEnumerator(name: "true", value: 1)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "snd_device_state", file: !131, line: 67, size: 32, elements: !132)
!131 = !DIFile(filename: "./include/sound/core.h", directory: "/diffkemp/kernel/linux-4.11")
!132 = !{!133, !134, !135}
!133 = !DIEnumerator(name: "SNDRV_DEV_BUILD", value: 0)
!134 = !DIEnumerator(name: "SNDRV_DEV_REGISTERED", value: 1)
!135 = !DIEnumerator(name: "SNDRV_DEV_DISCONNECTED", value: 2)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "snd_device_type", file: !131, line: 52, size: 32, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!138 = !DIEnumerator(name: "SNDRV_DEV_LOWLEVEL", value: 0)
!139 = !DIEnumerator(name: "SNDRV_DEV_CONTROL", value: 1)
!140 = !DIEnumerator(name: "SNDRV_DEV_INFO", value: 2)
!141 = !DIEnumerator(name: "SNDRV_DEV_BUS", value: 3)
!142 = !DIEnumerator(name: "SNDRV_DEV_CODEC", value: 4)
!143 = !DIEnumerator(name: "SNDRV_DEV_PCM", value: 5)
!144 = !DIEnumerator(name: "SNDRV_DEV_COMPRESS", value: 6)
!145 = !DIEnumerator(name: "SNDRV_DEV_RAWMIDI", value: 7)
!146 = !DIEnumerator(name: "SNDRV_DEV_TIMER", value: 8)
!147 = !DIEnumerator(name: "SNDRV_DEV_SEQUENCER", value: 9)
!148 = !DIEnumerator(name: "SNDRV_DEV_HWDEP", value: 10)
!149 = !DIEnumerator(name: "SNDRV_DEV_JACK", value: 11)
!150 = !{!151, !152, !157, !158, !162, !163, !167, !168, !172, !173, !175, !3386, !160, !3399, !1371, !3401, !257, !391, !230, !184, !4163, !4340, !5096}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !155, line: 20, baseType: !156)
!155 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-4.11")
!156 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !155, line: 23, baseType: !161)
!161 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !155, line: 26, baseType: !166)
!166 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !155, line: 30, baseType: !171)
!171 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 328, size: 6144, align: 512, elements: !177)
!177 = !{!178, !179, !186, !191, !3162, !3188, !3189, !3190, !3191, !3199, !3203, !3204, !3205, !3256, !3257, !3258, !3259, !3260, !3261, !3262, !3263, !3264, !3265, !3273, !3277, !3295, !3296, !3299, !3300, !3301, !3302, !3311, !3333, !3334, !3337, !3340, !3341, !3342, !3343, !3344, !3369, !3370, !3372, !3376, !3377, !3381, !3382, !3383, !3384, !3385}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !6, line: 329, baseType: !5, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !176, file: !6, line: 332, baseType: !180, size: 128, offset: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !181, line: 184, size: 128, elements: !182)
!181 = !DIFile(filename: "./include/linux/types.h", directory: "/diffkemp/kernel/linux-4.11")
!182 = !{!183, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !181, line: 185, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !181, line: 185, baseType: !184, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !6, line: 335, baseType: !187, size: 448, offset: 192)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 448, elements: !189)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !{!190}
!190 = !DISubrange(count: 56)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !176, file: !6, line: 338, baseType: !192, size: 768, offset: 640)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 42, size: 768, elements: !193)
!193 = !{!194, !3156, !3157, !3158, !3161}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !192, file: !6, line: 43, baseType: !195, size: 512)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !196, line: 63, size: 512, elements: !197)
!196 = !DIFile(filename: "./include/linux/kobject.h", directory: "/diffkemp/kernel/linux-4.11")
!197 = !{!198, !201, !202, !204, !270, !346, !3141, !3151, !3152, !3153, !3154, !3155}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 64, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !195, file: !196, line: 65, baseType: !180, size: 128, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !195, file: !196, line: 66, baseType: !203, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !195, file: !196, line: 67, baseType: !205, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !196, line: 168, size: 768, elements: !207)
!207 = !{!208, !209, !231, !232}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !206, file: !196, line: 169, baseType: !180, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !206, file: !196, line: 170, baseType: !210, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !211, line: 76, baseType: !212)
!211 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-4.11")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !211, line: 64, size: 32, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, scope: !212, file: !211, line: 65, baseType: !215, size: 32)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !211, line: 65, size: 32, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !215, file: !211, line: 66, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !211, line: 20, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !218, file: !211, line: 21, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !222, line: 33, baseType: !223)
!222 = !DIFile(filename: "./include/asm-generic/qspinlock_types.h", directory: "/diffkemp/kernel/linux-4.11")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !222, line: 31, size: 32, elements: !224)
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !222, line: 32, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !181, line: 176, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 174, size: 32, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !227, file: !181, line: 175, baseType: !230, size: 32)
!230 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !206, file: !196, line: 171, baseType: !195, size: 512, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !206, file: !196, line: 172, baseType: !233, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !196, line: 132, size: 192, elements: !236)
!236 = !{!237, !242, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !235, file: !196, line: 133, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!230, !205, !203}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !196, line: 134, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!199, !205, !203}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !235, file: !196, line: 135, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!230, !205, !203, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !196, line: 124, size: 18688, elements: !254)
!254 = !{!255, !260, !264, !265, !269}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !253, file: !196, line: 125, baseType: !256, size: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 192, elements: !258)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!258 = !{!259}
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !253, file: !196, line: 126, baseType: !261, size: 2048, offset: 192)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 2048, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !253, file: !196, line: 127, baseType: !230, size: 32, offset: 2240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !253, file: !196, line: 128, baseType: !266, size: 16384, offset: 2272)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 16384, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 2048)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !253, file: !196, line: 129, baseType: !230, size: 32, offset: 18656)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !195, file: !196, line: 68, baseType: !271, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !196, line: 116, size: 320, elements: !273)
!273 = !{!274, !278, !307, !309, !342}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !272, file: !196, line: 117, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !203}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !272, file: !196, line: 118, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !282, line: 209, size: 128, elements: !283)
!282 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-4.11")
!283 = !{!284, !299}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !281, file: !282, line: 210, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !203, !293, !257}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !181, line: 59, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !290, line: 72, baseType: !291)
!290 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-4.11")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !290, line: 14, baseType: !292)
!292 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !282, line: 29, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !282, line: 30, baseType: !199, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !294, file: !282, line: 31, baseType: !298, size: 16, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !181, line: 18, baseType: !161)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !281, file: !282, line: 211, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!288, !203, !293, !199, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !181, line: 54, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !290, line: 71, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !290, line: 15, baseType: !306)
!306 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !272, file: !196, line: 119, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !272, file: !196, line: 120, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !203}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 384, elements: !316)
!316 = !{!317, !318, !324, !328, !334, !338}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !13, line: 41, baseType: !12, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !315, file: !13, line: 42, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !181, line: 29, baseType: !323)
!323 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !315, file: !13, line: 43, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!151}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !315, file: !13, line: 44, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!173, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !13, line: 20, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !315, file: !13, line: 45, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!173}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !315, file: !13, line: 46, baseType: !339, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !151}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !272, file: !196, line: 121, baseType: !343, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!173, !203}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !195, file: !196, line: 69, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !349, line: 107, size: 960, elements: !350)
!349 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/diffkemp/kernel/linux-4.11")
!350 = !{!351, !352, !353, !354, !355, !363, !364, !365, !3134, !3135, !3136, !3137, !3138}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !348, file: !349, line: 108, baseType: !226, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !348, file: !349, line: 109, baseType: !226, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !348, file: !349, line: 119, baseType: !347, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !349, line: 120, baseType: !199, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !348, file: !349, line: 122, baseType: !356, size: 192, align: 64, offset: 192)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !357, line: 36, size: 192, align: 64, elements: !358)
!357 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/diffkemp/kernel/linux-4.11")
!358 = !{!359, !360, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !356, file: !357, line: 37, baseType: !306, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !356, file: !357, line: 38, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !356, file: !357, line: 39, baseType: !361, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !348, file: !349, line: 124, baseType: !173, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !348, file: !349, line: 125, baseType: !166, size: 32, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !348, file: !349, line: 126, baseType: !366, size: 256, offset: 512)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !348, file: !349, line: 126, size: 256, elements: !367)
!367 = !{!368, !3078, !3082}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !366, file: !349, line: 127, baseType: !369, size: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !349, line: 75, size: 192, elements: !370)
!370 = !{!371, !372, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !369, file: !349, line: 76, baseType: !306, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !369, file: !349, line: 78, baseType: !373, size: 64, offset: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !357, line: 43, size: 64, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !373, file: !357, line: 44, baseType: !361, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !369, file: !349, line: 84, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !349, line: 160, size: 640, elements: !379)
!379 = !{!380, !381, !382, !424, !3076, !3077}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !378, file: !349, line: 162, baseType: !347, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !378, file: !349, line: 163, baseType: !166, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ino_ida", scope: !378, file: !349, line: 166, baseType: !383, size: 128, offset: 128)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !384, line: 177, size: 128, elements: !385)
!384 = !DIFile(filename: "./include/linux/idr.h", directory: "/diffkemp/kernel/linux-4.11")
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ida_rt", scope: !383, file: !384, line: 178, baseType: !387, size: 128)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "radix_tree_root", file: !388, line: 112, size: 128, elements: !389)
!388 = !DIFile(filename: "./include/linux/radix-tree.h", directory: "/diffkemp/kernel/linux-4.11")
!389 = !{!390, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !387, file: !388, line: 113, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !181, line: 157, baseType: !166)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rnode", scope: !387, file: !388, line: 114, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "radix_tree_node", file: !388, line: 93, size: 4608, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !403, !416, !420}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !394, file: !388, line: 94, baseType: !156, size: 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !394, file: !388, line: 95, baseType: !156, size: 8, offset: 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !394, file: !388, line: 96, baseType: !156, size: 8, offset: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "exceptional", scope: !394, file: !388, line: 97, baseType: !156, size: 8, offset: 24)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !394, file: !388, line: 98, baseType: !393, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !394, file: !388, line: 99, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !388, line: 100, baseType: !404, size: 128, offset: 192)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !388, line: 100, size: 128, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !404, file: !388, line: 101, baseType: !180, size: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "callback_head", scope: !404, file: !388, line: 102, baseType: !408, size: 128, align: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !181, line: 222, size: 128, align: 64, elements: !409)
!409 = !{!410, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !181, line: 223, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !408, file: !181, line: 224, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !411}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !394, file: !388, line: 104, baseType: !417, size: 4096, offset: 320)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 4096, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !394, file: !388, line: 105, baseType: !421, size: 192, offset: 4416)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 192, elements: !422)
!422 = !{!259, !423}
!423 = !DISubrange(count: 1)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !378, file: !349, line: 167, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !349, line: 147, size: 384, elements: !427)
!427 = !{!428, !433, !3060, !3064, !3068, !3072}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !426, file: !349, line: 148, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!230, !377, !432, !257}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !426, file: !349, line: 149, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!230, !437, !377}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !439, line: 15, size: 1024, elements: !440)
!439 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/diffkemp/kernel/linux-4.11")
!440 = !{!441, !442, !443, !444, !445, !446, !450, !451, !454, !472, !494, !495, !3059}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !438, file: !439, line: 16, baseType: !257, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !438, file: !439, line: 17, baseType: !303, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !438, file: !439, line: 18, baseType: !303, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !438, file: !439, line: 19, baseType: !303, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !438, file: !439, line: 20, baseType: !303, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !438, file: !439, line: 21, baseType: !447, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !181, line: 45, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !290, line: 87, baseType: !449)
!449 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !438, file: !439, line: 22, baseType: !447, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !438, file: !439, line: 23, baseType: !452, size: 64, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !453, line: 25, baseType: !171)
!453 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-4.11")
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !439, line: 24, baseType: !455, size: 256, offset: 512)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !456, line: 53, size: 256, elements: !457)
!456 = !DIFile(filename: "./include/linux/mutex.h", directory: "/diffkemp/kernel/linux-4.11")
!457 = !{!458, !465, !466, !471}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !455, file: !456, line: 54, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !460, line: 23, baseType: !461)
!460 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/diffkemp/kernel/linux-4.11")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !181, line: 181, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 179, size: 64, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !462, file: !181, line: 180, baseType: !292, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !455, file: !456, line: 55, baseType: !210, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !455, file: !456, line: 57, baseType: !467, size: 32, offset: 96)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !468, line: 14, size: 32, elements: !469)
!468 = !DIFile(filename: "./include/linux/osq_lock.h", directory: "/diffkemp/kernel/linux-4.11")
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !467, file: !468, line: 19, baseType: !226, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !455, file: !456, line: 59, baseType: !180, size: 128, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !438, file: !439, line: 25, baseType: !473, size: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !439, line: 31, size: 256, elements: !476)
!476 = !{!477, !482, !486, !490}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !475, file: !439, line: 32, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!151, !437, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !475, file: !439, line: 33, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !437, !151}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !439, line: 34, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!151, !437, !151, !481}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !475, file: !439, line: 35, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!230, !437, !151}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !438, file: !439, line: 26, baseType: !230, size: 32, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !438, file: !439, line: 27, baseType: !496, size: 64, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !499, line: 835, size: 1984, align: 32, elements: !500)
!499 = !DIFile(filename: "./include/linux/fs.h", directory: "/diffkemp/kernel/linux-4.11")
!500 = !{!501, !511, !3015, !3016, !3017, !3018, !3019, !3020, !3021, !3022, !3023, !3043, !3044, !3053, !3054, !3055, !3056, !3057, !3058}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !498, file: !499, line: 839, baseType: !502, size: 128)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !498, file: !499, line: 836, size: 128, elements: !503)
!503 = !{!504, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !502, file: !499, line: 837, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !506, line: 70, size: 64, elements: !507)
!506 = !DIFile(filename: "./include/linux/llist.h", directory: "/diffkemp/kernel/linux-4.11")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !506, line: 71, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !502, file: !499, line: 838, baseType: !408, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !498, file: !499, line: 840, baseType: !512, size: 128, offset: 128)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !513, line: 7, size: 128, elements: !514)
!513 = !DIFile(filename: "./include/linux/path.h", directory: "/diffkemp/kernel/linux-4.11")
!514 = !{!515, !519}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !512, file: !513, line: 8, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !518, line: 17, flags: DIFlagFwdDecl)
!518 = !DIFile(filename: "./include/linux/dcache.h", directory: "/diffkemp/kernel/linux-4.11")
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !512, file: !513, line: 9, baseType: !520, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !518, line: 84, size: 1536, elements: !522)
!522 = !{!523, !524, !530, !538, !539, !555, !2983, !2985, !2998, !2999, !3000, !3001, !3002, !3007, !3008, !3009}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !521, file: !518, line: 86, baseType: !166, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !521, file: !518, line: 87, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !526, line: 52, baseType: !527)
!526 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-4.11")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !526, line: 47, size: 32, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !527, file: !526, line: 48, baseType: !166, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !521, file: !518, line: 88, baseType: !531, size: 128, offset: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !532, line: 37, size: 128, elements: !533)
!532 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-4.11")
!533 = !{!534, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !532, line: 38, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !531, file: !532, line: 38, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !521, file: !518, line: 89, baseType: !520, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !521, file: !518, line: 90, baseType: !540, size: 128, offset: 256)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !518, line: 46, size: 128, elements: !541)
!541 = !{!542, !552}
!542 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !518, line: 47, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !518, line: 47, size: 64, elements: !544)
!544 = !{!545, !551}
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !543, file: !518, line: 48, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !543, file: !518, line: 48, size: 64, elements: !547)
!547 = !{!548, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !546, file: !518, line: 49, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !453, line: 22, baseType: !166)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !518, line: 49, baseType: !549, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !543, file: !518, line: 51, baseType: !452, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !518, line: 53, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !521, file: !518, line: 91, baseType: !556, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !499, line: 554, size: 4480, elements: !558)
!558 = !{!559, !560, !561, !569, !576, !577, !580, !581, !737, !2696, !2697, !2698, !2699, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2728, !2729, !2730, !2731, !2732, !2959, !2967, !2968, !2969, !2979, !2980, !2981, !2982}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !557, file: !499, line: 555, baseType: !298, size: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !557, file: !499, line: 556, baseType: !161, size: 16, offset: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !557, file: !499, line: 557, baseType: !562, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !563, line: 22, baseType: !564)
!563 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-4.11")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 20, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !564, file: !563, line: 21, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !181, line: 31, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !290, line: 48, baseType: !166)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !557, file: !499, line: 558, baseType: !570, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !563, line: 27, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 25, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !571, file: !563, line: 26, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !181, line: 32, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !290, line: 49, baseType: !166)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !557, file: !499, line: 559, baseType: !166, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !557, file: !499, line: 562, baseType: !578, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !499, line: 527, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !557, file: !499, line: 563, baseType: !578, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !557, file: !499, line: 566, baseType: !582, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !499, line: 1694, size: 1536, align: 512, elements: !585)
!585 = !{!586, !590, !600, !604, !608, !612, !616, !620, !624, !628, !632, !633, !639, !643, !666, !694, !698, !723, !728, !732, !733}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !584, file: !499, line: 1695, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!520, !556, !520, !166}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !584, file: !499, line: 1696, baseType: !591, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!199, !520, !556, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !596, line: 9, size: 128, elements: !597)
!596 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/diffkemp/kernel/linux-4.11")
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !595, file: !596, line: 10, baseType: !339, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !595, file: !596, line: 11, baseType: !151, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !584, file: !499, line: 1697, baseType: !601, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!230, !556, !230}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !584, file: !499, line: 1698, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!578, !556, !230}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !584, file: !499, line: 1700, baseType: !609, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!230, !520, !257, !230}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !584, file: !499, line: 1702, baseType: !613, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!230, !556, !520, !298, !322}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !584, file: !499, line: 1703, baseType: !617, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!230, !520, !556, !520}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !584, file: !499, line: 1704, baseType: !621, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!230, !556, !520}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !584, file: !499, line: 1705, baseType: !625, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!230, !556, !520, !199}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !584, file: !499, line: 1706, baseType: !629, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!230, !556, !520, !298}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !584, file: !499, line: 1707, baseType: !621, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !584, file: !499, line: 1708, baseType: !634, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!230, !556, !520, !298, !637}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !181, line: 15, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !181, line: 12, baseType: !165)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !584, file: !499, line: 1709, baseType: !640, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!230, !556, !520, !556, !520, !166}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !584, file: !499, line: 1711, baseType: !644, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!230, !520, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !499, line: 193, size: 640, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !662, !663, !664}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !648, file: !499, line: 194, baseType: !166, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !648, file: !499, line: 195, baseType: !298, size: 16, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !648, file: !499, line: 196, baseType: !562, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !648, file: !499, line: 197, baseType: !570, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !648, file: !499, line: 198, baseType: !447, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !648, file: !499, line: 199, baseType: !656, size: 128, offset: 192)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !657, line: 9, size: 128, elements: !658)
!657 = !DIFile(filename: "./include/uapi/linux/time.h", directory: "/diffkemp/kernel/linux-4.11")
!658 = !{!659, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !656, file: !657, line: 10, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time_t", file: !290, line: 88, baseType: !291)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !656, file: !657, line: 11, baseType: !292, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !648, file: !499, line: 200, baseType: !656, size: 128, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !648, file: !499, line: 201, baseType: !656, size: 128, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !648, file: !499, line: 208, baseType: !665, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !584, file: !499, line: 1712, baseType: !667, size: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!230, !670, !672, !549, !166}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !674, line: 23, size: 1088, elements: !675)
!674 = !DIFile(filename: "./include/linux/stat.h", directory: "/diffkemp/kernel/linux-4.11")
!675 = !{!676, !677, !678, !679, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !673, file: !674, line: 24, baseType: !549, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !673, file: !674, line: 25, baseType: !298, size: 16, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !673, file: !674, line: 26, baseType: !166, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !673, file: !674, line: 27, baseType: !680, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !181, line: 108, baseType: !165)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !673, file: !674, line: 28, baseType: !452, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !673, file: !674, line: 29, baseType: !452, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !673, file: !674, line: 37, baseType: !452, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !673, file: !674, line: 38, baseType: !637, size: 32, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !673, file: !674, line: 39, baseType: !637, size: 32, offset: 352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !673, file: !674, line: 40, baseType: !562, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !673, file: !674, line: 41, baseType: !570, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !673, file: !674, line: 42, baseType: !447, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !673, file: !674, line: 43, baseType: !656, size: 128, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !673, file: !674, line: 44, baseType: !656, size: 128, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !673, file: !674, line: 45, baseType: !656, size: 128, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !673, file: !674, line: 46, baseType: !656, size: 128, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !673, file: !674, line: 47, baseType: !452, size: 64, offset: 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !584, file: !499, line: 1713, baseType: !695, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!288, !520, !257, !303}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !584, file: !499, line: 1714, baseType: !699, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!230, !556, !702, !452, !452}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !499, line: 1582, size: 192, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fi_flags", scope: !703, file: !499, line: 1583, baseType: !166, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_mapped", scope: !703, file: !499, line: 1584, baseType: !166, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_max", scope: !703, file: !499, line: 1585, baseType: !166, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_start", scope: !703, file: !499, line: 1586, baseType: !709, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !711, line: 16, size: 448, elements: !712)
!711 = !DIFile(filename: "./include/uapi/linux/fiemap.h", directory: "/diffkemp/kernel/linux-4.11")
!712 = !{!713, !714, !715, !716, !720, !721}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !710, file: !711, line: 17, baseType: !170, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !710, file: !711, line: 19, baseType: !170, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !710, file: !711, line: 21, baseType: !170, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !710, file: !711, line: 22, baseType: !717, size: 128, offset: 192)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 2)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !710, file: !711, line: 23, baseType: !165, size: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !710, file: !711, line: 24, baseType: !722, size: 96, offset: 352)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 96, elements: !258)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !584, file: !499, line: 1716, baseType: !724, size: 64, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!230, !556, !727, !230}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !584, file: !499, line: 1717, baseType: !729, size: 64, offset: 1152)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!230, !556, !520, !665, !166, !298, !432}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !584, file: !499, line: 1720, baseType: !629, size: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !584, file: !499, line: 1721, baseType: !734, size: 64, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!230, !556, !578, !230}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !557, file: !499, line: 567, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !499, line: 1293, size: 11776, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !783, !2327, !2363, !2446, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2463, !2467, !2471, !2472, !2504, !2505, !2508, !2509, !2510, !2551, !2579, !2581, !2583, !2584, !2585, !2587, !2588, !2589, !2590, !2591, !2650, !2651, !2666, !2667, !2668, !2671, !2672, !2673, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !739, file: !499, line: 1294, baseType: !180, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !739, file: !499, line: 1295, baseType: !637, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !739, file: !499, line: 1296, baseType: !156, size: 8, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !739, file: !499, line: 1297, baseType: !306, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !739, file: !499, line: 1298, baseType: !447, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !739, file: !499, line: 1299, baseType: !747, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !499, line: 2015, size: 448, elements: !749)
!749 = !{!750, !751, !752, !756, !760, !761, !762, !772, !776, !777, !778, !780, !781, !782}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !499, line: 2016, baseType: !199, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !748, file: !499, line: 2017, baseType: !230, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !748, file: !499, line: 2023, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!520, !747, !230, !199, !151}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !748, file: !499, line: 2025, baseType: !757, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !738}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !748, file: !499, line: 2026, baseType: !175, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !748, file: !499, line: 2027, baseType: !747, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !748, file: !499, line: 2028, baseType: !763, size: 64, offset: 384)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !181, line: 188, size: 64, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !763, file: !181, line: 189, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !181, line: 192, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !181, line: 193, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !767, file: !181, line: 193, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !748, file: !499, line: 2030, baseType: !773, offset: 448)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !774, line: 444, elements: !775)
!774 = !DIFile(filename: "./include/linux/lockdep.h", directory: "/diffkemp/kernel/linux-4.11")
!775 = !{}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !748, file: !499, line: 2031, baseType: !773, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !748, file: !499, line: 2032, baseType: !773, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !748, file: !499, line: 2033, baseType: !779, offset: 448)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, elements: !258)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !748, file: !499, line: 2035, baseType: !773, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !748, file: !499, line: 2036, baseType: !773, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !748, file: !499, line: 2037, baseType: !773, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !739, file: !499, line: 1300, baseType: !784, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !499, line: 1773, size: 1600, elements: !787)
!787 = !{!788, !792, !796, !800, !806, !810, !811, !812, !816, !820, !821, !822, !823, !829, !833, !834, !838, !839, !840, !841, !845, !849, !905, !2314, !2326}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !786, file: !499, line: 1774, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!556, !738}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !786, file: !499, line: 1775, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !556}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !786, file: !499, line: 1777, baseType: !797, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !556, !230}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !786, file: !499, line: 1778, baseType: !801, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!230, !556, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !499, line: 264, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !786, file: !499, line: 1779, baseType: !807, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!230, !556}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !786, file: !499, line: 1780, baseType: !793, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !786, file: !499, line: 1781, baseType: !757, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !786, file: !499, line: 1782, baseType: !813, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!230, !738, !230}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !786, file: !499, line: 1783, baseType: !817, size: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!230, !738}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !786, file: !499, line: 1784, baseType: !817, size: 64, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !786, file: !499, line: 1785, baseType: !817, size: 64, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !786, file: !499, line: 1786, baseType: !817, size: 64, offset: 704)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !786, file: !499, line: 1787, baseType: !824, size: 64, offset: 768)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!230, !520, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !499, line: 48, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !786, file: !499, line: 1788, baseType: !830, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!230, !738, !432, !257}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !786, file: !499, line: 1789, baseType: !757, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !786, file: !499, line: 1791, baseType: !835, size: 64, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!230, !437, !520}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !786, file: !499, line: 1792, baseType: !835, size: 64, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !786, file: !499, line: 1793, baseType: !835, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !786, file: !499, line: 1794, baseType: !835, size: 64, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "quota_read", scope: !786, file: !499, line: 1796, baseType: !842, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!288, !738, !230, !257, !303, !447}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "quota_write", scope: !786, file: !499, line: 1797, baseType: !846, size: 64, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!288, !738, !230, !199, !303, !447}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "get_dquots", scope: !786, file: !499, line: 1798, baseType: !850, size: 64, offset: 1344)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !556}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dquot", file: !19, line: 295, size: 1856, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !870, !871, !887, !888, !889}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dq_hash", scope: !855, file: !19, line: 296, baseType: !767, size: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dq_inuse", scope: !855, file: !19, line: 297, baseType: !180, size: 128, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dq_free", scope: !855, file: !19, line: 298, baseType: !180, size: 128, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dq_dirty", scope: !855, file: !19, line: 299, baseType: !180, size: 128, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dq_lock", scope: !855, file: !19, line: 300, baseType: !455, size: 256, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dq_count", scope: !855, file: !19, line: 301, baseType: !226, size: 32, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dq_wait_unused", scope: !855, file: !19, line: 302, baseType: !864, size: 192, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !865, line: 44, baseType: !866)
!865 = !DIFile(filename: "./include/linux/wait.h", directory: "/diffkemp/kernel/linux-4.11")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__wait_queue_head", file: !865, line: 40, size: 192, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !866, file: !865, line: 41, baseType: !210, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !866, file: !865, line: 42, baseType: !180, size: 128, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dq_sb", scope: !855, file: !19, line: 303, baseType: !738, size: 64, offset: 1024)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dq_id", scope: !855, file: !19, line: 304, baseType: !872, size: 64, offset: 1088)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kqid", file: !19, line: 68, size: 64, elements: !873)
!873 = !{!874, !886}
!874 = !DIDerivedType(tag: DW_TAG_member, scope: !872, file: !19, line: 69, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !872, file: !19, line: 69, size: 32, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !875, file: !19, line: 70, baseType: !562, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !875, file: !19, line: 71, baseType: !570, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "projid", scope: !875, file: !19, line: 72, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "kprojid_t", file: !881, line: 23, baseType: !882)
!881 = !DIFile(filename: "./include/linux/projid.h", directory: "/diffkemp/kernel/linux-4.11")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !881, line: 21, size: 32, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !882, file: !881, line: 22, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "projid_t", file: !881, line: 19, baseType: !568)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !872, file: !19, line: 74, baseType: !18, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dq_off", scope: !855, file: !19, line: 305, baseType: !447, size: 64, offset: 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "dq_flags", scope: !855, file: !19, line: 306, baseType: !306, size: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dq_dqb", scope: !855, file: !19, line: 307, baseType: !890, size: 576, offset: 1280)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_dqblk", file: !19, line: 205, size: 576, elements: !891)
!891 = !{!892, !894, !895, !896, !897, !898, !899, !900, !904}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bhardlimit", scope: !890, file: !19, line: 206, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsize_t", file: !19, line: 66, baseType: !449)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bsoftlimit", scope: !890, file: !19, line: 207, baseType: !893, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curspace", scope: !890, file: !19, line: 208, baseType: !893, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_rsvspace", scope: !890, file: !19, line: 209, baseType: !893, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_ihardlimit", scope: !890, file: !19, line: 210, baseType: !893, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_isoftlimit", scope: !890, file: !19, line: 211, baseType: !893, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curinodes", scope: !890, file: !19, line: 212, baseType: !893, size: 64, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_btime", scope: !890, file: !19, line: 213, baseType: !901, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !902, line: 7, baseType: !903)
!902 = !DIFile(filename: "./include/linux/time64.h", directory: "/diffkemp/kernel/linux-4.11")
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !155, line: 29, baseType: !449)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_itime", scope: !890, file: !19, line: 214, baseType: !901, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !786, file: !499, line: 1800, baseType: !906, size: 64, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!230, !738, !909, !391}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !911, line: 40, size: 512, align: 128, elements: !912)
!911 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/diffkemp/kernel/linux-4.11")
!912 = !{!913, !914, !2261, !2266, !2286, !2306}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !910, file: !911, line: 42, baseType: !306, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, scope: !910, file: !911, line: 44, baseType: !915, size: 64, offset: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !911, line: 44, size: 64, elements: !916)
!916 = !{!917, !2259, !2260}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !915, file: !911, line: 45, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !499, line: 379, size: 1216, align: 64, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !2146, !2147, !2148, !2149, !2254, !2255, !2256, !2257, !2258}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !919, file: !499, line: 380, baseType: !556, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "page_tree", scope: !919, file: !499, line: 381, baseType: !387, size: 128, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tree_lock", scope: !919, file: !499, line: 382, baseType: !210, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !919, file: !499, line: 383, baseType: !226, size: 32, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !919, file: !499, line: 384, baseType: !373, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !919, file: !499, line: 385, baseType: !927, size: 320, offset: 320)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !928, line: 29, size: 320, elements: !929)
!928 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/diffkemp/kernel/linux-4.11")
!929 = !{!930, !931, !932, !934, !935}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !927, file: !928, line: 30, baseType: !459, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !927, file: !928, line: 31, baseType: !180, size: 128, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !927, file: !928, line: 32, baseType: !933, size: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !211, line: 32, baseType: !218)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !927, file: !928, line: 34, baseType: !467, size: 32, offset: 224)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !927, file: !928, line: 39, baseType: !936, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !938, line: 483, size: 52736, elements: !939)
!938 = !DIFile(filename: "./include/linux/sched.h", directory: "/diffkemp/kernel/linux-4.11")
!939 = !{!940, !945, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !967, !1030, !1041, !1044, !1122, !1123, !1124, !1125, !1133, !1140, !1141, !1148, !1149, !1421, !1422, !1428, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1495, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1529, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1556, !1558, !1700, !1701, !1702, !1706, !1709, !1716, !1721, !1724, !1727, !1730, !1733, !1736, !1742, !1743, !1744, !1750, !1751, !1752, !1753, !1754, !1757, !1758, !1759, !1767, !1768, !1769, !1770, !1771, !1776, !1777, !1778, !1781, !1782, !1785, !1788, !1791, !1794, !1797, !1798, !1874, !1885, !1886, !1887, !1888, !1894, !1895, !1896, !1897, !1900, !1901, !1904, !1907, !1908, !1911, !1915, !1916, !1917, !1918, !1919, !1920, !1926, !1927, !1930, !1936, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1952, !1953}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !937, file: !938, line: 489, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !942, line: 55, size: 64, elements: !943)
!942 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/diffkemp/kernel/linux-4.11")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !941, file: !942, line: 56, baseType: !306, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !937, file: !938, line: 492, baseType: !946, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !292)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !937, file: !938, line: 493, baseType: !151, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !937, file: !938, line: 494, baseType: !226, size: 32, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !938, line: 496, baseType: !166, size: 32, offset: 224)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !937, file: !938, line: 497, baseType: !166, size: 32, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !937, file: !938, line: 500, baseType: !505, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !937, file: !938, line: 501, baseType: !230, size: 32, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !937, file: !938, line: 504, baseType: !166, size: 32, offset: 416)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flips", scope: !937, file: !938, line: 506, baseType: !166, size: 32, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flip_decay_ts", scope: !937, file: !938, line: 507, baseType: !306, size: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last_wakee", scope: !937, file: !938, line: 508, baseType: !936, size: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "wake_cpu", scope: !937, file: !938, line: 510, baseType: !230, size: 32, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !937, file: !938, line: 512, baseType: !230, size: 32, offset: 672)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !937, file: !938, line: 514, baseType: !230, size: 32, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !937, file: !938, line: 515, baseType: !230, size: 32, offset: 736)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !937, file: !938, line: 516, baseType: !230, size: 32, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !937, file: !938, line: 517, baseType: !166, size: 32, offset: 800)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !937, file: !938, line: 519, baseType: !964, size: 64, offset: 832)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !938, line: 519, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !937, file: !938, line: 520, baseType: !968, size: 3584, offset: 1024)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !938, line: 359, size: 3584, elements: !969)
!969 = !{!970, !975, !976, !977, !978, !979, !980, !981, !982, !983, !1014, !1015, !1017, !1020, !1021}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !968, file: !938, line: 361, baseType: !971, size: 128)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !938, line: 257, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !971, file: !938, line: 258, baseType: !306, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !971, file: !938, line: 259, baseType: !549, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !968, file: !938, line: 362, baseType: !356, size: 192, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !968, file: !938, line: 363, baseType: !180, size: 128, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !968, file: !938, line: 364, baseType: !166, size: 32, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !968, file: !938, line: 366, baseType: !452, size: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !968, file: !938, line: 367, baseType: !452, size: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !968, file: !938, line: 368, baseType: !452, size: 64, offset: 640)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !968, file: !938, line: 369, baseType: !452, size: 64, offset: 704)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !968, file: !938, line: 371, baseType: !452, size: 64, offset: 768)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !968, file: !938, line: 373, baseType: !984, size: 1728, offset: 832)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !938, line: 323, size: 1728, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !984, file: !938, line: 325, baseType: !452, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !984, file: !938, line: 326, baseType: !452, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !984, file: !938, line: 327, baseType: !452, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !984, file: !938, line: 328, baseType: !452, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !984, file: !938, line: 329, baseType: !452, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !984, file: !938, line: 330, baseType: !452, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !984, file: !938, line: 332, baseType: !452, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !984, file: !938, line: 333, baseType: !452, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !984, file: !938, line: 334, baseType: !995, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !453, line: 24, baseType: !449)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !984, file: !938, line: 336, baseType: !452, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !984, file: !938, line: 337, baseType: !452, size: 64, offset: 640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !984, file: !938, line: 338, baseType: !452, size: 64, offset: 704)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !984, file: !938, line: 339, baseType: !452, size: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !984, file: !938, line: 341, baseType: !452, size: 64, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !984, file: !938, line: 342, baseType: !452, size: 64, offset: 896)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !984, file: !938, line: 343, baseType: !452, size: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !984, file: !938, line: 344, baseType: !452, size: 64, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !984, file: !938, line: 345, baseType: !452, size: 64, offset: 1088)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !984, file: !938, line: 347, baseType: !452, size: 64, offset: 1152)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !984, file: !938, line: 348, baseType: !452, size: 64, offset: 1216)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !984, file: !938, line: 349, baseType: !452, size: 64, offset: 1280)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !984, file: !938, line: 350, baseType: !452, size: 64, offset: 1344)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !984, file: !938, line: 351, baseType: !452, size: 64, offset: 1408)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !984, file: !938, line: 352, baseType: !452, size: 64, offset: 1472)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !984, file: !938, line: 353, baseType: !452, size: 64, offset: 1536)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !984, file: !938, line: 354, baseType: !452, size: 64, offset: 1600)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !984, file: !938, line: 355, baseType: !452, size: 64, offset: 1664)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !968, file: !938, line: 376, baseType: !230, size: 32, offset: 2560)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !968, file: !938, line: 377, baseType: !1016, size: 64, offset: 2624)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !968, file: !938, line: 379, baseType: !1018, size: 64, offset: 2688)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !938, line: 35, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !968, file: !938, line: 381, baseType: !1018, size: 64, offset: 2752)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !968, file: !938, line: 391, baseType: !1022, size: 320, align: 512, offset: 3072)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !938, line: 314, size: 320, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1029}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "last_update_time", scope: !1022, file: !938, line: 315, baseType: !452, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "load_sum", scope: !1022, file: !938, line: 316, baseType: !452, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "util_sum", scope: !1022, file: !938, line: 317, baseType: !549, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "period_contrib", scope: !1022, file: !938, line: 318, baseType: !549, size: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg", scope: !1022, file: !938, line: 319, baseType: !306, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "util_avg", scope: !1022, file: !938, line: 320, baseType: !306, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !937, file: !938, line: 521, baseType: !1031, size: 384, offset: 4608)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !938, line: 395, size: 384, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !1031, file: !938, line: 396, baseType: !180, size: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1031, file: !938, line: 397, baseType: !306, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !1031, file: !938, line: 398, baseType: !306, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !1031, file: !938, line: 399, baseType: !166, size: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !1031, file: !938, line: 400, baseType: !161, size: 16, offset: 288)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !1031, file: !938, line: 401, baseType: !161, size: 16, offset: 304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !1031, file: !938, line: 403, baseType: !1040, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !937, file: !938, line: 523, baseType: !1042, size: 64, offset: 4992)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !938, line: 54, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !937, file: !938, line: 525, baseType: !1045, size: 1216, offset: 5056)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !938, line: 413, size: 1216, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1045, file: !938, line: 414, baseType: !356, size: 192, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !1045, file: !938, line: 421, baseType: !452, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !1045, file: !938, line: 422, baseType: !452, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !1045, file: !938, line: 423, baseType: !452, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !1045, file: !938, line: 424, baseType: !452, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !1045, file: !938, line: 431, baseType: !995, size: 64, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !1045, file: !938, line: 432, baseType: !452, size: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1045, file: !938, line: 433, baseType: !166, size: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !1045, file: !938, line: 449, baseType: !230, size: 32, offset: 608)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dl_boosted", scope: !1045, file: !938, line: 450, baseType: !230, size: 32, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !1045, file: !938, line: 451, baseType: !230, size: 32, offset: 672)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !1045, file: !938, line: 457, baseType: !1059, size: 512, offset: 704)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !25, line: 93, size: 512, elements: !1060)
!1060 = !{!1061, !1069, !1070, !1075, !1119, !1121}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1059, file: !25, line: 94, baseType: !1062, size: 256)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !1063, line: 8, size: 256, elements: !1064)
!1063 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/diffkemp/kernel/linux-4.11")
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1062, file: !1063, line: 9, baseType: !356, size: 192, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1062, file: !1063, line: 10, baseType: !1067, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !1068, line: 28, baseType: !995)
!1068 = !DIFile(filename: "./include/linux/ktime.h", directory: "/diffkemp/kernel/linux-4.11")
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !1059, file: !25, line: 95, baseType: !1067, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1059, file: !25, line: 96, baseType: !1071, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!24, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1059, file: !25, line: 97, baseType: !1076, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !25, line: 130, size: 512, align: 512, elements: !1078)
!1078 = !{!1079, !1104, !1105, !1108, !1114, !1118}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !1077, file: !25, line: 131, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !25, line: 174, size: 2560, align: 512, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1081, file: !25, line: 175, baseType: !933, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1081, file: !25, line: 176, baseType: !525, size: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !1081, file: !25, line: 177, baseType: !1074, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !1081, file: !25, line: 178, baseType: !166, size: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !1081, file: !25, line: 179, baseType: !166, size: 32, offset: 160)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !1081, file: !25, line: 180, baseType: !166, size: 32, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "migration_enabled", scope: !1081, file: !25, line: 181, baseType: !322, size: 8, offset: 224)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nohz_active", scope: !1081, file: !25, line: 182, baseType: !322, size: 8, offset: 232)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !1081, file: !25, line: 184, baseType: !166, size: 1, offset: 240, flags: DIFlagBitField, extraData: i64 240)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !1081, file: !25, line: 185, baseType: !166, size: 1, offset: 241, flags: DIFlagBitField, extraData: i64 240)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !1081, file: !25, line: 186, baseType: !166, size: 1, offset: 242, flags: DIFlagBitField, extraData: i64 240)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !1081, file: !25, line: 187, baseType: !1067, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !1081, file: !25, line: 188, baseType: !1074, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "nr_events", scope: !1081, file: !25, line: 189, baseType: !166, size: 32, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nr_retries", scope: !1081, file: !25, line: 190, baseType: !166, size: 32, offset: 416)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nr_hangs", scope: !1081, file: !25, line: 191, baseType: !166, size: 32, offset: 448)
