; ModuleID = 'drivers/watchdog/sbc8360.bc'
source_filename = "drivers/watchdog/sbc8360.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kernel_param_ops = type { i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.kernel_param_ops*, i16, i16, %union.anon }
%union.anon = type { i8* }
%struct.smp_ops = type { void ()*, void (i32)*, void (i32)*, void (i32)*, void (i32)*, i32 (i32, %struct.task_struct*)*, i32 ()*, void (i32)*, void ()*, void (%struct.cpumask*)*, void (i32)* }
%struct.task_struct = type opaque
%struct.cpumask = type { [64 x i64] }
%struct.resource = type { i64, i64, i8*, i64, %struct.resource*, %struct.resource*, %struct.resource* }
%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.miscdevice = type { i32, i8*, %struct.file_operations*, %struct.list_head, %struct.device*, %struct.device*, i8*, i16 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "__param_str_timeout", scope: !2, file: !3, line: 201, type: !2303, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !56)
!3 = !DIFile(filename: "drivers/watchdog/sbc8360.c", directory: "/diffkemp/kernel/linux-3.10")
!4 = !{!5, !12, !18, !24, !30, !37, !45}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 202, size: 32, elements: !7)
!6 = !DIFile(filename: "include/linux/module.h", directory: "/diffkemp/kernel/linux-3.10")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!9 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!10 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!11 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !13, line: 27, size: 32, elements: !14)
!13 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/diffkemp/kernel/linux-3.10")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !19, line: 53, size: 32, elements: !20)
!19 = !DIFile(filename: "include/linux/quota.h", directory: "/diffkemp/kernel/linux-3.10")
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "USRQUOTA", value: 0)
!22 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!23 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !25, line: 10, size: 32, elements: !26)
!25 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/diffkemp/kernel/linux-3.10")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!28 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!29 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !31, line: 6, size: 32, elements: !32)
!31 = !DIFile(filename: "include/linux/pid.h", directory: "/diffkemp/kernel/linux-3.10")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!34 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!35 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!36 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !38, line: 492, size: 32, elements: !39)
!38 = !DIFile(filename: "include/linux/pm.h", directory: "/diffkemp/kernel/linux-3.10")
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!41 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!42 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!43 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!44 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !38, line: 470, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!48 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!49 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!50 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!51 = !{!52, !53}
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !{!57, !117, !122, !127, !129, !134, !139, !144, !149, !154, !159, !0, !164, !166, !171, !176, !190, !2289, !2291, !2293, !2295, !2299, !2301}
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "__param_timeout", scope: !2, file: !3, line: 201, type: !59, isLocal: true, isDefinition: true, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !61, line: 48, size: 256, elements: !62)
!61 = !DIFile(filename: "include/linux/moduleparam.h", directory: "/diffkemp/kernel/linux-3.10")
!62 = !{!63, !66, !87, !91, !94}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !61, line: 49, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !60, file: !61, line: 50, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !61, line: 39, size: 192, elements: !70)
!70 = !{!71, !77, !82}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !69, file: !61, line: 41, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !64, !76}
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !69, file: !61, line: 43, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!75, !81, !76}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !69, file: !61, line: 45, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !60, file: !61, line: 51, baseType: !88, size: 16, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !89, line: 19, baseType: !90)
!89 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !60, file: !61, line: 52, baseType: !92, size: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !89, line: 18, baseType: !93)
!93 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !60, file: !61, line: 53, baseType: !95, size: 64, offset: 192)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !61, line: 53, size: 64, elements: !96)
!96 = !{!97, !98, !106}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !95, file: !61, line: 54, baseType: !86, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !95, file: !61, line: 55, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !61, line: 61, size: 128, elements: !102)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !101, file: !61, line: 62, baseType: !104, size: 32)
!104 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !101, file: !61, line: 63, baseType: !81, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !95, file: !61, line: 56, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !61, line: 67, size: 256, elements: !110)
!110 = !{!111, !112, !113, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !109, file: !61, line: 69, baseType: !104, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !109, file: !61, line: 70, baseType: !104, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !109, file: !61, line: 71, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !109, file: !61, line: 72, baseType: !67, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !109, file: !61, line: 73, baseType: !86, size: 64, offset: 192)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_timeouttype201", scope: !2, file: !3, line: 201, type: !119, isLocal: true, isDefinition: true, align: 8)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 168, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 21)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_timeout202", scope: !2, file: !3, line: 202, type: !124, isLocal: true, isDefinition: true, align: 8)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "__param_nowayout", scope: !2, file: !3, line: 203, type: !59, isLocal: true, isDefinition: true, align: 64)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_nowayouttype203", scope: !2, file: !3, line: 203, type: !131, isLocal: true, isDefinition: true, align: 8)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 184, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 23)
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_nowayout206", scope: !2, file: !3, line: 204, type: !136, isLocal: true, isDefinition: true, align: 8)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 528, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 66)
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author403", scope: !2, file: !3, line: 403, type: !141, isLocal: true, isDefinition: true, align: 8)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 328, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 41)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description404", scope: !2, file: !3, line: 404, type: !146, isLocal: true, isDefinition: true, align: 8)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 288, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 36)
!149 = !DIGlobalVariableExpression(var: !150)
!150 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license405", scope: !2, file: !3, line: 405, type: !151, isLocal: true, isDefinition: true, align: 8)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 12)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_version406", scope: !2, file: !3, line: 406, type: !156, isLocal: true, isDefinition: true, align: 8)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 104, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 13)
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_alias407", scope: !2, file: !3, line: 407, type: !161, isLocal: true, isDefinition: true, align: 8)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 24)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "timeout", scope: !2, file: !3, line: 196, type: !75, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "__param_str_nowayout", scope: !2, file: !3, line: 203, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 72, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 9)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "nowayout", scope: !2, file: !3, line: 199, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !174, line: 29, baseType: !175)
!174 = !DIFile(filename: "include/linux/types.h", directory: "/diffkemp/kernel/linux-3.10")
!175 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "sbc8360_notifier", scope: !2, file: !3, line: 325, type: !178, isLocal: true, isDefinition: true)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !179, line: 53, size: 192, elements: !180)
!179 = !DIFile(filename: "include/linux/notifier.h", directory: "/diffkemp/kernel/linux-3.10")
!180 = !{!181, !188, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !178, file: !179, line: 54, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !179, line: 50, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!75, !186, !187, !86}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!187 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !179, line: 55, baseType: !186, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !178, file: !179, line: 56, baseType: !75, size: 32, offset: 128)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "sbc8360_miscdev", scope: !2, file: !3, line: 314, type: !192, isLocal: true, isDefinition: true)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "miscdevice", file: !193, line: 52, size: 576, elements: !194)
!193 = !DIFile(filename: "include/linux/miscdevice.h", directory: "/diffkemp/kernel/linux-3.10")
!194 = !{!195, !196, !197, !1884, !1885, !2286, !2287, !2288}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !192, file: !193, line: 53, baseType: !75, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !193, line: 54, baseType: !64, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fops", scope: !192, file: !193, line: 55, baseType: !198, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !201, line: 1517, size: 1728, elements: !202)
!201 = !DIFile(filename: "include/linux/fs.h", directory: "/diffkemp/kernel/linux-3.10")
!202 = !{!203, !639, !1786, !1791, !1795, !1799, !1800, !1808, !1814, !1818, !1819, !1826, !1830, !1834, !1835, !1839, !1843, !1847, !1851, !1855, !1859, !1863, !1864, !1868, !1872, !1876, !1880}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !200, file: !201, line: 1518, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 223, size: 4928, elements: !206)
!206 = !{!207, !208, !214, !218, !458, !484, !485, !486, !487, !495, !498, !499, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !539, !540, !541, !542, !551, !572, !573, !574, !575, !576, !577, !580, !583, !584, !585, !586, !587, !611, !612, !614, !618, !619, !620, !621, !622, !623, !627, !628, !634, !638}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !205, file: !6, line: 225, baseType: !5, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !205, file: !6, line: 228, baseType: !209, size: 128, offset: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !174, line: 185, size: 128, elements: !210)
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !174, line: 186, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !209, file: !174, line: 186, baseType: !212, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !6, line: 231, baseType: !215, size: 448, offset: 192)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 448, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 56)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !205, file: !6, line: 234, baseType: !219, size: 704, offset: 640)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 40, size: 704, elements: !220)
!220 = !{!221, !453, !454, !455}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !219, file: !6, line: 41, baseType: !222, size: 512)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !223, line: 60, size: 512, elements: !224)
!223 = !DIFile(filename: "include/linux/kobject.h", directory: "/diffkemp/kernel/linux-3.10")
!224 = !{!225, !226, !227, !229, !360, !436, !439, !448, !449, !450, !451, !452}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !223, line: 61, baseType: !64, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !222, file: !223, line: 62, baseType: !209, size: 128, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !222, file: !223, line: 63, baseType: !228, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !222, file: !223, line: 64, baseType: !230, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !223, line: 159, size: 1280, elements: !232)
!232 = !{!233, !234, !326, !327}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !231, file: !223, line: 160, baseType: !209, size: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !231, file: !223, line: 161, baseType: !235, size: 576, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !236, line: 76, baseType: !237)
!236 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !236, line: 64, size: 576, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !236, line: 65, baseType: !240, size: 576)
!240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !236, line: 65, size: 576, elements: !241)
!241 = !{!242, !318}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !240, file: !236, line: 66, baseType: !243, size: 576)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !236, line: 20, size: 576, elements: !244)
!244 = !{!245, !262, !263, !264, !265}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !243, file: !236, line: 21, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !247, line: 27, baseType: !248)
!247 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_spinlock", file: !247, line: 20, size: 32, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !247, line: 21, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !247, line: 21, size: 32, elements: !252)
!252 = !{!253, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "head_tail", scope: !251, file: !247, line: 22, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticketpair_t", file: !247, line: 15, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !89, line: 22, baseType: !104)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tickets", scope: !251, file: !247, line: 25, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__raw_tickets", file: !247, line: 23, size: 32, elements: !258)
!258 = !{!259, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !257, file: !247, line: 24, baseType: !260, size: 16)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticket_t", file: !247, line: 14, baseType: !88)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !257, file: !247, line: 24, baseType: !260, size: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !243, file: !236, line: 26, baseType: !104, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_cpu", scope: !243, file: !236, line: 26, baseType: !104, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !243, file: !236, line: 27, baseType: !86, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !243, file: !236, line: 30, baseType: !266, size: 384, offset: 192)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_map", file: !267, line: 150, size: 384, elements: !268)
!267 = !DIFile(filename: "include/linux/lockdep.h", directory: "/diffkemp/kernel/linux-3.10")
!268 = !{!269, !280, !315, !316, !317}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !266, file: !267, line: 151, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !267, line: 54, size: 64, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "subkeys", scope: !271, file: !267, line: 55, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, elements: !278)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockdep_subclass_key", file: !267, line: 50, size: 8, elements: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__one_byte", scope: !275, file: !267, line: 51, baseType: !52, size: 8)
!278 = !{!279}
!279 = !DISubrange(count: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "class_cache", scope: !266, file: !267, line: 152, baseType: !281, size: 128, offset: 64)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !313)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class", file: !267, line: 65, size: 3968, elements: !284)
!284 = !{!285, !286, !287, !289, !290, !291, !292, !302, !303, !304, !305, !306, !307, !308, !312}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !283, file: !267, line: 69, baseType: !209, size: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lock_entry", scope: !283, file: !267, line: 74, baseType: !209, size: 128, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !283, file: !267, line: 76, baseType: !288, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "subclass", scope: !283, file: !267, line: 77, baseType: !104, size: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dep_gen_id", scope: !283, file: !267, line: 78, baseType: !104, size: 32, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "usage_mask", scope: !283, file: !267, line: 83, baseType: !187, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "usage_traces", scope: !283, file: !267, line: 84, baseType: !293, size: 2496, offset: 448)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 2496, elements: !157)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_trace", file: !295, line: 10, size: 192, elements: !296)
!295 = !DIFile(filename: "include/linux/stacktrace.h", directory: "/diffkemp/kernel/linux-3.10")
!296 = !{!297, !298, !299, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nr_entries", scope: !294, file: !295, line: 11, baseType: !104, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !294, file: !295, line: 11, baseType: !104, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !294, file: !295, line: 12, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !294, file: !295, line: 13, baseType: !75, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "locks_after", scope: !283, file: !267, line: 91, baseType: !209, size: 128, offset: 2944)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "locks_before", scope: !283, file: !267, line: 91, baseType: !209, size: 128, offset: 3072)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !283, file: !267, line: 97, baseType: !104, size: 32, offset: 3200)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !283, file: !267, line: 102, baseType: !187, size: 64, offset: 3264)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !267, line: 104, baseType: !64, size: 64, offset: 3328)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name_version", scope: !283, file: !267, line: 105, baseType: !75, size: 32, offset: 3392)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "contention_point", scope: !283, file: !267, line: 108, baseType: !309, size: 256, offset: 3456)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 256, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 4)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "contending_point", scope: !283, file: !267, line: 109, baseType: !309, size: 256, offset: 3712)
!313 = !{!314}
!314 = !DISubrange(count: 2)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !267, line: 153, baseType: !64, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !266, file: !267, line: 155, baseType: !75, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !266, file: !267, line: 156, baseType: !187, size: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, scope: !240, file: !236, line: 70, baseType: !319, size: 576)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !236, line: 70, size: 576, elements: !320)
!320 = !{!321, !325}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__padding", scope: !319, file: !236, line: 71, baseType: !322, size: 192)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 192, elements: !162)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !89, line: 16, baseType: !324)
!324 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !319, file: !236, line: 72, baseType: !266, size: 384, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !231, file: !223, line: 162, baseType: !222, size: 512, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !231, file: !223, line: 163, baseType: !328, size: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !223, line: 123, size: 192, elements: !331)
!331 = !{!332, !337, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !330, file: !223, line: 124, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!75, !230, !228}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !223, line: 125, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!64, !230, !228}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !330, file: !223, line: 126, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!75, !230, !228, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !223, line: 116, size: 18496, elements: !349)
!349 = !{!350, !354, !355, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !348, file: !223, line: 117, baseType: !351, size: 2048)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !348, file: !223, line: 118, baseType: !75, size: 32, offset: 2048)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !348, file: !223, line: 119, baseType: !356, size: 16384, offset: 2080)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16384, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 2048)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !348, file: !223, line: 120, baseType: !75, size: 32, offset: 18464)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !222, file: !223, line: 65, baseType: !361, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !223, line: 108, size: 320, elements: !363)
!363 = !{!364, !368, !406, !408, !432}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !362, file: !223, line: 109, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !228}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !362, file: !223, line: 110, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !372, line: 124, size: 192, elements: !373)
!372 = !DIFile(filename: "include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-3.10")
!373 = !{!374, !391, !398}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !371, file: !372, line: 125, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !228, !382, !81}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !174, line: 59, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !380, line: 72, baseType: !381)
!380 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-3.10")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !380, line: 14, baseType: !55)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !372, line: 26, size: 256, elements: !384)
!384 = !{!385, !386, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !372, line: 27, baseType: !64, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !383, file: !372, line: 28, baseType: !387, size: 16, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !174, line: 18, baseType: !90)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_lockdep", scope: !383, file: !372, line: 30, baseType: !173, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !383, file: !372, line: 31, baseType: !270, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !383, file: !372, line: 32, baseType: !271, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !371, file: !372, line: 126, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!378, !228, !382, !64, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !174, line: 54, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !380, line: 71, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !380, line: 15, baseType: !187)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !371, file: !372, line: 127, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !228, !404}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !362, file: !223, line: 111, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !362, file: !223, line: 112, baseType: !409, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !228}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 320, elements: !415)
!415 = !{!416, !417, !421, !427, !431}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !13, line: 41, baseType: !12, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !414, file: !13, line: 42, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!86}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !414, file: !13, line: 43, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!402, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !13, line: 20, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !414, file: !13, line: 44, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!402}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !414, file: !13, line: 45, baseType: !83, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !362, file: !223, line: 113, baseType: !433, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!402, !228}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !222, file: !223, line: 66, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_dirent", file: !372, line: 130, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !222, file: !223, line: 67, baseType: !440, size: 32, offset: 448)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !441, line: 24, size: 32, elements: !442)
!441 = !DIFile(filename: "include/linux/kref.h", directory: "/diffkemp/kernel/linux-3.10")
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !440, file: !441, line: 25, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !174, line: 177, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 175, size: 32, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !445, file: !174, line: 176, baseType: !75, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !222, file: !223, line: 68, baseType: !104, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !222, file: !223, line: 69, baseType: !104, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !222, file: !223, line: 70, baseType: !104, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !222, file: !223, line: 71, baseType: !104, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !222, file: !223, line: 72, baseType: !104, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !219, file: !6, line: 42, baseType: !204, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !219, file: !6, line: 43, baseType: !228, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !219, file: !6, line: 44, baseType: !456, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !6, line: 44, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !205, file: !6, line: 235, baseType: !459, size: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !6, line: 47, size: 576, elements: !461)
!461 = !{!462, !463, !468, !472, !476, !480}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !460, file: !6, line: 48, baseType: !383, size: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !460, file: !6, line: 49, baseType: !464, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!378, !459, !467, !81}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !460, file: !6, line: 51, baseType: !469, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!378, !459, !467, !64, !395}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !460, file: !6, line: 53, baseType: !473, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !204, !64}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !460, file: !6, line: 54, baseType: !477, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!75, !204}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !460, file: !6, line: 55, baseType: !481, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !204}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !205, file: !6, line: 236, baseType: !64, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !205, file: !6, line: 237, baseType: !64, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !205, file: !6, line: 238, baseType: !228, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !205, file: !6, line: 241, baseType: !488, size: 64, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !491, line: 26, size: 128, elements: !492)
!491 = !DIFile(filename: "include/linux/export.h", directory: "/diffkemp/kernel/linux-3.10")
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !490, file: !491, line: 28, baseType: !187, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !491, line: 29, baseType: !64, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !205, file: !6, line: 242, baseType: !496, size: 64, offset: 1664)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !205, file: !6, line: 243, baseType: !104, size: 32, offset: 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !205, file: !6, line: 246, baseType: !500, size: 64, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !205, file: !6, line: 247, baseType: !104, size: 32, offset: 1856)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !205, file: !6, line: 250, baseType: !104, size: 32, offset: 1888)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !205, file: !6, line: 251, baseType: !488, size: 64, offset: 1920)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !205, file: !6, line: 252, baseType: !496, size: 64, offset: 1984)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "unused_syms", scope: !205, file: !6, line: 256, baseType: !488, size: 64, offset: 2048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "unused_crcs", scope: !205, file: !6, line: 257, baseType: !496, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "num_unused_syms", scope: !205, file: !6, line: 258, baseType: !104, size: 32, offset: 2176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_unused_gpl_syms", scope: !205, file: !6, line: 261, baseType: !104, size: 32, offset: 2208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gpl_syms", scope: !205, file: !6, line: 262, baseType: !488, size: 64, offset: 2240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gpl_crcs", scope: !205, file: !6, line: 263, baseType: !496, size: 64, offset: 2304)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sig_ok", scope: !205, file: !6, line: 268, baseType: !173, size: 8, offset: 2368)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !205, file: !6, line: 272, baseType: !488, size: 64, offset: 2432)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !205, file: !6, line: 273, baseType: !496, size: 64, offset: 2496)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !205, file: !6, line: 274, baseType: !104, size: 32, offset: 2560)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !205, file: !6, line: 277, baseType: !104, size: 32, offset: 2592)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !205, file: !6, line: 278, baseType: !517, size: 64, offset: 2624)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !519, line: 97, size: 64, elements: !520)
!519 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/uaccess.h", directory: "/diffkemp/kernel/linux-3.10")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !518, file: !519, line: 98, baseType: !75, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !518, file: !519, line: 98, baseType: !75, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !205, file: !6, line: 281, baseType: !524, size: 64, offset: 2688)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!75}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !205, file: !6, line: 284, baseType: !86, size: 64, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "module_core", scope: !205, file: !6, line: 287, baseType: !86, size: 64, offset: 2816)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_size", scope: !205, file: !6, line: 290, baseType: !104, size: 32, offset: 2880)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "core_size", scope: !205, file: !6, line: 290, baseType: !104, size: 32, offset: 2912)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init_text_size", scope: !205, file: !6, line: 293, baseType: !104, size: 32, offset: 2944)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "core_text_size", scope: !205, file: !6, line: 293, baseType: !104, size: 32, offset: 2976)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "init_ro_size", scope: !205, file: !6, line: 296, baseType: !104, size: 32, offset: 3008)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "core_ro_size", scope: !205, file: !6, line: 296, baseType: !104, size: 32, offset: 3040)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !205, file: !6, line: 299, baseType: !536, offset: 3072)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !537, line: 9, elements: !538)
!537 = !DIFile(filename: "include/asm-generic/module.h", directory: "/diffkemp/kernel/linux-3.10")
!538 = !{}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !205, file: !6, line: 301, baseType: !104, size: 32, offset: 3072)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !205, file: !6, line: 305, baseType: !104, size: 32, offset: 3104)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !205, file: !6, line: 306, baseType: !209, size: 128, offset: 3136)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !205, file: !6, line: 307, baseType: !543, size: 64, offset: 3264)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !545, line: 18, size: 96, elements: !546)
!545 = !DIFile(filename: "include/asm-generic/bug.h", directory: "/diffkemp/kernel/linux-3.10")
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr_disp", scope: !544, file: !545, line: 22, baseType: !75, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "file_disp", scope: !544, file: !545, line: 28, baseType: !75, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !544, file: !545, line: 30, baseType: !90, size: 16, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !545, line: 32, baseType: !90, size: 16, offset: 80)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !205, file: !6, line: 316, baseType: !552, size: 64, offset: 3328)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !554, line: 198, baseType: !555)
!554 = !DIFile(filename: "include/uapi/linux/elf.h", directory: "/diffkemp/kernel/linux-3.10")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !554, line: 191, size: 192, elements: !556)
!556 = !{!557, !561, !562, !563, !566, !570}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !555, file: !554, line: 192, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !554, line: 20, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !560, line: 26, baseType: !104)
!560 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10")
!561 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !555, file: !554, line: 193, baseType: !324, size: 8, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !555, file: !554, line: 194, baseType: !324, size: 8, offset: 40)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !555, file: !554, line: 195, baseType: !564, size: 16, offset: 48)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !554, line: 16, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !560, line: 23, baseType: !90)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !555, file: !554, line: 196, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !554, line: 15, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !560, line: 30, baseType: !569)
!569 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !555, file: !554, line: 197, baseType: !571, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !554, line: 21, baseType: !568)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "core_symtab", scope: !205, file: !6, line: 316, baseType: !552, size: 64, offset: 3392)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !205, file: !6, line: 317, baseType: !104, size: 32, offset: 3456)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "core_num_syms", scope: !205, file: !6, line: 317, baseType: !104, size: 32, offset: 3488)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !205, file: !6, line: 318, baseType: !81, size: 64, offset: 3520)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "core_strtab", scope: !205, file: !6, line: 318, baseType: !81, size: 64, offset: 3584)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !205, file: !6, line: 321, baseType: !578, size: 64, offset: 3648)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !6, line: 321, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !205, file: !6, line: 324, baseType: !581, size: 64, offset: 3712)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !6, line: 324, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !205, file: !6, line: 329, baseType: !81, size: 64, offset: 3776)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !205, file: !6, line: 333, baseType: !86, size: 64, offset: 3840)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !205, file: !6, line: 334, baseType: !104, size: 32, offset: 3904)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !205, file: !6, line: 338, baseType: !104, size: 32, offset: 3936)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !205, file: !6, line: 339, baseType: !588, size: 64, offset: 3968)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !592, line: 30, size: 320, elements: !593)
!592 = !DIFile(filename: "include/linux/tracepoint.h", directory: "/diffkemp/kernel/linux-3.10")
!593 = !{!594, !595, !600, !604, !605}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !592, line: 31, baseType: !64, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !591, file: !592, line: 32, baseType: !596, size: 32, offset: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !597, line: 136, size: 32, elements: !598)
!597 = !DIFile(filename: "include/linux/jump_label.h", directory: "/diffkemp/kernel/linux-3.10")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !596, file: !597, line: 137, baseType: !444, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "regfunc", scope: !591, file: !592, line: 33, baseType: !601, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "unregfunc", scope: !591, file: !592, line: 34, baseType: !601, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !591, file: !592, line: 35, baseType: !606, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint_func", file: !592, line: 25, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !607, file: !592, line: 26, baseType: !86, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !592, line: 27, baseType: !86, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_bprintk_fmt", scope: !205, file: !6, line: 346, baseType: !104, size: 32, offset: 4032)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "trace_bprintk_fmt_start", scope: !205, file: !6, line: 347, baseType: !613, size: 64, offset: 4096)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "trace_events", scope: !205, file: !6, line: 350, baseType: !615, size: 64, offset: 4160)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftrace_event_call", file: !6, line: 350, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_events", scope: !205, file: !6, line: 351, baseType: !104, size: 32, offset: 4224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num_ftrace_callsites", scope: !205, file: !6, line: 354, baseType: !104, size: 32, offset: 4256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ftrace_callsites", scope: !205, file: !6, line: 355, baseType: !300, size: 64, offset: 4288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "source_list", scope: !205, file: !6, line: 360, baseType: !209, size: 128, offset: 4352)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "target_list", scope: !205, file: !6, line: 362, baseType: !209, size: 128, offset: 4480)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "waiter", scope: !205, file: !6, line: 365, baseType: !624, size: 64, offset: 4608)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !626, line: 20, flags: DIFlagFwdDecl)
!626 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/thread_info.h", directory: "/diffkemp/kernel/linux-3.10")
!627 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !205, file: !6, line: 368, baseType: !601, size: 64, offset: 4672)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "refptr", scope: !205, file: !6, line: 370, baseType: !629, size: 64, offset: 4736)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_ref", file: !6, line: 218, size: 128, align: 128, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "incs", scope: !630, file: !6, line: 219, baseType: !187, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decs", scope: !630, file: !6, line: 220, baseType: !187, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ctors", scope: !205, file: !6, line: 375, baseType: !635, size: 64, offset: 4800)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctor_fn_t", file: !637, line: 145, baseType: !601)
!637 = !DIFile(filename: "include/linux/init.h", directory: "/diffkemp/kernel/linux-3.10")
!638 = !DIDerivedType(tag: DW_TAG_member, name: "num_ctors", scope: !205, file: !6, line: 376, baseType: !104, size: 32, offset: 4864)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "llseek", scope: !200, file: !201, line: 1519, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!643, !646, !643, !75}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !174, line: 45, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !380, line: 87, baseType: !645)
!645 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !201, line: 763, size: 2880, elements: !648)
!648 = !{!649, !662, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1765, !1770, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !647, file: !201, line: 771, baseType: !650, size: 128)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !647, file: !201, line: 768, size: 128, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fu_list", scope: !650, file: !201, line: 769, baseType: !209, size: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !650, file: !201, line: 770, baseType: !654, size: 128)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !174, line: 209, size: 128, elements: !655)
!655 = !{!656, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !174, line: 210, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !654, file: !174, line: 211, baseType: !659, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !657}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !647, file: !201, line: 772, baseType: !663, size: 128, offset: 128)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !664, line: 7, size: 128, elements: !665)
!664 = !DIFile(filename: "include/linux/path.h", directory: "/diffkemp/kernel/linux-3.10")
!665 = !{!666, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !663, file: !664, line: 8, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !669, line: 15, flags: DIFlagFwdDecl)
!669 = !DIFile(filename: "include/linux/dcache.h", directory: "/diffkemp/kernel/linux-3.10")
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !663, file: !664, line: 9, baseType: !671, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !669, line: 103, size: 2112, elements: !673)
!673 = !{!674, !675, !681, !689, !690, !706, !1713, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1727, !1728}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !672, file: !669, line: 105, baseType: !104, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !672, file: !669, line: 106, baseType: !676, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !677, line: 41, baseType: !678)
!677 = !DIFile(filename: "include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-3.10")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !677, line: 39, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !678, file: !677, line: 40, baseType: !104, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !672, file: !669, line: 107, baseType: !682, size: 128, offset: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !683, line: 37, size: 128, elements: !684)
!683 = !DIFile(filename: "include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-3.10")
!684 = !{!685, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !683, line: 38, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !682, file: !683, line: 38, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !672, file: !669, line: 108, baseType: !671, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !672, file: !669, line: 109, baseType: !691, size: 128, offset: 256)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !669, line: 42, size: 128, elements: !692)
!692 = !{!693, !703}
!693 = !DIDerivedType(tag: DW_TAG_member, scope: !691, file: !669, line: 43, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !669, line: 43, size: 64, elements: !695)
!695 = !{!696, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, scope: !694, file: !669, line: 44, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !669, line: 44, size: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !697, file: !669, line: 45, baseType: !255, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !697, file: !669, line: 45, baseType: !255, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !694, file: !669, line: 47, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !89, line: 25, baseType: !569)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !669, line: 49, baseType: !704, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !672, file: !669, line: 110, baseType: !707, size: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !201, line: 521, size: 8256, elements: !709)
!709 = !{!710, !711, !712, !717, !721, !722, !725, !726, !882, !1409, !1546, !1547, !1548, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1576, !1577, !1578, !1579, !1580, !1581, !1687, !1688, !1690, !1691, !1708, !1709, !1710, !1711, !1712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !708, file: !201, line: 522, baseType: !387, size: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !708, file: !201, line: 523, baseType: !90, size: 16, offset: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !708, file: !201, line: 524, baseType: !713, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !714, line: 46, baseType: !715)
!714 = !DIFile(filename: "include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-3.10")
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !174, line: 31, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !380, line: 48, baseType: !104)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !708, file: !201, line: 525, baseType: !718, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !714, line: 47, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !174, line: 32, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !380, line: 49, baseType: !104)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !708, file: !201, line: 526, baseType: !104, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !708, file: !201, line: 529, baseType: !723, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !201, line: 509, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !708, file: !201, line: 530, baseType: !723, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !708, file: !201, line: 533, baseType: !727, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !201, line: 1548, size: 1536, align: 512, elements: !730)
!730 = !{!731, !735, !741, !745, !749, !753, !757, !761, !765, !769, !773, !777, !778, !784, !788, !810, !831, !835, !839, !843, !847, !872, !877}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !729, file: !201, line: 1549, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!671, !707, !671, !104}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "follow_link", scope: !729, file: !201, line: 1550, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!86, !671, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !669, line: 13, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !729, file: !201, line: 1551, baseType: !742, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!75, !707, !75}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !729, file: !201, line: 1552, baseType: !746, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!723, !707, !75}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !729, file: !201, line: 1554, baseType: !750, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!75, !671, !81, !75}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "put_link", scope: !729, file: !201, line: 1555, baseType: !754, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !671, !739, !86}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !729, file: !201, line: 1557, baseType: !758, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!75, !707, !671, !387, !173}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !729, file: !201, line: 1558, baseType: !762, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!75, !671, !707, !671}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !729, file: !201, line: 1559, baseType: !766, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!75, !707, !671}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !729, file: !201, line: 1560, baseType: !770, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!75, !707, !671, !64}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !729, file: !201, line: 1561, baseType: !774, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!75, !707, !671, !387}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !729, file: !201, line: 1562, baseType: !766, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !729, file: !201, line: 1563, baseType: !779, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!75, !707, !671, !387, !782}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !174, line: 15, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !174, line: 12, baseType: !559)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !729, file: !201, line: 1564, baseType: !785, size: 64, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!75, !707, !671, !707, !671}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !729, file: !201, line: 1566, baseType: !789, size: 64, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!75, !671, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !201, line: 224, size: 640, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !807, !808, !809}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !793, file: !201, line: 225, baseType: !104, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !793, file: !201, line: 226, baseType: !387, size: 16, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !793, file: !201, line: 227, baseType: !713, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !793, file: !201, line: 228, baseType: !718, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !793, file: !201, line: 229, baseType: !643, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !793, file: !201, line: 230, baseType: !801, size: 128, offset: 192)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !802, line: 9, size: 128, elements: !803)
!802 = !DIFile(filename: "include/uapi/linux/time.h", directory: "/diffkemp/kernel/linux-3.10")
!803 = !{!804, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !801, file: !802, line: 10, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time_t", file: !380, line: 88, baseType: !381)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !801, file: !802, line: 11, baseType: !55, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !793, file: !201, line: 231, baseType: !801, size: 128, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !793, file: !201, line: 232, baseType: !801, size: 128, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !793, file: !201, line: 239, baseType: !646, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !729, file: !201, line: 1567, baseType: !811, size: 64, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!75, !667, !671, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !816, line: 21, size: 832, elements: !817)
!816 = !DIFile(filename: "include/linux/stat.h", directory: "/diffkemp/kernel/linux-3.10")
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !815, file: !816, line: 22, baseType: !702, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !815, file: !816, line: 23, baseType: !782, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !815, file: !816, line: 24, baseType: !387, size: 16, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !815, file: !816, line: 25, baseType: !104, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !815, file: !816, line: 26, baseType: !713, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !815, file: !816, line: 27, baseType: !718, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !815, file: !816, line: 28, baseType: !782, size: 32, offset: 224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !815, file: !816, line: 29, baseType: !643, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !815, file: !816, line: 30, baseType: !801, size: 128, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !815, file: !816, line: 31, baseType: !801, size: 128, offset: 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !815, file: !816, line: 32, baseType: !801, size: 128, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !815, file: !816, line: 33, baseType: !187, size: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !815, file: !816, line: 34, baseType: !569, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "setxattr", scope: !729, file: !201, line: 1568, baseType: !832, size: 64, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!75, !671, !64, !402, !395, !75}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getxattr", scope: !729, file: !201, line: 1569, baseType: !836, size: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!378, !671, !64, !86, !395}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !729, file: !201, line: 1570, baseType: !840, size: 64, offset: 1152)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!378, !671, !81, !395}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "removexattr", scope: !729, file: !201, line: 1571, baseType: !844, size: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!75, !671, !64}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !729, file: !201, line: 1572, baseType: !848, size: 64, offset: 1280)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!75, !707, !851, !702, !702}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !201, line: 1475, size: 192, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fi_flags", scope: !852, file: !201, line: 1476, baseType: !104, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_mapped", scope: !852, file: !201, line: 1477, baseType: !104, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_max", scope: !852, file: !201, line: 1478, baseType: !104, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_start", scope: !852, file: !201, line: 1479, baseType: !858, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !860, line: 16, size: 448, elements: !861)
!860 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/include/uapi/linux/fiemap.h", directory: "/diffkemp/kernel/linux-3.10")
!861 = !{!862, !863, !864, !865, !867, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !859, file: !860, line: 17, baseType: !568, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !859, file: !860, line: 19, baseType: !568, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !859, file: !860, line: 21, baseType: !568, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !859, file: !860, line: 22, baseType: !866, size: 128, offset: 192)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !313)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !859, file: !860, line: 23, baseType: !559, size: 32, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !859, file: !860, line: 24, baseType: !869, size: 96, offset: 352)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 96, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 3)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !729, file: !201, line: 1574, baseType: !873, size: 64, offset: 1344)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!75, !707, !876, !75}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !729, file: !201, line: 1575, baseType: !878, size: 64, offset: 1408)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!75, !707, !671, !646, !104, !387, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !708, file: !201, line: 534, baseType: !883, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !201, line: 1236, size: 17408, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !925, !1005, !1087, !1180, !1184, !1185, !1186, !1187, !1196, !1197, !1198, !1199, !1204, !1205, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1248, !1252, !1255, !1256, !1298, !1318, !1320, !1324, !1325, !1326, !1328, !1329, !1330, !1331, !1332, !1382, !1383, !1407, !1408}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !884, file: !201, line: 1237, baseType: !209, size: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !884, file: !201, line: 1238, baseType: !782, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !884, file: !201, line: 1239, baseType: !324, size: 8, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !884, file: !201, line: 1240, baseType: !187, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !884, file: !201, line: 1241, baseType: !643, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !884, file: !201, line: 1242, baseType: !892, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !201, line: 1804, size: 1024, elements: !894)
!894 = !{!895, !896, !897, !901, !905, !906, !907, !917, !918, !919, !920, !922, !923, !924}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !893, file: !201, line: 1805, baseType: !64, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !893, file: !201, line: 1806, baseType: !75, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !893, file: !201, line: 1813, baseType: !898, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!671, !892, !75, !64, !86}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !893, file: !201, line: 1815, baseType: !902, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !883}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !893, file: !201, line: 1816, baseType: !204, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !893, file: !201, line: 1817, baseType: !892, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !893, file: !201, line: 1818, baseType: !908, size: 64, offset: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !174, line: 189, size: 64, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !908, file: !174, line: 190, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !174, line: 193, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !174, line: 194, baseType: !911, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !912, file: !174, line: 194, baseType: !916, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !893, file: !201, line: 1820, baseType: !271, size: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !893, file: !201, line: 1821, baseType: !271, size: 64, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !893, file: !201, line: 1822, baseType: !271, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !893, file: !201, line: 1823, baseType: !921, size: 192, offset: 640)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 192, elements: !870)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !893, file: !201, line: 1825, baseType: !271, size: 64, offset: 832)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !893, file: !201, line: 1826, baseType: !271, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !893, file: !201, line: 1827, baseType: !271, size: 64, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !884, file: !201, line: 1243, baseType: !926, size: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !201, line: 1592, size: 1408, elements: !929)
!929 = !{!930, !934, !938, !942, !948, !952, !953, !954, !958, !962, !963, !969, !973, !974, !981, !982, !983, !984, !988, !992, !1000, !1001}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !928, file: !201, line: 1593, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!707, !883}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !928, file: !201, line: 1594, baseType: !935, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !707}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !928, file: !201, line: 1596, baseType: !939, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !707, !75}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !928, file: !201, line: 1597, baseType: !943, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!75, !707, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !201, line: 289, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !928, file: !201, line: 1598, baseType: !949, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!75, !707}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !928, file: !201, line: 1599, baseType: !935, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !928, file: !201, line: 1600, baseType: !902, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !928, file: !201, line: 1601, baseType: !955, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!75, !883, !75}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !928, file: !201, line: 1602, baseType: !959, size: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!75, !883}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !928, file: !201, line: 1603, baseType: !959, size: 64, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !928, file: !201, line: 1604, baseType: !964, size: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!75, !671, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !201, line: 42, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !928, file: !201, line: 1605, baseType: !970, size: 64, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!75, !883, !881, !81}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !928, file: !201, line: 1606, baseType: !902, size: 64, offset: 768)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !928, file: !201, line: 1608, baseType: !975, size: 64, offset: 832)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!75, !978, !671}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !980, line: 330, flags: DIFlagFwdDecl)
!980 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/pgtable_types.h", directory: "/diffkemp/kernel/linux-3.10")
!981 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !928, file: !201, line: 1609, baseType: !975, size: 64, offset: 896)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !928, file: !201, line: 1610, baseType: !975, size: 64, offset: 960)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !928, file: !201, line: 1611, baseType: !975, size: 64, offset: 1024)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "quota_read", scope: !928, file: !201, line: 1613, baseType: !985, size: 64, offset: 1088)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!378, !883, !75, !81, !395, !643}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "quota_write", scope: !928, file: !201, line: 1614, baseType: !989, size: 64, offset: 1152)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!378, !883, !75, !64, !395, !643}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !928, file: !201, line: 1616, baseType: !993, size: 64, offset: 1216)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!75, !883, !996, !999}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !998, line: 18, flags: DIFlagFwdDecl)
!998 = !DIFile(filename: "/diffkemp/kernel/linux-3.10/arch/x86/include/asm/page.h", directory: "/diffkemp/kernel/linux-3.10")
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !174, line: 157, baseType: !104)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cached_objects", scope: !928, file: !201, line: 1617, baseType: !959, size: 64, offset: 1280)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "free_cached_objects", scope: !928, file: !201, line: 1618, baseType: !1002, size: 64, offset: 1344)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !883, !75}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dq_op", scope: !884, file: !201, line: 1244, baseType: !1006, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dquot_operations", file: !19, line: 304, size: 512, elements: !1009)
!1009 = !{!1010, !1070, !1074, !1078, !1079, !1080, !1081, !1082}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "write_dquot", scope: !1008, file: !19, line: 305, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!75, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dquot", file: !19, line: 277, size: 3456, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1032, !1033, !1040, !1041, !1054, !1055, !1056}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dq_hash", scope: !1015, file: !19, line: 278, baseType: !912, size: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dq_inuse", scope: !1015, file: !19, line: 279, baseType: !209, size: 128, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "dq_free", scope: !1015, file: !19, line: 280, baseType: !209, size: 128, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dq_dirty", scope: !1015, file: !19, line: 281, baseType: !209, size: 128, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dq_lock", scope: !1015, file: !19, line: 282, baseType: !1022, size: 1344, offset: 512)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !1023, line: 48, size: 1344, elements: !1024)
!1023 = !DIFile(filename: "include/linux/mutex.h", directory: "/diffkemp/kernel/linux-3.10")
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1022, file: !1023, line: 50, baseType: !444, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1022, file: !1023, line: 51, baseType: !235, size: 576, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1022, file: !1023, line: 52, baseType: !209, size: 128, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1022, file: !1023, line: 54, baseType: !624, size: 64, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !1023, line: 60, baseType: !64, size: 64, offset: 832)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1022, file: !1023, line: 61, baseType: !86, size: 64, offset: 896)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "dep_map", scope: !1022, file: !1023, line: 64, baseType: !266, size: 384, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dq_count", scope: !1015, file: !19, line: 283, baseType: !444, size: 32, offset: 1856)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "dq_wait_unused", scope: !1015, file: !19, line: 284, baseType: !1034, size: 704, offset: 1920)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !1035, line: 37, baseType: !1036)
!1035 = !DIFile(filename: "include/linux/wait.h", directory: "/diffkemp/kernel/linux-3.10")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__wait_queue_head", file: !1035, line: 33, size: 704, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1036, file: !1035, line: 34, baseType: !235, size: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !1036, file: !1035, line: 35, baseType: !209, size: 128, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dq_sb", scope: !1015, file: !19, line: 285, baseType: !883, size: 64, offset: 2624)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dq_id", scope: !1015, file: !19, line: 286, baseType: !1042, size: 64, offset: 2688)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kqid", file: !19, line: 62, size: 64, elements: !1043)
!1043 = !{!1044, !1053}
!1044 = !DIDerivedType(tag: DW_TAG_member, scope: !1042, file: !19, line: 63, baseType: !1045, size: 32)
!1045 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1042, file: !19, line: 63, size: 32, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1045, file: !19, line: 64, baseType: !713, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1045, file: !19, line: 65, baseType: !718, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "projid", scope: !1045, file: !19, line: 66, baseType: !1050, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "kprojid_t", file: !1051, line: 36, baseType: !1052)
!1051 = !DIFile(filename: "include/linux/projid.h", directory: "/diffkemp/kernel/linux-3.10")
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "projid_t", file: !1051, line: 19, baseType: !716)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1042, file: !19, line: 68, baseType: !18, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "dq_off", scope: !1015, file: !19, line: 287, baseType: !643, size: 64, offset: 2752)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "dq_flags", scope: !1015, file: !19, line: 288, baseType: !187, size: 64, offset: 2816)
